#![rustfmt::skip]
#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8)
                .offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)

        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            self.set_bit(index + bit_offset, val_bit_is_set);
        }
    }
    #[inline]
    pub unsafe fn raw_set(this: *mut Self, bit_offset: usize, bit_width: u8, val: u64) {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < core::mem::size_of::<Storage>());
        debug_assert!(
            (bit_offset + (bit_width as usize)) / 8 <= core::mem::size_of::<Storage>(),
        );
        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            unsafe { Self::raw_set_bit(this, index + bit_offset, val_bit_is_set) };
        }
    }
}
pub const CUPTI_API_VERSION: u32 = 130001;
pub const CUPTI_SUBSCRIBER_NAME_MAX_LEN: u32 = 53;
pub const CUPTI_OLD_SUBSCRIBER_NAME_MIN_LEN: u32 = 64;
pub const CUPTILP64: u32 = 1;
pub const CUPTI_SOURCE_LOCATOR_ID_UNKNOWN: u32 = 0;
pub const CUPTI_FUNCTION_INDEX_ID_INVALID: u32 = 0;
pub const CUPTI_CORRELATION_ID_UNKNOWN: u32 = 0;
pub const CUPTI_GRID_ID_UNKNOWN: u32 = 0;
pub const CUPTI_TIMESTAMP_UNKNOWN: u32 = 0;
pub const CUPTI_AUTO_BOOST_INVALID_CLIENT_PID: u32 = 0;
pub const CUPTI_NVLINK_INVALID_PORT: i32 = -1;
pub const CUPTI_MAX_NVLINK_PORTS: u32 = 32;
pub const CUPTI_DECOMPRESSED_BYTES_UNKNOWN: u32 = 0;
pub const CUPTI_MAX_GPUS: u32 = 32;
pub const CUPTI_STALL_REASON_STRING_SIZE: u32 = 128;
pub type CUdevice_v1 = ::std::os::raw::c_int;
pub type CUdevice = CUdevice_v1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUctx_st {
    _unused: [u8; 0],
}
pub type CUcontext = *mut CUctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUevent_st {
    _unused: [u8; 0],
}
pub type CUevent = *mut CUevent_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstream_st {
    _unused: [u8; 0],
}
pub type CUstream = *mut CUstream_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraph_st {
    _unused: [u8; 0],
}
pub type CUgraph = *mut CUgraph_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphNode_st {
    _unused: [u8; 0],
}
pub type CUgraphNode = *mut CUgraphNode_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphExec_st {
    _unused: [u8; 0],
}
pub type CUgraphExec = *mut CUgraphExec_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphDeviceUpdatableNode_st {
    _unused: [u8; 0],
}
pub type CUgraphDeviceNode = *mut CUgraphDeviceUpdatableNode_st;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CUuuid_st {
    pub bytes: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUuuid_st"][::std::mem::size_of::<CUuuid_st>() - 16usize];
    ["Alignment of CUuuid_st"][::std::mem::align_of::<CUuuid_st>() - 1usize];
    [
        "Offset of field: CUuuid_st::bytes",
    ][::std::mem::offset_of!(CUuuid_st, bytes) - 0usize];
};
pub type CUuuid = CUuuid_st;
///< Maximum number of threads per block
pub const CU_DEVICE_ATTRIBUTE_MAX_THREADS_PER_BLOCK: CUdevice_attribute_enum = 1;
///< Maximum block dimension X
pub const CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_X: CUdevice_attribute_enum = 2;
///< Maximum block dimension Y
pub const CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Y: CUdevice_attribute_enum = 3;
///< Maximum block dimension Z
pub const CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Z: CUdevice_attribute_enum = 4;
///< Maximum grid dimension X
pub const CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_X: CUdevice_attribute_enum = 5;
///< Maximum grid dimension Y
pub const CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Y: CUdevice_attribute_enum = 6;
///< Maximum grid dimension Z
pub const CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Z: CUdevice_attribute_enum = 7;
///< Maximum shared memory available per block in bytes
pub const CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK: CUdevice_attribute_enum = 8;
///< Deprecated, use CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK
pub const CU_DEVICE_ATTRIBUTE_SHARED_MEMORY_PER_BLOCK: CUdevice_attribute_enum = 8;
///< Memory available on device for __constant__ variables in a CUDA C kernel in bytes
pub const CU_DEVICE_ATTRIBUTE_TOTAL_CONSTANT_MEMORY: CUdevice_attribute_enum = 9;
///< Warp size in threads
pub const CU_DEVICE_ATTRIBUTE_WARP_SIZE: CUdevice_attribute_enum = 10;
///< Maximum pitch in bytes allowed by memory copies
pub const CU_DEVICE_ATTRIBUTE_MAX_PITCH: CUdevice_attribute_enum = 11;
///< Maximum number of 32-bit registers available per block
pub const CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_BLOCK: CUdevice_attribute_enum = 12;
///< Deprecated, use CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_BLOCK
pub const CU_DEVICE_ATTRIBUTE_REGISTERS_PER_BLOCK: CUdevice_attribute_enum = 12;
///< Typical clock frequency in kilohertz
pub const CU_DEVICE_ATTRIBUTE_CLOCK_RATE: CUdevice_attribute_enum = 13;
///< Alignment requirement for textures
pub const CU_DEVICE_ATTRIBUTE_TEXTURE_ALIGNMENT: CUdevice_attribute_enum = 14;
///< Device can possibly copy memory and execute a kernel concurrently. Deprecated. Use instead CU_DEVICE_ATTRIBUTE_ASYNC_ENGINE_COUNT.
pub const CU_DEVICE_ATTRIBUTE_GPU_OVERLAP: CUdevice_attribute_enum = 15;
///< Number of multiprocessors on device
pub const CU_DEVICE_ATTRIBUTE_MULTIPROCESSOR_COUNT: CUdevice_attribute_enum = 16;
///< Specifies whether there is a run time limit on kernels
pub const CU_DEVICE_ATTRIBUTE_KERNEL_EXEC_TIMEOUT: CUdevice_attribute_enum = 17;
///< Device is integrated with host memory
pub const CU_DEVICE_ATTRIBUTE_INTEGRATED: CUdevice_attribute_enum = 18;
///< Device can map host memory into CUDA address space
pub const CU_DEVICE_ATTRIBUTE_CAN_MAP_HOST_MEMORY: CUdevice_attribute_enum = 19;
///< Compute mode (See ::CUcomputemode for details)
pub const CU_DEVICE_ATTRIBUTE_COMPUTE_MODE: CUdevice_attribute_enum = 20;
///< Maximum 1D texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_WIDTH: CUdevice_attribute_enum = 21;
///< Maximum 2D texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_WIDTH: CUdevice_attribute_enum = 22;
///< Maximum 2D texture height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_HEIGHT: CUdevice_attribute_enum = 23;
///< Maximum 3D texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_WIDTH: CUdevice_attribute_enum = 24;
///< Maximum 3D texture height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_HEIGHT: CUdevice_attribute_enum = 25;
///< Maximum 3D texture depth
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_DEPTH: CUdevice_attribute_enum = 26;
///< Maximum 2D layered texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_WIDTH: CUdevice_attribute_enum = 27;
///< Maximum 2D layered texture height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_HEIGHT: CUdevice_attribute_enum = 28;
///< Maximum layers in a 2D layered texture
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_LAYERS: CUdevice_attribute_enum = 29;
///< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_WIDTH
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_WIDTH: CUdevice_attribute_enum = 27;
///< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_HEIGHT
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_HEIGHT: CUdevice_attribute_enum = 28;
///< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_LAYERS
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_NUMSLICES: CUdevice_attribute_enum = 29;
///< Alignment requirement for surfaces
pub const CU_DEVICE_ATTRIBUTE_SURFACE_ALIGNMENT: CUdevice_attribute_enum = 30;
///< Device can possibly execute multiple kernels concurrently
pub const CU_DEVICE_ATTRIBUTE_CONCURRENT_KERNELS: CUdevice_attribute_enum = 31;
///< Device has ECC support enabled
pub const CU_DEVICE_ATTRIBUTE_ECC_ENABLED: CUdevice_attribute_enum = 32;
///< PCI bus ID of the device
pub const CU_DEVICE_ATTRIBUTE_PCI_BUS_ID: CUdevice_attribute_enum = 33;
///< PCI device ID of the device
pub const CU_DEVICE_ATTRIBUTE_PCI_DEVICE_ID: CUdevice_attribute_enum = 34;
///< Device is using TCC driver model
pub const CU_DEVICE_ATTRIBUTE_TCC_DRIVER: CUdevice_attribute_enum = 35;
///< Peak memory clock frequency in kilohertz
pub const CU_DEVICE_ATTRIBUTE_MEMORY_CLOCK_RATE: CUdevice_attribute_enum = 36;
///< Global memory bus width in bits
pub const CU_DEVICE_ATTRIBUTE_GLOBAL_MEMORY_BUS_WIDTH: CUdevice_attribute_enum = 37;
///< Size of L2 cache in bytes
pub const CU_DEVICE_ATTRIBUTE_L2_CACHE_SIZE: CUdevice_attribute_enum = 38;
///< Maximum resident threads per multiprocessor
pub const CU_DEVICE_ATTRIBUTE_MAX_THREADS_PER_MULTIPROCESSOR: CUdevice_attribute_enum = 39;
///< Number of asynchronous engines
pub const CU_DEVICE_ATTRIBUTE_ASYNC_ENGINE_COUNT: CUdevice_attribute_enum = 40;
///< Device shares a unified address space with the host
pub const CU_DEVICE_ATTRIBUTE_UNIFIED_ADDRESSING: CUdevice_attribute_enum = 41;
///< Maximum 1D layered texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LAYERED_WIDTH: CUdevice_attribute_enum = 42;
///< Maximum layers in a 1D layered texture
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LAYERED_LAYERS: CUdevice_attribute_enum = 43;
///< Deprecated, do not use.
pub const CU_DEVICE_ATTRIBUTE_CAN_TEX2D_GATHER: CUdevice_attribute_enum = 44;
///< Maximum 2D texture width if CUDA_ARRAY3D_TEXTURE_GATHER is set
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_GATHER_WIDTH: CUdevice_attribute_enum = 45;
///< Maximum 2D texture height if CUDA_ARRAY3D_TEXTURE_GATHER is set
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_GATHER_HEIGHT: CUdevice_attribute_enum = 46;
///< Alternate maximum 3D texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_WIDTH_ALTERNATE: CUdevice_attribute_enum = 47;
///< Alternate maximum 3D texture height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_HEIGHT_ALTERNATE: CUdevice_attribute_enum = 48;
///< Alternate maximum 3D texture depth
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_DEPTH_ALTERNATE: CUdevice_attribute_enum = 49;
///< PCI domain ID of the device
pub const CU_DEVICE_ATTRIBUTE_PCI_DOMAIN_ID: CUdevice_attribute_enum = 50;
///< Pitch alignment requirement for textures
pub const CU_DEVICE_ATTRIBUTE_TEXTURE_PITCH_ALIGNMENT: CUdevice_attribute_enum = 51;
///< Maximum cubemap texture width/height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_WIDTH: CUdevice_attribute_enum = 52;
///< Maximum cubemap layered texture width/height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_LAYERED_WIDTH: CUdevice_attribute_enum = 53;
///< Maximum layers in a cubemap layered texture
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_LAYERED_LAYERS: CUdevice_attribute_enum = 54;
///< Maximum 1D surface width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_WIDTH: CUdevice_attribute_enum = 55;
///< Maximum 2D surface width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_WIDTH: CUdevice_attribute_enum = 56;
///< Maximum 2D surface height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_HEIGHT: CUdevice_attribute_enum = 57;
///< Maximum 3D surface width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_WIDTH: CUdevice_attribute_enum = 58;
///< Maximum 3D surface height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_HEIGHT: CUdevice_attribute_enum = 59;
///< Maximum 3D surface depth
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_DEPTH: CUdevice_attribute_enum = 60;
///< Maximum 1D layered surface width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_LAYERED_WIDTH: CUdevice_attribute_enum = 61;
///< Maximum layers in a 1D layered surface
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_LAYERED_LAYERS: CUdevice_attribute_enum = 62;
///< Maximum 2D layered surface width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_WIDTH: CUdevice_attribute_enum = 63;
///< Maximum 2D layered surface height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_HEIGHT: CUdevice_attribute_enum = 64;
///< Maximum layers in a 2D layered surface
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_LAYERS: CUdevice_attribute_enum = 65;
///< Maximum cubemap surface width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_WIDTH: CUdevice_attribute_enum = 66;
///< Maximum cubemap layered surface width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_LAYERED_WIDTH: CUdevice_attribute_enum = 67;
///< Maximum layers in a cubemap layered surface
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_LAYERED_LAYERS: CUdevice_attribute_enum = 68;
///< Deprecated, do not use. Use cudaDeviceGetTexture1DLinearMaxWidth() or cuDeviceGetTexture1DLinearMaxWidth() instead.
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LINEAR_WIDTH: CUdevice_attribute_enum = 69;
///< Maximum 2D linear texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_WIDTH: CUdevice_attribute_enum = 70;
///< Maximum 2D linear texture height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_HEIGHT: CUdevice_attribute_enum = 71;
///< Maximum 2D linear texture pitch in bytes
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_PITCH: CUdevice_attribute_enum = 72;
///< Maximum mipmapped 2D texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_MIPMAPPED_WIDTH: CUdevice_attribute_enum = 73;
///< Maximum mipmapped 2D texture height
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_MIPMAPPED_HEIGHT: CUdevice_attribute_enum = 74;
///< Major compute capability version number
pub const CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MAJOR: CUdevice_attribute_enum = 75;
///< Minor compute capability version number
pub const CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MINOR: CUdevice_attribute_enum = 76;
///< Maximum mipmapped 1D texture width
pub const CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_MIPMAPPED_WIDTH: CUdevice_attribute_enum = 77;
///< Device supports stream priorities
pub const CU_DEVICE_ATTRIBUTE_STREAM_PRIORITIES_SUPPORTED: CUdevice_attribute_enum = 78;
///< Device supports caching globals in L1
pub const CU_DEVICE_ATTRIBUTE_GLOBAL_L1_CACHE_SUPPORTED: CUdevice_attribute_enum = 79;
///< Device supports caching locals in L1
pub const CU_DEVICE_ATTRIBUTE_LOCAL_L1_CACHE_SUPPORTED: CUdevice_attribute_enum = 80;
///< Maximum shared memory available per multiprocessor in bytes
pub const CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_MULTIPROCESSOR: CUdevice_attribute_enum = 81;
///< Maximum number of 32-bit registers available per multiprocessor
pub const CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_MULTIPROCESSOR: CUdevice_attribute_enum = 82;
///< Device can allocate managed memory on this system
pub const CU_DEVICE_ATTRIBUTE_MANAGED_MEMORY: CUdevice_attribute_enum = 83;
///< Device is on a multi-GPU board
pub const CU_DEVICE_ATTRIBUTE_MULTI_GPU_BOARD: CUdevice_attribute_enum = 84;
///< Unique id for a group of devices on the same multi-GPU board
pub const CU_DEVICE_ATTRIBUTE_MULTI_GPU_BOARD_GROUP_ID: CUdevice_attribute_enum = 85;
///< Link between the device and the host supports all native atomic operations
pub const CU_DEVICE_ATTRIBUTE_HOST_NATIVE_ATOMIC_SUPPORTED: CUdevice_attribute_enum = 86;
///< Ratio of single precision performance (in floating-point operations per second) to double precision performance
pub const CU_DEVICE_ATTRIBUTE_SINGLE_TO_DOUBLE_PRECISION_PERF_RATIO: CUdevice_attribute_enum = 87;
///< Device supports coherently accessing pageable memory without calling cudaHostRegister on it
pub const CU_DEVICE_ATTRIBUTE_PAGEABLE_MEMORY_ACCESS: CUdevice_attribute_enum = 88;
///< Device can coherently access managed memory concurrently with the CPU
pub const CU_DEVICE_ATTRIBUTE_CONCURRENT_MANAGED_ACCESS: CUdevice_attribute_enum = 89;
///< Device supports compute preemption.
pub const CU_DEVICE_ATTRIBUTE_COMPUTE_PREEMPTION_SUPPORTED: CUdevice_attribute_enum = 90;
///< Device can access host registered memory at the same virtual address as the CPU
pub const CU_DEVICE_ATTRIBUTE_CAN_USE_HOST_POINTER_FOR_REGISTERED_MEM: CUdevice_attribute_enum = 91;
///< Deprecated, along with v1 MemOps API, ::cuStreamBatchMemOp and related APIs are supported.
pub const CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_MEM_OPS_V1: CUdevice_attribute_enum = 92;
///< Deprecated, along with v1 MemOps API, 64-bit operations are supported in ::cuStreamBatchMemOp and related APIs.
pub const CU_DEVICE_ATTRIBUTE_CAN_USE_64_BIT_STREAM_MEM_OPS_V1: CUdevice_attribute_enum = 93;
///< Deprecated, along with v1 MemOps API, ::CU_STREAM_WAIT_VALUE_NOR is supported.
pub const CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_WAIT_VALUE_NOR_V1: CUdevice_attribute_enum = 94;
///< Device supports launching cooperative kernels via ::cuLaunchCooperativeKernel
pub const CU_DEVICE_ATTRIBUTE_COOPERATIVE_LAUNCH: CUdevice_attribute_enum = 95;
///< Deprecated, ::cuLaunchCooperativeKernelMultiDevice is deprecated.
pub const CU_DEVICE_ATTRIBUTE_COOPERATIVE_MULTI_DEVICE_LAUNCH: CUdevice_attribute_enum = 96;
///< Maximum optin shared memory per block
pub const CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK_OPTIN: CUdevice_attribute_enum = 97;
///< The ::CU_STREAM_WAIT_VALUE_FLUSH flag and the ::CU_STREAM_MEM_OP_FLUSH_REMOTE_WRITES MemOp are supported on the device. See \ref CUDA_MEMOP for additional details.
pub const CU_DEVICE_ATTRIBUTE_CAN_FLUSH_REMOTE_WRITES: CUdevice_attribute_enum = 98;
///< Device supports host memory registration via ::cudaHostRegister.
pub const CU_DEVICE_ATTRIBUTE_HOST_REGISTER_SUPPORTED: CUdevice_attribute_enum = 99;
///< Device accesses pageable memory via the host's page tables.
pub const CU_DEVICE_ATTRIBUTE_PAGEABLE_MEMORY_ACCESS_USES_HOST_PAGE_TABLES: CUdevice_attribute_enum = 100;
///< The host can directly access managed memory on the device without migration.
pub const CU_DEVICE_ATTRIBUTE_DIRECT_MANAGED_MEM_ACCESS_FROM_HOST: CUdevice_attribute_enum = 101;
///< Deprecated, Use CU_DEVICE_ATTRIBUTE_VIRTUAL_MEMORY_MANAGEMENT_SUPPORTED
pub const CU_DEVICE_ATTRIBUTE_VIRTUAL_ADDRESS_MANAGEMENT_SUPPORTED: CUdevice_attribute_enum = 102;
///< Device supports virtual memory management APIs like ::cuMemAddressReserve, ::cuMemCreate, ::cuMemMap and related APIs
pub const CU_DEVICE_ATTRIBUTE_VIRTUAL_MEMORY_MANAGEMENT_SUPPORTED: CUdevice_attribute_enum = 102;
///< Device supports exporting memory to a posix file descriptor with ::cuMemExportToShareableHandle, if requested via ::cuMemCreate
pub const CU_DEVICE_ATTRIBUTE_HANDLE_TYPE_POSIX_FILE_DESCRIPTOR_SUPPORTED: CUdevice_attribute_enum = 103;
///< Device supports exporting memory to a Win32 NT handle with ::cuMemExportToShareableHandle, if requested via ::cuMemCreate
pub const CU_DEVICE_ATTRIBUTE_HANDLE_TYPE_WIN32_HANDLE_SUPPORTED: CUdevice_attribute_enum = 104;
///< Device supports exporting memory to a Win32 KMT handle with ::cuMemExportToShareableHandle, if requested via ::cuMemCreate
pub const CU_DEVICE_ATTRIBUTE_HANDLE_TYPE_WIN32_KMT_HANDLE_SUPPORTED: CUdevice_attribute_enum = 105;
///< Maximum number of blocks per multiprocessor
pub const CU_DEVICE_ATTRIBUTE_MAX_BLOCKS_PER_MULTIPROCESSOR: CUdevice_attribute_enum = 106;
///< Device supports compression of memory
pub const CU_DEVICE_ATTRIBUTE_GENERIC_COMPRESSION_SUPPORTED: CUdevice_attribute_enum = 107;
///< Maximum L2 persisting lines capacity setting in bytes.
pub const CU_DEVICE_ATTRIBUTE_MAX_PERSISTING_L2_CACHE_SIZE: CUdevice_attribute_enum = 108;
///< Maximum value of CUaccessPolicyWindow::num_bytes.
pub const CU_DEVICE_ATTRIBUTE_MAX_ACCESS_POLICY_WINDOW_SIZE: CUdevice_attribute_enum = 109;
///< Device supports specifying the GPUDirect RDMA flag with ::cuMemCreate
pub const CU_DEVICE_ATTRIBUTE_GPU_DIRECT_RDMA_WITH_CUDA_VMM_SUPPORTED: CUdevice_attribute_enum = 110;
///< Shared memory reserved by CUDA driver per block in bytes
pub const CU_DEVICE_ATTRIBUTE_RESERVED_SHARED_MEMORY_PER_BLOCK: CUdevice_attribute_enum = 111;
///< Device supports sparse CUDA arrays and sparse CUDA mipmapped arrays
pub const CU_DEVICE_ATTRIBUTE_SPARSE_CUDA_ARRAY_SUPPORTED: CUdevice_attribute_enum = 112;
///< Device supports using the ::cuMemHostRegister flag ::CU_MEMHOSTERGISTER_READ_ONLY to register memory that must be mapped as read-only to the GPU
pub const CU_DEVICE_ATTRIBUTE_READ_ONLY_HOST_REGISTER_SUPPORTED: CUdevice_attribute_enum = 113;
///< External timeline semaphore interop is supported on the device
pub const CU_DEVICE_ATTRIBUTE_TIMELINE_SEMAPHORE_INTEROP_SUPPORTED: CUdevice_attribute_enum = 114;
///< Device supports using the ::cuMemAllocAsync and ::cuMemPool family of APIs
pub const CU_DEVICE_ATTRIBUTE_MEMORY_POOLS_SUPPORTED: CUdevice_attribute_enum = 115;
///< Device supports GPUDirect RDMA APIs, like nvidia_p2p_get_pages (see https://docs.nvidia.com/cuda/gpudirect-rdma for more information)
pub const CU_DEVICE_ATTRIBUTE_GPU_DIRECT_RDMA_SUPPORTED: CUdevice_attribute_enum = 116;
///< The returned attribute shall be interpreted as a bitmask, where the individual bits are described by the ::CUflushGPUDirectRDMAWritesOptions enum
pub const CU_DEVICE_ATTRIBUTE_GPU_DIRECT_RDMA_FLUSH_WRITES_OPTIONS: CUdevice_attribute_enum = 117;
///< GPUDirect RDMA writes to the device do not need to be flushed for consumers within the scope indicated by the returned attribute. See ::CUGPUDirectRDMAWritesOrdering for the numerical values returned here.
pub const CU_DEVICE_ATTRIBUTE_GPU_DIRECT_RDMA_WRITES_ORDERING: CUdevice_attribute_enum = 118;
///< Handle types supported with mempool based IPC
pub const CU_DEVICE_ATTRIBUTE_MEMPOOL_SUPPORTED_HANDLE_TYPES: CUdevice_attribute_enum = 119;
///< Indicates device supports cluster launch
pub const CU_DEVICE_ATTRIBUTE_CLUSTER_LAUNCH: CUdevice_attribute_enum = 120;
///< Device supports deferred mapping CUDA arrays and CUDA mipmapped arrays
pub const CU_DEVICE_ATTRIBUTE_DEFERRED_MAPPING_CUDA_ARRAY_SUPPORTED: CUdevice_attribute_enum = 121;
///< 64-bit operations are supported in ::cuStreamBatchMemOp and related MemOp APIs.
pub const CU_DEVICE_ATTRIBUTE_CAN_USE_64_BIT_STREAM_MEM_OPS: CUdevice_attribute_enum = 122;
///< ::CU_STREAM_WAIT_VALUE_NOR is supported by MemOp APIs.
pub const CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_WAIT_VALUE_NOR: CUdevice_attribute_enum = 123;
///< Device supports buffer sharing with dma_buf mechanism.
pub const CU_DEVICE_ATTRIBUTE_DMA_BUF_SUPPORTED: CUdevice_attribute_enum = 124;
///< Device supports IPC Events.
pub const CU_DEVICE_ATTRIBUTE_IPC_EVENT_SUPPORTED: CUdevice_attribute_enum = 125;
///< Number of memory domains the device supports.
pub const CU_DEVICE_ATTRIBUTE_MEM_SYNC_DOMAIN_COUNT: CUdevice_attribute_enum = 126;
///< Device supports accessing memory using Tensor Map.
pub const CU_DEVICE_ATTRIBUTE_TENSOR_MAP_ACCESS_SUPPORTED: CUdevice_attribute_enum = 127;
///< Device supports exporting memory to a fabric handle with cuMemExportToShareableHandle() or requested with cuMemCreate()
pub const CU_DEVICE_ATTRIBUTE_HANDLE_TYPE_FABRIC_SUPPORTED: CUdevice_attribute_enum = 128;
///< Device supports unified function pointers.
pub const CU_DEVICE_ATTRIBUTE_UNIFIED_FUNCTION_POINTERS: CUdevice_attribute_enum = 129;
///< NUMA configuration of a device: value is of type ::CUdeviceNumaConfig enum
pub const CU_DEVICE_ATTRIBUTE_NUMA_CONFIG: CUdevice_attribute_enum = 130;
///< NUMA node ID of the GPU memory
pub const CU_DEVICE_ATTRIBUTE_NUMA_ID: CUdevice_attribute_enum = 131;
///< Device supports switch multicast and reduction operations.
pub const CU_DEVICE_ATTRIBUTE_MULTICAST_SUPPORTED: CUdevice_attribute_enum = 132;
///< Indicates if contexts created on this device will be shared via MPS
pub const CU_DEVICE_ATTRIBUTE_MPS_ENABLED: CUdevice_attribute_enum = 133;
///< NUMA ID of the host node closest to the device. Returns -1 when system does not support NUMA.
pub const CU_DEVICE_ATTRIBUTE_HOST_NUMA_ID: CUdevice_attribute_enum = 134;
///< Device supports CIG with D3D12.
pub const CU_DEVICE_ATTRIBUTE_D3D12_CIG_SUPPORTED: CUdevice_attribute_enum = 135;
///< The returned valued shall be interpreted as a bitmask, where the individual bits are described by the ::CUmemDecompressAlgorithm enum.
pub const CU_DEVICE_ATTRIBUTE_MEM_DECOMPRESS_ALGORITHM_MASK: CUdevice_attribute_enum = 136;
///< The returned valued is the maximum length in bytes of a single decompress operation that is allowed.
pub const CU_DEVICE_ATTRIBUTE_MEM_DECOMPRESS_MAXIMUM_LENGTH: CUdevice_attribute_enum = 137;
///< Device supports CIG with Vulkan.
pub const CU_DEVICE_ATTRIBUTE_VULKAN_CIG_SUPPORTED: CUdevice_attribute_enum = 138;
///< The combined 16-bit PCI device ID and 16-bit PCI vendor ID.
pub const CU_DEVICE_ATTRIBUTE_GPU_PCI_DEVICE_ID: CUdevice_attribute_enum = 139;
///< The combined 16-bit PCI subsystem ID and 16-bit PCI subsystem vendor ID.
pub const CU_DEVICE_ATTRIBUTE_GPU_PCI_SUBSYSTEM_ID: CUdevice_attribute_enum = 140;
///< Device supports HOST_NUMA location with the virtual memory management APIs like ::cuMemCreate, ::cuMemMap and related APIs
pub const CU_DEVICE_ATTRIBUTE_HOST_NUMA_VIRTUAL_MEMORY_MANAGEMENT_SUPPORTED: CUdevice_attribute_enum = 141;
///< Device supports HOST_NUMA location with the ::cuMemAllocAsync and ::cuMemPool family of APIs
pub const CU_DEVICE_ATTRIBUTE_HOST_NUMA_MEMORY_POOLS_SUPPORTED: CUdevice_attribute_enum = 142;
///< Device supports HOST_NUMA location IPC between nodes in a multi-node system.
pub const CU_DEVICE_ATTRIBUTE_HOST_NUMA_MULTINODE_IPC_SUPPORTED: CUdevice_attribute_enum = 143;
///< Device suports HOST location with the ::cuMemAllocAsync and ::cuMemPool family of APIs
pub const CU_DEVICE_ATTRIBUTE_HOST_MEMORY_POOLS_SUPPORTED: CUdevice_attribute_enum = 144;
///< Device supports HOST location with the virtual memory management APIs like ::cuMemCreate, ::cuMemMap and related APIs
pub const CU_DEVICE_ATTRIBUTE_HOST_VIRTUAL_MEMORY_MANAGEMENT_SUPPORTED: CUdevice_attribute_enum = 145;
///< Device supports page-locked host memory buffer sharing with dma_buf mechanism.
pub const CU_DEVICE_ATTRIBUTE_HOST_ALLOC_DMA_BUF_SUPPORTED: CUdevice_attribute_enum = 146;
///< Link between the device and the host supports only some native atomic operations
pub const CU_DEVICE_ATTRIBUTE_ONLY_PARTIAL_HOST_NATIVE_ATOMIC_SUPPORTED: CUdevice_attribute_enum = 147;
pub const CU_DEVICE_ATTRIBUTE_MAX: CUdevice_attribute_enum = 148;
/// Device properties
pub type CUdevice_attribute_enum = ::std::os::raw::c_uint;
/// Device properties
pub use self::CUdevice_attribute_enum as CUdevice_attribute;
///< Normal cache persistence.
pub const CU_ACCESS_PROPERTY_NORMAL: CUaccessProperty_enum = 0;
///< Streaming access is less likely to persit from cache.
pub const CU_ACCESS_PROPERTY_STREAMING: CUaccessProperty_enum = 1;
///< Persisting access is more likely to persist in cache.
pub const CU_ACCESS_PROPERTY_PERSISTING: CUaccessProperty_enum = 2;
/// Specifies performance hint with ::CUaccessPolicyWindow for hitProp and missProp members.
pub type CUaccessProperty_enum = ::std::os::raw::c_uint;
/// Specifies performance hint with ::CUaccessPolicyWindow for hitProp and missProp members.
pub use self::CUaccessProperty_enum as CUaccessProperty;
/** Specifies an access policy for a window, a contiguous extent of memory
 beginning at base_ptr and ending at base_ptr + num_bytes.
 num_bytes is limited by CU_DEVICE_ATTRIBUTE_MAX_ACCESS_POLICY_WINDOW_SIZE.
 Partition into many segments and assign segments such that:
 sum of "hit segments" / window == approx. ratio.
 sum of "miss segments" / window == approx 1-ratio.
 Segments and ratio specifications are fitted to the capabilities of
 the architecture.
 Accesses in a hit segment apply the hitProp access policy.
 Accesses in a miss segment apply the missProp access policy.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUaccessPolicyWindow_st {
    ///< Starting address of the access policy window. CUDA driver may align it.
    pub base_ptr: *mut ::std::os::raw::c_void,
    ///< Size in bytes of the window policy. CUDA driver may restrict the maximum size and alignment.
    pub num_bytes: usize,
    ///< hitRatio specifies percentage of lines assigned hitProp, rest are assigned missProp.
    pub hitRatio: f32,
    ///< ::CUaccessProperty set for hit.
    pub hitProp: CUaccessProperty,
    ///< ::CUaccessProperty set for miss. Must be either NORMAL or STREAMING
    pub missProp: CUaccessProperty,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUaccessPolicyWindow_st",
    ][::std::mem::size_of::<CUaccessPolicyWindow_st>() - 32usize];
    [
        "Alignment of CUaccessPolicyWindow_st",
    ][::std::mem::align_of::<CUaccessPolicyWindow_st>() - 8usize];
    [
        "Offset of field: CUaccessPolicyWindow_st::base_ptr",
    ][::std::mem::offset_of!(CUaccessPolicyWindow_st, base_ptr) - 0usize];
    [
        "Offset of field: CUaccessPolicyWindow_st::num_bytes",
    ][::std::mem::offset_of!(CUaccessPolicyWindow_st, num_bytes) - 8usize];
    [
        "Offset of field: CUaccessPolicyWindow_st::hitRatio",
    ][::std::mem::offset_of!(CUaccessPolicyWindow_st, hitRatio) - 16usize];
    [
        "Offset of field: CUaccessPolicyWindow_st::hitProp",
    ][::std::mem::offset_of!(CUaccessPolicyWindow_st, hitProp) - 20usize];
    [
        "Offset of field: CUaccessPolicyWindow_st::missProp",
    ][::std::mem::offset_of!(CUaccessPolicyWindow_st, missProp) - 24usize];
};
impl Default for CUaccessPolicyWindow_st {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** Specifies an access policy for a window, a contiguous extent of memory
 beginning at base_ptr and ending at base_ptr + num_bytes.
 num_bytes is limited by CU_DEVICE_ATTRIBUTE_MAX_ACCESS_POLICY_WINDOW_SIZE.
 Partition into many segments and assign segments such that:
 sum of "hit segments" / window == approx. ratio.
 sum of "miss segments" / window == approx 1-ratio.
 Segments and ratio specifications are fitted to the capabilities of
 the architecture.
 Accesses in a hit segment apply the hitProp access policy.
 Accesses in a miss segment apply the missProp access policy.*/
pub type CUaccessPolicyWindow_v1 = CUaccessPolicyWindow_st;
/// Access policy window
pub type CUaccessPolicyWindow = CUaccessPolicyWindow_v1;
///< GPU kernel node
pub const CU_GRAPH_NODE_TYPE_KERNEL: CUgraphNodeType_enum = 0;
///< Memcpy node
pub const CU_GRAPH_NODE_TYPE_MEMCPY: CUgraphNodeType_enum = 1;
///< Memset node
pub const CU_GRAPH_NODE_TYPE_MEMSET: CUgraphNodeType_enum = 2;
///< Host (executable) node
pub const CU_GRAPH_NODE_TYPE_HOST: CUgraphNodeType_enum = 3;
///< Node which executes an embedded graph
pub const CU_GRAPH_NODE_TYPE_GRAPH: CUgraphNodeType_enum = 4;
///< Empty (no-op) node
pub const CU_GRAPH_NODE_TYPE_EMPTY: CUgraphNodeType_enum = 5;
///< External event wait node
pub const CU_GRAPH_NODE_TYPE_WAIT_EVENT: CUgraphNodeType_enum = 6;
///< External event record node
pub const CU_GRAPH_NODE_TYPE_EVENT_RECORD: CUgraphNodeType_enum = 7;
///< External semaphore signal node
pub const CU_GRAPH_NODE_TYPE_EXT_SEMAS_SIGNAL: CUgraphNodeType_enum = 8;
///< External semaphore wait node
pub const CU_GRAPH_NODE_TYPE_EXT_SEMAS_WAIT: CUgraphNodeType_enum = 9;
///< Memory Allocation Node
pub const CU_GRAPH_NODE_TYPE_MEM_ALLOC: CUgraphNodeType_enum = 10;
///< Memory Free Node
pub const CU_GRAPH_NODE_TYPE_MEM_FREE: CUgraphNodeType_enum = 11;
/**< Batch MemOp Node
See ::cuStreamBatchMemOp and ::CUstreamBatchMemOpType for what these nodes can do.*/
pub const CU_GRAPH_NODE_TYPE_BATCH_MEM_OP: CUgraphNodeType_enum = 12;
/**< Conditional Node

May be used to implement a conditional execution path or loop
inside of a graph. The graph(s) contained within the body of the conditional node
can be selectively executed or iterated upon based on the value of a conditional
variable.

Handles must be created in advance of creating the node
using ::cuGraphConditionalHandleCreate.

The following restrictions apply to graphs which contain conditional nodes:
The graph cannot be used in a child node.
Only one instantiation of the graph may exist at any point in time.
The graph cannot be cloned.

To set the control value, supply a default value when creating the handle and/or
call ::cudaGraphSetConditional from device code.*/
pub const CU_GRAPH_NODE_TYPE_CONDITIONAL: CUgraphNodeType_enum = 13;
/// Graph node types
pub type CUgraphNodeType_enum = ::std::os::raw::c_uint;
/// Graph node types
pub use self::CUgraphNodeType_enum as CUgraphNodeType;
pub const CU_SYNC_POLICY_AUTO: CUsynchronizationPolicy_enum = 1;
pub const CU_SYNC_POLICY_SPIN: CUsynchronizationPolicy_enum = 2;
pub const CU_SYNC_POLICY_YIELD: CUsynchronizationPolicy_enum = 3;
pub const CU_SYNC_POLICY_BLOCKING_SYNC: CUsynchronizationPolicy_enum = 4;
pub type CUsynchronizationPolicy_enum = ::std::os::raw::c_uint;
pub use self::CUsynchronizationPolicy_enum as CUsynchronizationPolicy;
///< the default policy
pub const CU_CLUSTER_SCHEDULING_POLICY_DEFAULT: CUclusterSchedulingPolicy_enum = 0;
///< spread the blocks within a cluster to the SMs
pub const CU_CLUSTER_SCHEDULING_POLICY_SPREAD: CUclusterSchedulingPolicy_enum = 1;
///< allow the hardware to load-balance the blocks in a cluster to the SMs
pub const CU_CLUSTER_SCHEDULING_POLICY_LOAD_BALANCING: CUclusterSchedulingPolicy_enum = 2;
/// Cluster scheduling policies. These may be passed to ::cuFuncSetAttribute or ::cuKernelSetAttribute
pub type CUclusterSchedulingPolicy_enum = ::std::os::raw::c_uint;
/// Cluster scheduling policies. These may be passed to ::cuFuncSetAttribute or ::cuKernelSetAttribute
pub use self::CUclusterSchedulingPolicy_enum as CUclusterSchedulingPolicy;
///< Launch kernels in the default domain
pub const CU_LAUNCH_MEM_SYNC_DOMAIN_DEFAULT: CUlaunchMemSyncDomain_enum = 0;
///< Launch kernels in the remote domain
pub const CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE: CUlaunchMemSyncDomain_enum = 1;
/** Memory Synchronization Domain

 A kernel can be launched in a specified memory synchronization domain that affects all memory operations issued by
 that kernel. A memory barrier issued in one domain will only order memory operations in that domain, thus eliminating
 latency increase from memory barriers ordering unrelated traffic.

 By default, kernels are launched in domain 0. Kernel launched with ::CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE will have a
 different domain ID. User may also alter the domain ID with ::CUlaunchMemSyncDomainMap for a specific stream /
 graph node / kernel launch. See ::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN, ::cuStreamSetAttribute, ::cuLaunchKernelEx,
 ::cuGraphKernelNodeSetAttribute.

 Memory operations done in kernels launched in different domains are considered system-scope distanced. In other
 words, a GPU scoped memory synchronization is not sufficient for memory order to be observed by kernels in another
 memory synchronization domain even if they are on the same GPU.*/
pub type CUlaunchMemSyncDomain_enum = ::std::os::raw::c_uint;
/** Memory Synchronization Domain

 A kernel can be launched in a specified memory synchronization domain that affects all memory operations issued by
 that kernel. A memory barrier issued in one domain will only order memory operations in that domain, thus eliminating
 latency increase from memory barriers ordering unrelated traffic.

 By default, kernels are launched in domain 0. Kernel launched with ::CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE will have a
 different domain ID. User may also alter the domain ID with ::CUlaunchMemSyncDomainMap for a specific stream /
 graph node / kernel launch. See ::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN, ::cuStreamSetAttribute, ::cuLaunchKernelEx,
 ::cuGraphKernelNodeSetAttribute.

 Memory operations done in kernels launched in different domains are considered system-scope distanced. In other
 words, a GPU scoped memory synchronization is not sufficient for memory order to be observed by kernels in another
 memory synchronization domain even if they are on the same GPU.*/
pub use self::CUlaunchMemSyncDomain_enum as CUlaunchMemSyncDomain;
/** Memory Synchronization Domain map

 See ::cudaLaunchMemSyncDomain.

 By default, kernels are launched in domain 0. Kernel launched with ::CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE will have a
 different domain ID. User may also alter the domain ID with ::CUlaunchMemSyncDomainMap for a specific stream /
 graph node / kernel launch. See ::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN_MAP.

 Domain ID range is available through ::CU_DEVICE_ATTRIBUTE_MEM_SYNC_DOMAIN_COUNT.*/
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CUlaunchMemSyncDomainMap_st {
    ///< The default domain ID to use for designated kernels
    pub default_: ::std::os::raw::c_uchar,
    ///< The remote domain ID to use for designated kernels
    pub remote: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUlaunchMemSyncDomainMap_st",
    ][::std::mem::size_of::<CUlaunchMemSyncDomainMap_st>() - 2usize];
    [
        "Alignment of CUlaunchMemSyncDomainMap_st",
    ][::std::mem::align_of::<CUlaunchMemSyncDomainMap_st>() - 1usize];
    [
        "Offset of field: CUlaunchMemSyncDomainMap_st::default_",
    ][::std::mem::offset_of!(CUlaunchMemSyncDomainMap_st, default_) - 0usize];
    [
        "Offset of field: CUlaunchMemSyncDomainMap_st::remote",
    ][::std::mem::offset_of!(CUlaunchMemSyncDomainMap_st, remote) - 1usize];
};
/** Memory Synchronization Domain map

 See ::cudaLaunchMemSyncDomain.

 By default, kernels are launched in domain 0. Kernel launched with ::CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE will have a
 different domain ID. User may also alter the domain ID with ::CUlaunchMemSyncDomainMap for a specific stream /
 graph node / kernel launch. See ::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN_MAP.

 Domain ID range is available through ::CU_DEVICE_ATTRIBUTE_MEM_SYNC_DOMAIN_COUNT.*/
pub type CUlaunchMemSyncDomainMap = CUlaunchMemSyncDomainMap_st;
///< Ignored entry, for convenient composition
pub const CU_LAUNCH_ATTRIBUTE_IGNORE: CUlaunchAttributeID_enum = 0;
/**< Valid for streams, graph nodes, launches. See
::CUlaunchAttributeValue::accessPolicyWindow.*/
pub const CU_LAUNCH_ATTRIBUTE_ACCESS_POLICY_WINDOW: CUlaunchAttributeID_enum = 1;
/**< Valid for graph nodes, launches. See
::CUlaunchAttributeValue::cooperative.*/
pub const CU_LAUNCH_ATTRIBUTE_COOPERATIVE: CUlaunchAttributeID_enum = 2;
/**< Valid for streams. See
::CUlaunchAttributeValue::syncPolicy.*/
pub const CU_LAUNCH_ATTRIBUTE_SYNCHRONIZATION_POLICY: CUlaunchAttributeID_enum = 3;
///< Valid for graph nodes, launches. See ::CUlaunchAttributeValue::clusterDim.
pub const CU_LAUNCH_ATTRIBUTE_CLUSTER_DIMENSION: CUlaunchAttributeID_enum = 4;
///< Valid for graph nodes, launches. See ::CUlaunchAttributeValue::clusterSchedulingPolicyPreference.
pub const CU_LAUNCH_ATTRIBUTE_CLUSTER_SCHEDULING_POLICY_PREFERENCE: CUlaunchAttributeID_enum = 5;
/**< Valid for launches. Setting
::CUlaunchAttributeValue::programmaticStreamSerializationAllowed
to non-0 signals that the kernel will use programmatic
means to resolve its stream dependency, so that the
CUDA runtime should opportunistically allow the grid's
execution to overlap with the previous kernel in the
stream, if that kernel requests the overlap. The
dependent launches can choose to wait on the
dependency using the programmatic sync
(cudaGridDependencySynchronize() or equivalent PTX
instructions).*/
pub const CU_LAUNCH_ATTRIBUTE_PROGRAMMATIC_STREAM_SERIALIZATION: CUlaunchAttributeID_enum = 6;
/**< Valid for launches. Set
::CUlaunchAttributeValue::programmaticEvent to
record the event. Event recorded through this
launch attribute is guaranteed to only trigger
after all block in the associated kernel trigger
the event. A block can trigger the event through
PTX launchdep.release or CUDA builtin function
cudaTriggerProgrammaticLaunchCompletion(). A
trigger can also be inserted at the beginning of
each block's execution if triggerAtBlockStart is
set to non-0. The dependent launches can choose to
wait on the dependency using the programmatic sync
(cudaGridDependencySynchronize() or equivalent PTX
instructions). Note that dependents (including the
CPU thread calling cuEventSynchronize()) are not
guaranteed to observe the release precisely when
it is released.  For example, cuEventSynchronize()
may only observe the event trigger long after the
associated kernel has completed. This recording
type is primarily meant for establishing
programmatic dependency between device tasks. Note
also this type of dependency allows, but does not
guarantee, concurrent execution of tasks.
<br>
The event supplied must not be an interprocess or
interop event. The event must disable timing (i.e.
must be created with the ::CU_EVENT_DISABLE_TIMING
flag set).*/
pub const CU_LAUNCH_ATTRIBUTE_PROGRAMMATIC_EVENT: CUlaunchAttributeID_enum = 7;
/**< Valid for streams, graph nodes, launches. See
::CUlaunchAttributeValue::priority.*/
pub const CU_LAUNCH_ATTRIBUTE_PRIORITY: CUlaunchAttributeID_enum = 8;
/**< Valid for streams, graph nodes, launches. See
::CUlaunchAttributeValue::memSyncDomainMap.*/
pub const CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN_MAP: CUlaunchAttributeID_enum = 9;
/**< Valid for streams, graph nodes, launches. See
::CUlaunchAttributeValue::memSyncDomain.*/
pub const CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN: CUlaunchAttributeID_enum = 10;
/**< Valid for graph nodes, launches. Set
::CUlaunchAttributeValue::preferredClusterDim
to allow the kernel launch to specify a preferred substitute
cluster dimension. Blocks may be grouped according to either
the dimensions specified with this attribute (grouped into a
"preferred substitute cluster"), or the one specified with
::CU_LAUNCH_ATTRIBUTE_CLUSTER_DIMENSION attribute (grouped
into a "regular cluster"). The cluster dimensions of a
"preferred substitute cluster" shall be an integer multiple
greater than zero of the regular cluster dimensions. The
device will attempt - on a best-effort basis - to group
thread blocks into preferred clusters over grouping them
into regular clusters. When it deems necessary (primarily
when the device temporarily runs out of physical resources
to launch the larger preferred clusters), the device may
switch to launch the regular clusters instead to attempt to
utilize as much of the physical device resources as possible.
<br>
Each type of cluster will have its enumeration / coordinate
setup as if the grid consists solely of its type of cluster.
For example, if the preferred substitute cluster dimensions
double the regular cluster dimensions, there might be
simultaneously a regular cluster indexed at (1,0,0), and a
preferred cluster indexed at (1,0,0). In this example, the
preferred substitute cluster (1,0,0) replaces regular
clusters (2,0,0) and (3,0,0) and groups their blocks.
<br>
This attribute will only take effect when a regular cluster
dimension has been specified. The preferred substitute
cluster dimension must be an integer multiple greater than
zero of the regular cluster dimension and must divide the
grid. It must also be no more than `maxBlocksPerCluster`, if
it is set in the kernel's `__launch_bounds__`. Otherwise it
must be less than the maximum value the driver can support.
Otherwise, setting this attribute to a value physically
unable to fit on any particular device is permitted.*/
pub const CU_LAUNCH_ATTRIBUTE_PREFERRED_CLUSTER_DIMENSION: CUlaunchAttributeID_enum = 11;
/**< Valid for launches. Set
::CUlaunchAttributeValue::launchCompletionEvent to record the
event.
<br>
Nominally, the event is triggered once all blocks of the kernel
have begun execution. Currently this is a best effort. If a kernel
B has a launch completion dependency on a kernel A, B may wait
until A is complete. Alternatively, blocks of B may begin before
all blocks of A have begun, for example if B can claim execution
resources unavailable to A (e.g. they run on different GPUs) or
if B is a higher priority than A.
Exercise caution if such an ordering inversion could lead
to deadlock.
<br>
A launch completion event is nominally similar to a programmatic
event with \c triggerAtBlockStart set except that it is not
visible to \c cudaGridDependencySynchronize() and can be used with
compute capability less than 9.0.
<br>
The event supplied must not be an interprocess or interop
event. The event must disable timing (i.e. must be created
with the ::CU_EVENT_DISABLE_TIMING flag set).*/
pub const CU_LAUNCH_ATTRIBUTE_LAUNCH_COMPLETION_EVENT: CUlaunchAttributeID_enum = 12;
/**< Valid for graph nodes, launches. This attribute is graphs-only,
and passing it to a launch in a non-capturing stream will result
in an error.
<br>
::CUlaunchAttributeValue::deviceUpdatableKernelNode::deviceUpdatable can
only be set to 0 or 1. Setting the field to 1 indicates that the
corresponding kernel node should be device-updatable. On success, a handle
will be returned via
::CUlaunchAttributeValue::deviceUpdatableKernelNode::devNode which can be
passed to the various device-side update functions to update the node's
kernel parameters from within another kernel. For more information on the
types of device updates that can be made, as well as the relevant limitations
thereof, see ::cudaGraphKernelNodeUpdatesApply.
<br>
Nodes which are device-updatable have additional restrictions compared to
regular kernel nodes. Firstly, device-updatable nodes cannot be removed
from their graph via ::cuGraphDestroyNode. Additionally, once opted-in
to this functionality, a node cannot opt out, and any attempt to set the
deviceUpdatable attribute to 0 will result in an error. Device-updatable
kernel nodes also cannot have their attributes copied to/from another kernel
node via ::cuGraphKernelNodeCopyAttributes. Graphs containing one or more
device-updatable nodes also do not allow multiple instantiation, and neither
the graph nor its instantiated version can be passed to ::cuGraphExecUpdate.
<br>
If a graph contains device-updatable nodes and updates those nodes from the device
from within the graph, the graph must be uploaded with ::cuGraphUpload before it
is launched. For such a graph, if host-side executable graph updates are made to the
device-updatable nodes, the graph must be uploaded before it is launched again.*/
pub const CU_LAUNCH_ATTRIBUTE_DEVICE_UPDATABLE_KERNEL_NODE: CUlaunchAttributeID_enum = 13;
/**< Valid for launches. On devices where the L1 cache and shared memory use the
same hardware resources, setting ::CUlaunchAttributeValue::sharedMemCarveout to a
percentage between 0-100 signals the CUDA driver to set the shared memory carveout
preference, in percent of the total shared memory for that kernel launch.
This attribute takes precedence over ::CU_FUNC_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT.
This is only a hint, and the CUDA driver can choose a different configuration if
required for the launch.*/
pub const CU_LAUNCH_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT: CUlaunchAttributeID_enum = 14;
/**< Valid for streams, graph nodes, launches. This attribute is a hint to the CUDA runtime that the
launch should attempt to make the kernel maximize its NVLINK utilization.
<br>
When possible to honor this hint, CUDA will assume each block in the grid launch will carry out an even amount
of NVLINK traffic, and make a best-effort attempt to adjust the kernel launch based on that assumption.
<br>
This attribute is a hint only. CUDA makes no functional or performance guarantee. Its applicability can be
affected by many different factors, including driver version (i.e. CUDA doesn't guarantee the performance
characteristics will be maintained between driver versions or a driver update could alter or regress
previously observed perf characteristics.) It also doesn't guarantee a successful result, i.e. applying
the attribute may not improve the performance of either the targeted kernel or the encapsulating application.
<br>
Valid values for ::CUlaunchAttributeValue::nvlinkUtilCentricScheduling are 0 (disabled) and 1 (enabled).*/
pub const CU_LAUNCH_ATTRIBUTE_NVLINK_UTIL_CENTRIC_SCHEDULING: CUlaunchAttributeID_enum = 16;
/// Launch attributes enum; used as id field of ::CUlaunchAttribute
pub type CUlaunchAttributeID_enum = ::std::os::raw::c_uint;
/// Launch attributes enum; used as id field of ::CUlaunchAttribute
pub use self::CUlaunchAttributeID_enum as CUlaunchAttributeID;
/// Launch attributes union; used as value field of ::CUlaunchAttribute
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUlaunchAttributeValue_union {
    pub pad: [::std::os::raw::c_char; 64usize],
    ///< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_ACCESS_POLICY_WINDOW.
    pub accessPolicyWindow: CUaccessPolicyWindow,
    /**< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_COOPERATIVE. Nonzero indicates a cooperative
kernel (see ::cuLaunchCooperativeKernel).*/
    pub cooperative: ::std::os::raw::c_int,
    /**< Value of launch attribute
::CU_LAUNCH_ATTRIBUTE_SYNCHRONIZATION_POLICY. ::CUsynchronizationPolicy for
work queued up in this stream*/
    pub syncPolicy: CUsynchronizationPolicy,
    pub clusterDim: CUlaunchAttributeValue_union__bindgen_ty_1,
    /**< Value of launch attribute
::CU_LAUNCH_ATTRIBUTE_CLUSTER_SCHEDULING_POLICY_PREFERENCE. Cluster
scheduling policy preference for the kernel.*/
    pub clusterSchedulingPolicyPreference: CUclusterSchedulingPolicy,
    /**< Value of launch attribute
::CU_LAUNCH_ATTRIBUTE_PROGRAMMATIC_STREAM_SERIALIZATION.*/
    pub programmaticStreamSerializationAllowed: ::std::os::raw::c_int,
    pub programmaticEvent: CUlaunchAttributeValue_union__bindgen_ty_2,
    pub launchCompletionEvent: CUlaunchAttributeValue_union__bindgen_ty_3,
    ///< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PRIORITY. Execution priority of the kernel.
    pub priority: ::std::os::raw::c_int,
    /**< Value of launch attribute
::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN_MAP. See
::CUlaunchMemSyncDomainMap.*/
    pub memSyncDomainMap: CUlaunchMemSyncDomainMap,
    /**< Value of launch attribute
::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN. See::CUlaunchMemSyncDomain*/
    pub memSyncDomain: CUlaunchMemSyncDomain,
    pub preferredClusterDim: CUlaunchAttributeValue_union__bindgen_ty_4,
    pub deviceUpdatableKernelNode: CUlaunchAttributeValue_union__bindgen_ty_5,
    ///< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT.
    pub sharedMemCarveout: ::std::os::raw::c_uint,
    pub nvlinkUtilCentricScheduling: ::std::os::raw::c_uint,
}
/**  Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_CLUSTER_DIMENSION that
  represents the desired cluster dimensions for the kernel. Opaque type
  with the following fields:
      - \p x - The X dimension of the cluster, in blocks. Must be a divisor
               of the grid X dimension.
      - \p y - The Y dimension of the cluster, in blocks. Must be a divisor
               of the grid Y dimension.
      - \p z - The Z dimension of the cluster, in blocks. Must be a divisor
               of the grid Z dimension.*/
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_1 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub z: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUlaunchAttributeValue_union__bindgen_ty_1",
    ][::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_1>() - 12usize];
    [
        "Alignment of CUlaunchAttributeValue_union__bindgen_ty_1",
    ][::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_1::x",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_1, x) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_1::y",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_1, y) - 4usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_1::z",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_1, z) - 8usize];
};
/**  Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PROGRAMMATIC_EVENT
  with the following fields:
      - \p CUevent event - Event to fire when all blocks trigger it.
      - \p Event record flags, see ::cuEventRecordWithFlags. Does not accept :CU_EVENT_RECORD_EXTERNAL.
      - \p triggerAtBlockStart - If this is set to non-0, each block launch will automatically trigger the event.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_2 {
    pub event: CUevent,
    pub flags: ::std::os::raw::c_int,
    pub triggerAtBlockStart: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUlaunchAttributeValue_union__bindgen_ty_2",
    ][::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_2>() - 16usize];
    [
        "Alignment of CUlaunchAttributeValue_union__bindgen_ty_2",
    ][::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_2>() - 8usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_2::event",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_2, event)
        - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_2::flags",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_2, flags)
        - 8usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_2::triggerAtBlockStart",
    ][::std::mem::offset_of!(
        CUlaunchAttributeValue_union__bindgen_ty_2, triggerAtBlockStart
    ) - 12usize];
};
impl Default for CUlaunchAttributeValue_union__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_LAUNCH_COMPLETION_EVENT
 with the following fields:
     - \p CUevent event - Event to fire when the last block launches
     - \p int flags; - Event record flags, see ::cuEventRecordWithFlags. Does not accept ::CU_EVENT_RECORD_EXTERNAL.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_3 {
    pub event: CUevent,
    pub flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUlaunchAttributeValue_union__bindgen_ty_3",
    ][::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_3>() - 16usize];
    [
        "Alignment of CUlaunchAttributeValue_union__bindgen_ty_3",
    ][::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_3>() - 8usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_3::event",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_3, event)
        - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_3::flags",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_3, flags)
        - 8usize];
};
impl Default for CUlaunchAttributeValue_union__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/**  Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PREFERRED_CLUSTER_DIMENSION
  that represents the desired preferred cluster dimensions for the kernel.
  Opaque type with the following fields:
      - \p x - The X dimension of the preferred cluster, in blocks. Must
               be a divisor of the grid X dimension, and must be a
               multiple of the \p x field of ::CUlaunchAttributeValue::clusterDim.
      - \p y - The Y dimension of the preferred cluster, in blocks. Must
               be a divisor of the grid Y dimension, and must be a
               multiple of the \p y field of ::CUlaunchAttributeValue::clusterDim.
      - \p z - The Z dimension of the preferred cluster, in blocks. Must be
               equal to the \p z field of ::CUlaunchAttributeValue::clusterDim.*/
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_4 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub z: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUlaunchAttributeValue_union__bindgen_ty_4",
    ][::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_4>() - 12usize];
    [
        "Alignment of CUlaunchAttributeValue_union__bindgen_ty_4",
    ][::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_4>() - 4usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_4::x",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_4, x) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_4::y",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_4, y) - 4usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_4::z",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_4, z) - 8usize];
};
/**  Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_DEVICE_UPDATABLE_KERNEL_NODE.
  with the following fields:
      - \p int deviceUpdatable - Whether or not the resulting kernel node should be device-updatable.
      - \p CUgraphDeviceNode devNode - Returns a handle to pass to the various device-side update functions.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_5 {
    pub deviceUpdatable: ::std::os::raw::c_int,
    pub devNode: CUgraphDeviceNode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUlaunchAttributeValue_union__bindgen_ty_5",
    ][::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_5>() - 16usize];
    [
        "Alignment of CUlaunchAttributeValue_union__bindgen_ty_5",
    ][::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_5>() - 8usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_5::deviceUpdatable",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_5, deviceUpdatable)
        - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union__bindgen_ty_5::devNode",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_5, devNode)
        - 8usize];
};
impl Default for CUlaunchAttributeValue_union__bindgen_ty_5 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUlaunchAttributeValue_union",
    ][::std::mem::size_of::<CUlaunchAttributeValue_union>() - 64usize];
    [
        "Alignment of CUlaunchAttributeValue_union",
    ][::std::mem::align_of::<CUlaunchAttributeValue_union>() - 8usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::pad",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, pad) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::accessPolicyWindow",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, accessPolicyWindow) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::cooperative",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, cooperative) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::syncPolicy",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, syncPolicy) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::clusterDim",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, clusterDim) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::clusterSchedulingPolicyPreference",
    ][::std::mem::offset_of!(
        CUlaunchAttributeValue_union, clusterSchedulingPolicyPreference
    ) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::programmaticStreamSerializationAllowed",
    ][::std::mem::offset_of!(
        CUlaunchAttributeValue_union, programmaticStreamSerializationAllowed
    ) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::programmaticEvent",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, programmaticEvent) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::launchCompletionEvent",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, launchCompletionEvent)
        - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::priority",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, priority) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::memSyncDomainMap",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, memSyncDomainMap) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::memSyncDomain",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, memSyncDomain) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::preferredClusterDim",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, preferredClusterDim)
        - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::deviceUpdatableKernelNode",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, deviceUpdatableKernelNode)
        - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::sharedMemCarveout",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, sharedMemCarveout) - 0usize];
    [
        "Offset of field: CUlaunchAttributeValue_union::nvlinkUtilCentricScheduling",
    ][::std::mem::offset_of!(CUlaunchAttributeValue_union, nvlinkUtilCentricScheduling)
        - 0usize];
};
impl Default for CUlaunchAttributeValue_union {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for CUlaunchAttributeValue_union {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "CUlaunchAttributeValue_union {{ union }}")
    }
}
/// Launch attributes union; used as value field of ::CUlaunchAttribute
pub type CUlaunchAttributeValue = CUlaunchAttributeValue_union;
/// Launch attributes enum; used as id field of ::CUlaunchAttribute
pub use self::CUlaunchAttributeID as CUstreamAttrID;
/// Launch attributes union; used as value field of ::CUlaunchAttribute
pub type CUstreamAttrValue_v1 = CUlaunchAttributeValue;
/// Launch attributes union; used as value field of ::CUlaunchAttribute
pub type CUstreamAttrValue = CUstreamAttrValue_v1;
/// No error.
pub const CUPTI_SUCCESS: CUptiResult = 0;
/// One or more of the parameters is invalid.
pub const CUPTI_ERROR_INVALID_PARAMETER: CUptiResult = 1;
/// The device does not correspond to a valid CUDA device.
pub const CUPTI_ERROR_INVALID_DEVICE: CUptiResult = 2;
/// The context is NULL or not valid.
pub const CUPTI_ERROR_INVALID_CONTEXT: CUptiResult = 3;
/// The event domain id is invalid.
pub const CUPTI_ERROR_INVALID_EVENT_DOMAIN_ID: CUptiResult = 4;
/// The event id is invalid.
pub const CUPTI_ERROR_INVALID_EVENT_ID: CUptiResult = 5;
/// The event name is invalid.
pub const CUPTI_ERROR_INVALID_EVENT_NAME: CUptiResult = 6;
/** The current operation cannot be performed due to dependency on
 other factors.*/
pub const CUPTI_ERROR_INVALID_OPERATION: CUptiResult = 7;
/** Unable to allocate enough memory to perform the requested
 operation.*/
pub const CUPTI_ERROR_OUT_OF_MEMORY: CUptiResult = 8;
/// An error occurred on the performance monitoring hardware.
pub const CUPTI_ERROR_HARDWARE: CUptiResult = 9;
/** The output buffer size is not sufficient to return all
 requested data.*/
pub const CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT: CUptiResult = 10;
/// API is not implemented.
pub const CUPTI_ERROR_API_NOT_IMPLEMENTED: CUptiResult = 11;
/// The maximum limit is reached.
pub const CUPTI_ERROR_MAX_LIMIT_REACHED: CUptiResult = 12;
/// The object is not yet ready to perform the requested operation.
pub const CUPTI_ERROR_NOT_READY: CUptiResult = 13;
/** The current operation is not compatible with the current state
 of the object*/
pub const CUPTI_ERROR_NOT_COMPATIBLE: CUptiResult = 14;
/** CUPTI is unable to initialize its connection to the CUDA
 driver.*/
pub const CUPTI_ERROR_NOT_INITIALIZED: CUptiResult = 15;
/// The metric id is invalid.
pub const CUPTI_ERROR_INVALID_METRIC_ID: CUptiResult = 16;
/// The metric name is invalid.
pub const CUPTI_ERROR_INVALID_METRIC_NAME: CUptiResult = 17;
/// The queue is empty.
pub const CUPTI_ERROR_QUEUE_EMPTY: CUptiResult = 18;
/// Invalid handle (internal?).
pub const CUPTI_ERROR_INVALID_HANDLE: CUptiResult = 19;
/// Invalid stream.
pub const CUPTI_ERROR_INVALID_STREAM: CUptiResult = 20;
/// Invalid kind.
pub const CUPTI_ERROR_INVALID_KIND: CUptiResult = 21;
/// Invalid event value.
pub const CUPTI_ERROR_INVALID_EVENT_VALUE: CUptiResult = 22;
/// CUPTI is disabled due to conflicts with other enabled profilers
pub const CUPTI_ERROR_DISABLED: CUptiResult = 23;
/// Invalid module.
pub const CUPTI_ERROR_INVALID_MODULE: CUptiResult = 24;
/// Invalid metric value.
pub const CUPTI_ERROR_INVALID_METRIC_VALUE: CUptiResult = 25;
/// The performance monitoring hardware is in use by other client.
pub const CUPTI_ERROR_HARDWARE_BUSY: CUptiResult = 26;
/** The attempted operation is not supported on the current
 system or device.*/
pub const CUPTI_ERROR_NOT_SUPPORTED: CUptiResult = 27;
/** Unified memory profiling is not supported on the system.
 Potential reason could be unsupported OS or architecture.*/
pub const CUPTI_ERROR_UM_PROFILING_NOT_SUPPORTED: CUptiResult = 28;
/// Unified memory profiling is not supported on the device
pub const CUPTI_ERROR_UM_PROFILING_NOT_SUPPORTED_ON_DEVICE: CUptiResult = 29;
/** Unified memory profiling is not supported on a multi-GPU
 configuration without P2P support between any pair of devices*/
pub const CUPTI_ERROR_UM_PROFILING_NOT_SUPPORTED_ON_NON_P2P_DEVICES: CUptiResult = 30;
/** Unified memory profiling is not supported under the
 Multi-Process Service (MPS) environment. CUDA 7.5 removes this
 restriction.*/
pub const CUPTI_ERROR_UM_PROFILING_NOT_SUPPORTED_WITH_MPS: CUptiResult = 31;
/** In CUDA 9.0, devices with compute capability 7.0 don't
 support CDP tracing*/
pub const CUPTI_ERROR_CDP_TRACING_NOT_SUPPORTED: CUptiResult = 32;
/// Profiling on virtualized GPU is not supported.
pub const CUPTI_ERROR_VIRTUALIZED_DEVICE_NOT_SUPPORTED: CUptiResult = 33;
/** Profiling results might be incorrect for CUDA applications
 compiled with nvcc version older than 9.0 for devices with
 compute capability 6.0 and 6.1.
 Profiling session will continue and CUPTI will notify it using this error code.
 User is advised to recompile the application code with nvcc version 9.0 or later.
 Ignore this warning if code is already compiled with the recommended nvcc version.*/
pub const CUPTI_ERROR_CUDA_COMPILER_NOT_COMPATIBLE: CUptiResult = 34;
/** User doesn't have sufficient privileges which are required to
 start the profiling session.
 One possible reason for this may be that the NVIDIA driver or your system
 administrator may have restricted access to the NVIDIA GPU performance counters.
 To learn how to resolve this issue and find more information, please visit
 https://developer.nvidia.com/CUPTI_ERROR_INSUFFICIENT_PRIVILEGES*/
pub const CUPTI_ERROR_INSUFFICIENT_PRIVILEGES: CUptiResult = 35;
/** Legacy CUPTI Profiling API i.e. event API from the header cupti_events.h and
 metric API from the header cupti_metrics.h are not compatible with the
 Profiling API in the header cupti_profiler_target.h and Perfworks metrics API
 in the headers nvperf_host.h and nvperf_target.h.*/
pub const CUPTI_ERROR_OLD_PROFILER_API_INITIALIZED: CUptiResult = 36;
/** Missing definition of the OpenACC API routine in the linked OpenACC library.

 One possible reason is that OpenACC library is linked statically in the
 user application, which might not have the definition of all the OpenACC
 API routines needed for the OpenACC profiling, as compiler might ignore
 definitions for the functions not used in the application. This issue
 can be mitigated by linking the OpenACC library dynamically.*/
pub const CUPTI_ERROR_OPENACC_UNDEFINED_ROUTINE: CUptiResult = 37;
/** Legacy CUPTI Profiling API i.e. event API from the header cupti_events.h and
 metric API from the header cupti_metrics.h are not supported on devices with
 compute capability 7.5 and higher (i.e. Turing and later GPU architectures).
 These APIs were deprecated in CUDA 12.8 and removed in CUDA 13.0.
 These are replaced by the host profiling API in the header cupti_profiler_host.h and
 target profiling API in the header cupti_range_profiler.h which are supported on
 devices with compute capability 7.5 and higher (i.e. Turing and later GPU
 architectures).
 Further, the PC Sampling Activity API and the source/SASS level metrics from the header
 cupti_activity.h are removed in CUDA 13.0.*/
pub const CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED: CUptiResult = 38;
/** CUPTI doesn't allow multiple callback subscribers. Only a single subscriber
 can be registered at a time.
 Same error code is used when application is launched using NVIDIA tools
 like Nsight Systems, Nsight Compute, and cuda-gdb.*/
pub const CUPTI_ERROR_MULTIPLE_SUBSCRIBERS_NOT_SUPPORTED: CUptiResult = 39;
/// Profiling on virtualized GPU is not allowed by hypervisor.
pub const CUPTI_ERROR_VIRTUALIZED_DEVICE_INSUFFICIENT_PRIVILEGES: CUptiResult = 40;
/** Profiling and tracing are not allowed when confidential computing mode
 is enabled.*/
pub const CUPTI_ERROR_CONFIDENTIAL_COMPUTING_NOT_SUPPORTED: CUptiResult = 41;
/** CUPTI does not support NVIDIA Crypto Mining Processors (CMP).
 For more information, please visit https://developer.nvidia.com/ERR_NVCMPGPU*/
pub const CUPTI_ERROR_CMP_DEVICE_NOT_SUPPORTED: CUptiResult = 42;
/// Profiling on Multi-instance GPU (MIG) is not supported.
pub const CUPTI_ERROR_MIG_DEVICE_NOT_SUPPORTED: CUptiResult = 43;
/// Profiling on SLI device is not supported.
pub const CUPTI_ERROR_SLI_DEVICE_NOT_SUPPORTED: CUptiResult = 44;
/// Profiling on WSL device is not supported.
pub const CUPTI_ERROR_WSL_DEVICE_NOT_SUPPORTED: CUptiResult = 45;
/// For invalid or unsupported chip name passed to cuptiProfilerHostInitialize.
pub const CUPTI_ERROR_INVALID_CHIP_NAME: CUptiResult = 46;
/// An unknown internal error has occurred.
pub const CUPTI_ERROR_UNKNOWN: CUptiResult = 999;
/// An unknown internal error has occurred.
pub const CUPTI_ERROR_FORCE_INT: CUptiResult = 2147483647;
/** \brief CUPTI result codes.

 Error and result codes returned by CUPTI functions.*/
pub type CUptiResult = ::std::os::raw::c_uint;
unsafe extern "C" {
    /** \brief Get the descriptive string for a CUptiResult.

 Return the descriptive string for a CUptiResult in \p *str.
 \note \b Thread-safety: this function is thread safe.

 \param result The result to get the string for
 \param str Returns the string

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p str is NULL or \p
 result is not a valid CUptiResult*/
    pub fn cuptiGetResultString(
        result: CUptiResult,
        str_: *mut *const ::std::os::raw::c_char,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** @brief Get the descriptive message corresponding to error codes returned
 by CUPTI.

 Return the descriptive error message for a CUptiResult in \p *str.
 \note \b Thread-safety: this function is thread safe.

 \param result The result to get the descriptive error message for
 \param str Returns the error message string

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p str is NULL or \p
 result is not a valid CUptiResult
*/
    pub fn cuptiGetErrorMessage(
        result: CUptiResult,
        str_: *mut *const ::std::os::raw::c_char,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the CUPTI API version.

 Return the API version in \p *version.

 \param version Returns the version

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p version is NULL
 \sa CUPTI_API_VERSION*/
    pub fn cuptiGetVersion(version: *mut u32) -> CUptiResult;
}
/// The callback is at the entry of the API call.
pub const CUPTI_API_ENTER: CUpti_ApiCallbackSite = 0;
/// The callback is at the exit of the API call.
pub const CUPTI_API_EXIT: CUpti_ApiCallbackSite = 1;
/// The callback is at the exit of the API call.
pub const CUPTI_API_CBSITE_FORCE_INT: CUpti_ApiCallbackSite = 2147483647;
/** \brief Specifies the point in an API call that a callback is issued.

 Specifies the point in an API call that a callback is issued. This
 value is communicated to the callback function via \ref
 CUpti_CallbackData::callbackSite.*/
pub type CUpti_ApiCallbackSite = ::std::os::raw::c_uint;
/// Invalid domain.
pub const CUPTI_CB_DOMAIN_INVALID: CUpti_CallbackDomain = 0;
/// Domain containing callback points for all driver API functions.
pub const CUPTI_CB_DOMAIN_DRIVER_API: CUpti_CallbackDomain = 1;
/** Domain containing callback points for all runtime API
 functions.*/
pub const CUPTI_CB_DOMAIN_RUNTIME_API: CUpti_CallbackDomain = 2;
/// Domain containing callback points for CUDA resource tracking.
pub const CUPTI_CB_DOMAIN_RESOURCE: CUpti_CallbackDomain = 3;
/// Domain containing callback points for CUDA synchronization.
pub const CUPTI_CB_DOMAIN_SYNCHRONIZE: CUpti_CallbackDomain = 4;
/// Domain containing callback points for NVTX API functions.
pub const CUPTI_CB_DOMAIN_NVTX: CUpti_CallbackDomain = 5;
/// Domain containing callback points for various states.
pub const CUPTI_CB_DOMAIN_STATE: CUpti_CallbackDomain = 6;
/// Domain containing callback points for various states.
pub const CUPTI_CB_DOMAIN_SIZE: CUpti_CallbackDomain = 7;
/// Domain containing callback points for various states.
pub const CUPTI_CB_DOMAIN_FORCE_INT: CUpti_CallbackDomain = 2147483647;
/** \brief Callback domains.

 Callback domains. Each domain represents callback points for a
 group of related API functions or CUDA driver activity.*/
pub type CUpti_CallbackDomain = ::std::os::raw::c_uint;
/// Invalid resource callback ID.
pub const CUPTI_CBID_RESOURCE_INVALID: CUpti_CallbackIdResource = 0;
/// A new context has been created.
pub const CUPTI_CBID_RESOURCE_CONTEXT_CREATED: CUpti_CallbackIdResource = 1;
/// A context is about to be destroyed.
pub const CUPTI_CBID_RESOURCE_CONTEXT_DESTROY_STARTING: CUpti_CallbackIdResource = 2;
/// A new stream has been created.
pub const CUPTI_CBID_RESOURCE_STREAM_CREATED: CUpti_CallbackIdResource = 3;
/// A stream is about to be destroyed.
pub const CUPTI_CBID_RESOURCE_STREAM_DESTROY_STARTING: CUpti_CallbackIdResource = 4;
/// The driver has finished initializing.
pub const CUPTI_CBID_RESOURCE_CU_INIT_FINISHED: CUpti_CallbackIdResource = 5;
/// A module has been loaded.
pub const CUPTI_CBID_RESOURCE_MODULE_LOADED: CUpti_CallbackIdResource = 6;
/// A module is about to be unloaded.
pub const CUPTI_CBID_RESOURCE_MODULE_UNLOAD_STARTING: CUpti_CallbackIdResource = 7;
/// The current module which is being profiled.
pub const CUPTI_CBID_RESOURCE_MODULE_PROFILED: CUpti_CallbackIdResource = 8;
/// CUDA graph has been created.
pub const CUPTI_CBID_RESOURCE_GRAPH_CREATED: CUpti_CallbackIdResource = 9;
/// CUDA graph is about to be destroyed.
pub const CUPTI_CBID_RESOURCE_GRAPH_DESTROY_STARTING: CUpti_CallbackIdResource = 10;
/// CUDA graph is cloned.
pub const CUPTI_CBID_RESOURCE_GRAPH_CLONED: CUpti_CallbackIdResource = 11;
/// CUDA graph node is about to be created
pub const CUPTI_CBID_RESOURCE_GRAPHNODE_CREATE_STARTING: CUpti_CallbackIdResource = 12;
/// CUDA graph node is created.
pub const CUPTI_CBID_RESOURCE_GRAPHNODE_CREATED: CUpti_CallbackIdResource = 13;
/// CUDA graph node is about to be destroyed.
pub const CUPTI_CBID_RESOURCE_GRAPHNODE_DESTROY_STARTING: CUpti_CallbackIdResource = 14;
/// Dependency on a CUDA graph node is created.
pub const CUPTI_CBID_RESOURCE_GRAPHNODE_DEPENDENCY_CREATED: CUpti_CallbackIdResource = 15;
/// Dependency on a CUDA graph node is destroyed.
pub const CUPTI_CBID_RESOURCE_GRAPHNODE_DEPENDENCY_DESTROY_STARTING: CUpti_CallbackIdResource = 16;
/// An executable CUDA graph is about to be created.
pub const CUPTI_CBID_RESOURCE_GRAPHEXEC_CREATE_STARTING: CUpti_CallbackIdResource = 17;
/// An executable CUDA graph is created.
pub const CUPTI_CBID_RESOURCE_GRAPHEXEC_CREATED: CUpti_CallbackIdResource = 18;
/// An executable CUDA graph is about to be destroyed.
pub const CUPTI_CBID_RESOURCE_GRAPHEXEC_DESTROY_STARTING: CUpti_CallbackIdResource = 19;
/// CUDA graph node is cloned.
pub const CUPTI_CBID_RESOURCE_GRAPHNODE_CLONED: CUpti_CallbackIdResource = 20;
/// CUDA stream attribute is changed.
pub const CUPTI_CBID_RESOURCE_STREAM_ATTRIBUTE_CHANGED: CUpti_CallbackIdResource = 21;
/// CUDA graph node is updated.
pub const CUPTI_CBID_RESOURCE_GRAPH_NODE_UPDATED: CUpti_CallbackIdResource = 22;
/// Params are set for the CUDA graph node in the executable graph.
pub const CUPTI_CBID_RESOURCE_GRAPH_NODE_SET_PARAMS: CUpti_CallbackIdResource = 23;
/// Params are set for the CUDA graph node in the executable graph.
pub const CUPTI_CBID_RESOURCE_SIZE: CUpti_CallbackIdResource = 24;
/// Params are set for the CUDA graph node in the executable graph.
pub const CUPTI_CBID_RESOURCE_FORCE_INT: CUpti_CallbackIdResource = 2147483647;
/** \brief Callback IDs for resource domain.

 Callback IDs for resource domain, CUPTI_CB_DOMAIN_RESOURCE.  This
 value is communicated to the callback function via the \p cbid
 parameter.*/
pub type CUpti_CallbackIdResource = ::std::os::raw::c_uint;
/// Invalid synchronize callback ID.
pub const CUPTI_CBID_SYNCHRONIZE_INVALID: CUpti_CallbackIdSync = 0;
/// Stream synchronization has completed for the stream.
pub const CUPTI_CBID_SYNCHRONIZE_STREAM_SYNCHRONIZED: CUpti_CallbackIdSync = 1;
/// Context synchronization has completed for the context.
pub const CUPTI_CBID_SYNCHRONIZE_CONTEXT_SYNCHRONIZED: CUpti_CallbackIdSync = 2;
/// Context synchronization has completed for the context.
pub const CUPTI_CBID_SYNCHRONIZE_SIZE: CUpti_CallbackIdSync = 3;
/// Context synchronization has completed for the context.
pub const CUPTI_CBID_SYNCHRONIZE_FORCE_INT: CUpti_CallbackIdSync = 2147483647;
/** \brief Callback IDs for synchronization domain.

 Callback IDs for synchronization domain,
 CUPTI_CB_DOMAIN_SYNCHRONIZE.  This value is communicated to the
 callback function via the \p cbid parameter.*/
pub type CUpti_CallbackIdSync = ::std::os::raw::c_uint;
/// Invalid state callback ID.
pub const CUPTI_CBID_STATE_INVALID: CUpti_CallbackIdState = 0;
/** Notification of fatal errors - high impact, non-recoverable
 When encountered, CUPTI automatically invokes cuptiFinalize()
 User can control behavior of the application in future from
 receiving this callback - such as continuing without profiling, or
 terminating the whole application.*/
pub const CUPTI_CBID_STATE_FATAL_ERROR: CUpti_CallbackIdState = 1;
/** Notification of non fatal errors - high impact, but recoverable
 This notification is not issued in the current release.*/
pub const CUPTI_CBID_STATE_ERROR: CUpti_CallbackIdState = 2;
/// Notification of warnings - low impact, recoverable.
pub const CUPTI_CBID_STATE_WARNING: CUpti_CallbackIdState = 3;
/// Notification of warnings - low impact, recoverable.
pub const CUPTI_CBID_STATE_SIZE: CUpti_CallbackIdState = 4;
/// Notification of warnings - low impact, recoverable.
pub const CUPTI_CBID_STATE_FORCE_INT: CUpti_CallbackIdState = 2147483647;
/** \brief Callback IDs for state domain.

 Callback IDs for state domain,
 CUPTI_CB_DOMAIN_STATE. This value is communicated to the
 callback function via the \p cbid parameter.*/
pub type CUpti_CallbackIdState = ::std::os::raw::c_uint;
/** \brief Data passed into a runtime or driver API callback function.

 Data passed into a runtime or driver API callback function as the
 \p cbdata argument to \ref CUpti_CallbackFunc. The \p cbdata will
 be this type for \p domain equal to CUPTI_CB_DOMAIN_DRIVER_API or
 CUPTI_CB_DOMAIN_RUNTIME_API. The callback data is valid only within
 the invocation of the callback function that is passed the data. If
 you need to retain some data for use outside of the callback, you
 must make a copy of that data. For example, if you make a shallow
 copy of CUpti_CallbackData within a callback, you cannot
 dereference \p functionParams outside of that callback to access
 the function parameters. \p functionName is an exception: the
 string pointed to by \p functionName is a global constant and so
 may be accessed outside of the callback.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_CallbackData {
    /** Point in the runtime or driver function from where the callback
 was issued.*/
    pub callbackSite: CUpti_ApiCallbackSite,
    /** Name of the runtime or driver API function which issued the
 callback. This string is a global constant and so may be
 accessed outside of the callback.*/
    pub functionName: *const ::std::os::raw::c_char,
    /** Pointer to the arguments passed to the runtime or driver API
 call. See generated_cuda_runtime_api_meta.h and
 generated_cuda_meta.h for structure definitions for the
 parameters for each runtime and driver API function.*/
    pub functionParams: *const ::std::os::raw::c_void,
    /** Pointer to the return value of the runtime or driver API
 call. This field is only valid within the exit::CUPTI_API_EXIT
 callback. For a runtime API \p functionReturnValue points to a
 \p cudaError_t. For a driver API \p functionReturnValue points
 to a \p CUresult.*/
    pub functionReturnValue: *mut ::std::os::raw::c_void,
    /** Name of the symbol operated on by the runtime or driver API
 function which issued the callback. This entry is valid only for
 driver and runtime launch callbacks, where it returns the name of
 the kernel.*/
    pub symbolName: *const ::std::os::raw::c_char,
    /** Driver context current to the thread, or null if no context is
 current. This value can change from the entry to exit callback
 of a runtime API function if the runtime initializes a context.*/
    pub context: CUcontext,
    /** Unique ID for the CUDA context associated with the thread. The
 UIDs are assigned sequentially as contexts are created and are
 unique within a process.*/
    pub contextUid: u32,
    /** Pointer to data shared between the entry and exit callbacks of
 a given runtime or drive API function invocation. This field
 can be used to pass 64-bit values from the entry callback to
 the corresponding exit callback.*/
    pub correlationData: *mut u64,
    /** The activity record correlation ID for this callback. For a
 driver domain callback (i.e. \p domain
 CUPTI_CB_DOMAIN_DRIVER_API) this ID will equal the correlation ID
 in the CUpti_ActivityAPI record corresponding to the CUDA driver
 function call. For a runtime domain callback (i.e. \p domain
 CUPTI_CB_DOMAIN_RUNTIME_API) this ID will equal the correlation
 ID in the CUpti_ActivityAPI record corresponding to the CUDA
 runtime function call. Within the callback, this ID can be
 recorded to correlate user data with the activity record. This
 field is new in 4.1.*/
    pub correlationId: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_CallbackData",
    ][::std::mem::size_of::<CUpti_CallbackData>() - 72usize];
    [
        "Alignment of CUpti_CallbackData",
    ][::std::mem::align_of::<CUpti_CallbackData>() - 8usize];
    [
        "Offset of field: CUpti_CallbackData::callbackSite",
    ][::std::mem::offset_of!(CUpti_CallbackData, callbackSite) - 0usize];
    [
        "Offset of field: CUpti_CallbackData::functionName",
    ][::std::mem::offset_of!(CUpti_CallbackData, functionName) - 8usize];
    [
        "Offset of field: CUpti_CallbackData::functionParams",
    ][::std::mem::offset_of!(CUpti_CallbackData, functionParams) - 16usize];
    [
        "Offset of field: CUpti_CallbackData::functionReturnValue",
    ][::std::mem::offset_of!(CUpti_CallbackData, functionReturnValue) - 24usize];
    [
        "Offset of field: CUpti_CallbackData::symbolName",
    ][::std::mem::offset_of!(CUpti_CallbackData, symbolName) - 32usize];
    [
        "Offset of field: CUpti_CallbackData::context",
    ][::std::mem::offset_of!(CUpti_CallbackData, context) - 40usize];
    [
        "Offset of field: CUpti_CallbackData::contextUid",
    ][::std::mem::offset_of!(CUpti_CallbackData, contextUid) - 48usize];
    [
        "Offset of field: CUpti_CallbackData::correlationData",
    ][::std::mem::offset_of!(CUpti_CallbackData, correlationData) - 56usize];
    [
        "Offset of field: CUpti_CallbackData::correlationId",
    ][::std::mem::offset_of!(CUpti_CallbackData, correlationId) - 64usize];
};
impl Default for CUpti_CallbackData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief Data passed into a resource callback function.

 Data passed into a resource callback function as the \p cbdata
 argument to \ref CUpti_CallbackFunc. The \p cbdata will be this
 type for \p domain equal to CUPTI_CB_DOMAIN_RESOURCE. The callback
 data is valid only within the invocation of the callback function
 that is passed the data. If you need to retain some data for use
 outside of the callback, you must make a copy of that data.*/
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUpti_ResourceData {
    /** For CUPTI_CBID_RESOURCE_CONTEXT_CREATED and
 CUPTI_CBID_RESOURCE_CONTEXT_DESTROY_STARTING, the context being
 created or destroyed. For CUPTI_CBID_RESOURCE_STREAM_CREATED and
 CUPTI_CBID_RESOURCE_STREAM_DESTROY_STARTING, the context
 containing the stream being created or destroyed.*/
    pub context: CUcontext,
    pub resourceHandle: CUpti_ResourceData__bindgen_ty_1,
    /// Reserved for future use.
    pub resourceDescriptor: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUpti_ResourceData__bindgen_ty_1 {
    /** For CUPTI_CBID_RESOURCE_STREAM_CREATED and
 CUPTI_CBID_RESOURCE_STREAM_DESTROY_STARTING, the stream being
 created or destroyed.*/
    pub stream: CUstream,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ResourceData__bindgen_ty_1",
    ][::std::mem::size_of::<CUpti_ResourceData__bindgen_ty_1>() - 8usize];
    [
        "Alignment of CUpti_ResourceData__bindgen_ty_1",
    ][::std::mem::align_of::<CUpti_ResourceData__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: CUpti_ResourceData__bindgen_ty_1::stream",
    ][::std::mem::offset_of!(CUpti_ResourceData__bindgen_ty_1, stream) - 0usize];
};
impl Default for CUpti_ResourceData__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for CUpti_ResourceData__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "CUpti_ResourceData__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ResourceData",
    ][::std::mem::size_of::<CUpti_ResourceData>() - 24usize];
    [
        "Alignment of CUpti_ResourceData",
    ][::std::mem::align_of::<CUpti_ResourceData>() - 8usize];
    [
        "Offset of field: CUpti_ResourceData::context",
    ][::std::mem::offset_of!(CUpti_ResourceData, context) - 0usize];
    [
        "Offset of field: CUpti_ResourceData::resourceHandle",
    ][::std::mem::offset_of!(CUpti_ResourceData, resourceHandle) - 8usize];
    [
        "Offset of field: CUpti_ResourceData::resourceDescriptor",
    ][::std::mem::offset_of!(CUpti_ResourceData, resourceDescriptor) - 16usize];
};
impl Default for CUpti_ResourceData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for CUpti_ResourceData {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "CUpti_ResourceData {{ context: {:?}, resourceHandle: {:?}, resourceDescriptor: {:?} }}",
            self.context,
            self.resourceHandle,
            self.resourceDescriptor,
        )
    }
}
/** \brief Module data passed into a resource callback function.

 CUDA module data passed into a resource callback function as the \p cbdata
 argument to \ref CUpti_CallbackFunc. The \p cbdata will be this
 type for \p domain equal to CUPTI_CB_DOMAIN_RESOURCE. The module
 data is valid only within the invocation of the callback function
 that is passed the data. If you need to retain some data for use
 outside of the callback, you must make a copy of that data.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_ModuleResourceData {
    /// Identifier to associate with the CUDA module.
    pub moduleId: u32,
    /// The size of the cubin.
    pub cubinSize: usize,
    /// Pointer to the associated cubin.
    pub pCubin: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ModuleResourceData",
    ][::std::mem::size_of::<CUpti_ModuleResourceData>() - 24usize];
    [
        "Alignment of CUpti_ModuleResourceData",
    ][::std::mem::align_of::<CUpti_ModuleResourceData>() - 8usize];
    [
        "Offset of field: CUpti_ModuleResourceData::moduleId",
    ][::std::mem::offset_of!(CUpti_ModuleResourceData, moduleId) - 0usize];
    [
        "Offset of field: CUpti_ModuleResourceData::cubinSize",
    ][::std::mem::offset_of!(CUpti_ModuleResourceData, cubinSize) - 8usize];
    [
        "Offset of field: CUpti_ModuleResourceData::pCubin",
    ][::std::mem::offset_of!(CUpti_ModuleResourceData, pCubin) - 16usize];
};
impl Default for CUpti_ModuleResourceData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief CUDA graphs data passed into a resource callback function.

 CUDA graphs data passed into a resource callback function as the \p cbdata
 argument to \ref CUpti_CallbackFunc. The \p cbdata will be this
 type for \p domain equal to CUPTI_CB_DOMAIN_RESOURCE. The graph
 data is valid only within the invocation of the callback function
 that is passed the data. If you need to retain some data for use
 outside of the callback, you must make a copy of that data.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_GraphData {
    /// CUDA graph
    pub graph: CUgraph,
    /// The original CUDA graph from which \param graph is cloned
    pub originalGraph: CUgraph,
    /// CUDA graph node
    pub node: CUgraphNode,
    /// The original CUDA graph node from which \param node is cloned
    pub originalNode: CUgraphNode,
    /// Type of the \param node
    pub nodeType: CUgraphNodeType,
    /// The dependent graph node
    pub dependency: CUgraphNode,
    /// CUDA executable graph
    pub graphExec: CUgraphExec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUpti_GraphData"][::std::mem::size_of::<CUpti_GraphData>() - 56usize];
    ["Alignment of CUpti_GraphData"][::std::mem::align_of::<CUpti_GraphData>() - 8usize];
    [
        "Offset of field: CUpti_GraphData::graph",
    ][::std::mem::offset_of!(CUpti_GraphData, graph) - 0usize];
    [
        "Offset of field: CUpti_GraphData::originalGraph",
    ][::std::mem::offset_of!(CUpti_GraphData, originalGraph) - 8usize];
    [
        "Offset of field: CUpti_GraphData::node",
    ][::std::mem::offset_of!(CUpti_GraphData, node) - 16usize];
    [
        "Offset of field: CUpti_GraphData::originalNode",
    ][::std::mem::offset_of!(CUpti_GraphData, originalNode) - 24usize];
    [
        "Offset of field: CUpti_GraphData::nodeType",
    ][::std::mem::offset_of!(CUpti_GraphData, nodeType) - 32usize];
    [
        "Offset of field: CUpti_GraphData::dependency",
    ][::std::mem::offset_of!(CUpti_GraphData, dependency) - 40usize];
    [
        "Offset of field: CUpti_GraphData::graphExec",
    ][::std::mem::offset_of!(CUpti_GraphData, graphExec) - 48usize];
};
impl Default for CUpti_GraphData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief Data passed into a synchronize callback function.

 Data passed into a synchronize callback function as the \p cbdata
 argument to \ref CUpti_CallbackFunc. The \p cbdata will be this
 type for \p domain equal to CUPTI_CB_DOMAIN_SYNCHRONIZE. The
 callback data is valid only within the invocation of the callback
 function that is passed the data. If you need to retain some data
 for use outside of the callback, you must make a copy of that data.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_SynchronizeData {
    /// The context of the stream being synchronized.
    pub context: CUcontext,
    /// The stream being synchronized.
    pub stream: CUstream,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_SynchronizeData",
    ][::std::mem::size_of::<CUpti_SynchronizeData>() - 16usize];
    [
        "Alignment of CUpti_SynchronizeData",
    ][::std::mem::align_of::<CUpti_SynchronizeData>() - 8usize];
    [
        "Offset of field: CUpti_SynchronizeData::context",
    ][::std::mem::offset_of!(CUpti_SynchronizeData, context) - 0usize];
    [
        "Offset of field: CUpti_SynchronizeData::stream",
    ][::std::mem::offset_of!(CUpti_SynchronizeData, stream) - 8usize];
};
impl Default for CUpti_SynchronizeData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief Data passed into a NVTX callback function.

 Data passed into a NVTX callback function as the \p cbdata argument
 to \ref CUpti_CallbackFunc. The \p cbdata will be this type for \p
 domain equal to CUPTI_CB_DOMAIN_NVTX. Unless otherwise notes, the
 callback data is valid only within the invocation of the callback
 function that is passed the data. If you need to retain some data
 for use outside of the callback, you must make a copy of that data.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_NvtxData {
    /** Name of the NVTX API function which issued the callback. This
 string is a global constant and so may be accessed outside of the
 callback.*/
    pub functionName: *const ::std::os::raw::c_char,
    /** Pointer to the arguments passed to the NVTX API call. See
 generated_nvtx_meta.h for structure definitions for the
 parameters for each NVTX API function.*/
    pub functionParams: *const ::std::os::raw::c_void,
    /** Pointer to the return value of the NVTX API call. See
 nvToolsExt.h for each NVTX API function's return value.*/
    pub functionReturnValue: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUpti_NvtxData"][::std::mem::size_of::<CUpti_NvtxData>() - 24usize];
    ["Alignment of CUpti_NvtxData"][::std::mem::align_of::<CUpti_NvtxData>() - 8usize];
    [
        "Offset of field: CUpti_NvtxData::functionName",
    ][::std::mem::offset_of!(CUpti_NvtxData, functionName) - 0usize];
    [
        "Offset of field: CUpti_NvtxData::functionParams",
    ][::std::mem::offset_of!(CUpti_NvtxData, functionParams) - 8usize];
    [
        "Offset of field: CUpti_NvtxData::functionReturnValue",
    ][::std::mem::offset_of!(CUpti_NvtxData, functionReturnValue) - 16usize];
};
impl Default for CUpti_NvtxData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief Stream attribute data passed into a resource callback function
 for CUPTI_CBID_RESOURCE_STREAM_ATTRIBUTE_CHANGED callback

 Data passed into a resource callback function as the \p cbdata
 argument to \ref CUpti_CallbackFunc. The \p cbdata will be this
 type for \p domain equal to CUPTI_CB_DOMAIN_RESOURCE. The
 stream attribute data is valid only within the invocation of the callback
 function that is passed the data. If you need to retain some data
 for use outside of the callback, you must make a copy of that data.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_StreamAttrData {
    /// The CUDA stream handle for the attribute
    pub stream: CUstream,
    /// The type of the CUDA stream attribute
    pub attr: CUstreamAttrID,
    /// The value of the CUDA stream attribute
    pub value: *const CUstreamAttrValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_StreamAttrData",
    ][::std::mem::size_of::<CUpti_StreamAttrData>() - 24usize];
    [
        "Alignment of CUpti_StreamAttrData",
    ][::std::mem::align_of::<CUpti_StreamAttrData>() - 8usize];
    [
        "Offset of field: CUpti_StreamAttrData::stream",
    ][::std::mem::offset_of!(CUpti_StreamAttrData, stream) - 0usize];
    [
        "Offset of field: CUpti_StreamAttrData::attr",
    ][::std::mem::offset_of!(CUpti_StreamAttrData, attr) - 8usize];
    [
        "Offset of field: CUpti_StreamAttrData::value",
    ][::std::mem::offset_of!(CUpti_StreamAttrData, value) - 16usize];
};
impl Default for CUpti_StreamAttrData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief Data passed into a State callback function.

 Data passed into a State callback function as the \p cbdata argument
 to \ref CUpti_CallbackFunc. The \p cbdata will be this type for \p
 domain equal to CUPTI_CB_DOMAIN_STATE and callback Ids belonging to CUpti_CallbackIdState.
 Unless otherwise noted, the callback data is valid only within the invocation of the callback
 function that is passed the data. If you need to retain some data
 for use outside of the callback, you must make a copy of that data.*/
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUpti_StateData {
    pub __bindgen_anon_1: CUpti_StateData__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUpti_StateData__bindgen_ty_1 {
    pub notification: CUpti_StateData__bindgen_ty_1__bindgen_ty_1,
}
/** Data passed along with the callback Ids
 Enum CUpti_CallbackIdState used to denote callback ids*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_StateData__bindgen_ty_1__bindgen_ty_1 {
    /// Error code
    pub result: CUptiResult,
    /// String containing more details. It can be NULL.
    pub message: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_StateData__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::size_of::<CUpti_StateData__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    [
        "Alignment of CUpti_StateData__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::align_of::<CUpti_StateData__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: CUpti_StateData__bindgen_ty_1__bindgen_ty_1::result",
    ][::std::mem::offset_of!(CUpti_StateData__bindgen_ty_1__bindgen_ty_1, result)
        - 0usize];
    [
        "Offset of field: CUpti_StateData__bindgen_ty_1__bindgen_ty_1::message",
    ][::std::mem::offset_of!(CUpti_StateData__bindgen_ty_1__bindgen_ty_1, message)
        - 8usize];
};
impl Default for CUpti_StateData__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_StateData__bindgen_ty_1",
    ][::std::mem::size_of::<CUpti_StateData__bindgen_ty_1>() - 16usize];
    [
        "Alignment of CUpti_StateData__bindgen_ty_1",
    ][::std::mem::align_of::<CUpti_StateData__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: CUpti_StateData__bindgen_ty_1::notification",
    ][::std::mem::offset_of!(CUpti_StateData__bindgen_ty_1, notification) - 0usize];
};
impl Default for CUpti_StateData__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for CUpti_StateData__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "CUpti_StateData__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUpti_StateData"][::std::mem::size_of::<CUpti_StateData>() - 16usize];
    ["Alignment of CUpti_StateData"][::std::mem::align_of::<CUpti_StateData>() - 8usize];
};
impl Default for CUpti_StateData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for CUpti_StateData {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "CUpti_StateData {{ __bindgen_anon_1: {:?} }}", self.__bindgen_anon_1)
    }
}
/** \brief An ID for a driver API, runtime API, resource or
 synchronization callback.

 An ID for a driver API, runtime API, resource or synchronization
 callback. Within a driver API callback this should be interpreted
 as a CUpti_driver_api_trace_cbid value (these values are defined in
 cupti_driver_cbid.h). Within a runtime API callback this should be
 interpreted as a CUpti_runtime_api_trace_cbid value (these values
 are defined in cupti_runtime_cbid.h). Within a resource API
 callback this should be interpreted as a \ref
 CUpti_CallbackIdResource value. Within a synchronize API callback
 this should be interpreted as a \ref CUpti_CallbackIdSync value.*/
pub type CUpti_CallbackId = u32;
/** \brief Function type for a callback.

 Function type for a callback. The type of the data passed to the
 callback in \p cbdata depends on the \p domain. If \p domain is
 CUPTI_CB_DOMAIN_DRIVER_API or CUPTI_CB_DOMAIN_RUNTIME_API the type
 of \p cbdata will be CUpti_CallbackData. If \p domain is
 CUPTI_CB_DOMAIN_RESOURCE the type of \p cbdata will be
 CUpti_ResourceData. If \p domain is CUPTI_CB_DOMAIN_SYNCHRONIZE the
 type of \p cbdata will be CUpti_SynchronizeData. If \p domain is
 CUPTI_CB_DOMAIN_NVTX the type of \p cbdata will be CUpti_NvtxData.

 \param userdata User data supplied at subscription of the callback
 \param domain The domain of the callback
 \param cbid The ID of the callback
 \param cbdata Data passed to the callback.*/
pub type CUpti_CallbackFunc = ::std::option::Option<
    unsafe extern "C" fn(
        userdata: *mut ::std::os::raw::c_void,
        domain: CUpti_CallbackDomain,
        cbid: CUpti_CallbackId,
        cbdata: *const ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_Subscriber_st {
    _unused: [u8; 0],
}
/// \brief A callback subscriber.
pub type CUpti_SubscriberHandle = *mut CUpti_Subscriber_st;
/// \brief Pointer to an array of callback domains.
pub type CUpti_DomainTable = *mut CUpti_CallbackDomain;
unsafe extern "C" {
    /** \brief Get the available callback domains.

 Returns in \p *domainTable an array of size \p *domainCount of all
 the available callback domains.
 \note \b Thread-safety: this function is thread safe.

 \param domainCount Returns number of callback domains
 \param domainTable Returns pointer to array of available callback domains

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_NOT_INITIALIZED if unable to initialize CUPTI
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p domainCount or \p domainTable are NULL*/
    pub fn cuptiSupportedDomains(
        domainCount: *mut usize,
        domainTable: *mut CUpti_DomainTable,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Initialize a callback subscriber with a callback function
 and user data.

 Initializes a callback subscriber with a callback function and
 (optionally) a pointer to user data. The returned subscriber handle
 can be used to enable and disable the callback for specific domains
 and callback IDs.
 \note Only a single subscriber can be registered at a time. To ensure
 that no other CUPTI client interrupts the profiling session, it's the
 responsibility of all the CUPTI clients to call this function before
 starting the profling session. In case profiling session is already
 started by another CUPTI client, this function returns the error code
 CUPTI_ERROR_MULTIPLE_SUBSCRIBERS_NOT_SUPPORTED.
 Note that this function returns the same error when application is
 launched using NVIDIA tools like Nsight Systems,
 Nsight Compute, cuda-gdb and cuda-memcheck.
 \note This function does not enable any callbacks.
 \note \b Thread-safety: this function is thread safe.
 \note While this API is fully supported and remains available, we recommend transitioning to the new API cuptiSubscribe_v2 moving forward.

 \param subscriber Returns handle to initialize subscriber
 \param callback The callback function
 \param userdata A pointer to user data. This data will be passed to
 the callback function via the \p userdata parameter.

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_NOT_INITIALIZED if unable to initialize CUPTI
 \retval CUPTI_ERROR_MULTIPLE_SUBSCRIBERS_NOT_SUPPORTED if there is already a CUPTI subscriber,
         or if the application is launched with NVIDIA tools like Nsight Systems, Nsight Compute, cuda-gdb and cuda-memcheck.
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p subscriber is NULL*/
    pub fn cuptiSubscribe(
        subscriber: *mut CUpti_SubscriberHandle,
        callback: CUpti_CallbackFunc,
        userdata: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
/// \brief Params for cuptiSubscribe_v2
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_SubscriberParams {
    /** Size of the data structure. CUPTI client should set the size of the structure.
 It will be used in CUPTI to check what fields are available in the structure.
 Used to preserve backward compatibility.*/
    pub structSize: usize,
    /** Name given to the subscriber. The subscriber name need not include the "CUPTI" prefix, as the CUPTI library automatically adds it as "CUPTI for <subscriberName>".
 Can be NULL. An internal copy is created. Size must not exceed CUPTI_SUBSCRIBER_NAME_MAX_LEN to avoid truncation.*/
    pub subscriberName: *const ::std::os::raw::c_char,
    /** In case of CUPTI_ERROR_MULTIPLE_SUBSCRIBERS_NOT_SUPPORTED return code, the name of the incompatible tool or the
 existing CUPTI subscriber will be written to this location. Size should be greater than or equal to CUPTI_OLD_SUBSCRIBER_NAME_MIN_LEN to avoid truncation.
 Can be NULL.*/
    pub oldSubscriberName: *mut ::std::os::raw::c_char,
    /// Size of oldSubscriberName. Minimum size should be CUPTI_OLD_SUBSCRIBER_NAME_MIN_LEN to avoid truncation.
    pub oldSubscriberSize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_SubscriberParams",
    ][::std::mem::size_of::<CUpti_SubscriberParams>() - 32usize];
    [
        "Alignment of CUpti_SubscriberParams",
    ][::std::mem::align_of::<CUpti_SubscriberParams>() - 8usize];
    [
        "Offset of field: CUpti_SubscriberParams::structSize",
    ][::std::mem::offset_of!(CUpti_SubscriberParams, structSize) - 0usize];
    [
        "Offset of field: CUpti_SubscriberParams::subscriberName",
    ][::std::mem::offset_of!(CUpti_SubscriberParams, subscriberName) - 8usize];
    [
        "Offset of field: CUpti_SubscriberParams::oldSubscriberName",
    ][::std::mem::offset_of!(CUpti_SubscriberParams, oldSubscriberName) - 16usize];
    [
        "Offset of field: CUpti_SubscriberParams::oldSubscriberSize",
    ][::std::mem::offset_of!(CUpti_SubscriberParams, oldSubscriberSize) - 24usize];
};
impl Default for CUpti_SubscriberParams {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    /** \brief Initialize a callback subscriber with a callback function
 and user data.

 Initializes a callback subscriber with a callback function and
 (optionally) a pointer to user data. The returned subscriber handle
 can be used to enable and disable the callback for specific domains
 and callback IDs.
 \note Only a single subscriber can be registered at a time. To ensure
 that no other CUPTI client interrupts the profiling session, it's the
 responsibility of all the CUPTI clients to call this function before
 starting the profling session. In case profiling session is already
 started by another CUPTI client, this function returns the error code
 CUPTI_ERROR_MULTIPLE_SUBSCRIBERS_NOT_SUPPORTED.
 Note that this function returns the same error when application is
 launched using NVIDIA tools like Nsight Systems,
 Nsight Compute, cuda-gdb and cuda-memcheck.
 \note This function does not enable any callbacks.
 \note \b Thread-safety: this function is thread safe.

 \param subscriber Returns handle to initialize subscriber
 \param callback The callback function
 \param userdata A pointer to user data. This data will be passed to
 the callback function via the \p userdata parameter.
 \param pParams A pointer to \ref CUpti_SubscriberParams. Can be NULL.

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_NOT_INITIALIZED if unable to initialize CUPTI
 \retval CUPTI_ERROR_MULTIPLE_SUBSCRIBERS_NOT_SUPPORTED if there is already a CUPTI subscriber,
         or if the application is launched with NVIDIA tools like Nsight Systems, Nsight Compute, cuda-gdb and cuda-memcheck.
 \retval CUPTI_ERROR_INVALID_PARAMETER if:
 - \p pParams.structSize is not filled with the size of the structure*/
    pub fn cuptiSubscribe_v2(
        subscriber: *mut CUpti_SubscriberHandle,
        callback: CUpti_CallbackFunc,
        userdata: *mut ::std::os::raw::c_void,
        pParams: *mut CUpti_SubscriberParams,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Unregister a callback subscriber.

 Removes a callback subscriber so that no future callbacks will be
 issued to that subscriber.
 \note \b Thread-safety: this function is thread safe.

 \param subscriber Handle to the initialize subscriber

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_NOT_INITIALIZED if unable to initialized CUPTI
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p subscriber is NULL or not initialized*/
    pub fn cuptiUnsubscribe(subscriber: CUpti_SubscriberHandle) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the current enabled/disabled state of a callback for a specific
 domain and function ID.

 Returns non-zero in \p *enable if the callback for a domain and
 callback ID is enabled, and zero if not enabled.

 \note \b Thread-safety: a subscriber must serialize access to
 cuptiGetCallbackState, cuptiEnableCallback, cuptiEnableDomain, and
 cuptiEnableAllDomains. For example, if cuptiGetCallbackState(sub,
 d, c) and cuptiEnableCallback(sub, d, c) are called concurrently,
 the results are undefined.

 \param enable Returns non-zero if callback enabled, zero if not enabled
 \param subscriber Handle to the initialize subscriber
 \param domain The domain of the callback
 \param cbid The ID of the callback

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_NOT_INITIALIZED if unable to initialized CUPTI
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p enabled is NULL, or if \p
 subscriber, \p domain or \p cbid is invalid.*/
    pub fn cuptiGetCallbackState(
        enable: *mut u32,
        subscriber: CUpti_SubscriberHandle,
        domain: CUpti_CallbackDomain,
        cbid: CUpti_CallbackId,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Enable or disabled callbacks for a specific domain and
 callback ID.

 Enable or disabled callbacks for a subscriber for a specific domain
 and callback ID.

 \note \b Thread-safety: a subscriber must serialize access to
 cuptiGetCallbackState, cuptiEnableCallback, cuptiEnableDomain, and
 cuptiEnableAllDomains. For example, if cuptiGetCallbackState(sub,
 d, c) and cuptiEnableCallback(sub, d, c) are called concurrently,
 the results are undefined.

 \param enable New enable state for the callback. Zero disables the
 callback, non-zero enables the callback.
 \param subscriber - Handle to callback subscription
 \param domain The domain of the callback
 \param cbid The ID of the callback

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_NOT_INITIALIZED if unable to initialized CUPTI
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p subscriber, \p domain or \p
 cbid is invalid.*/
    pub fn cuptiEnableCallback(
        enable: u32,
        subscriber: CUpti_SubscriberHandle,
        domain: CUpti_CallbackDomain,
        cbid: CUpti_CallbackId,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Enable or disabled all callbacks for a specific domain.

 Enable or disabled all callbacks for a specific domain.

 \note \b Thread-safety: a subscriber must serialize access to
 cuptiGetCallbackState, cuptiEnableCallback, cuptiEnableDomain, and
 cuptiEnableAllDomains. For example, if cuptiGetCallbackEnabled(sub,
 d, *) and cuptiEnableDomain(sub, d) are called concurrently, the
 results are undefined.

 \param enable New enable state for all callbacks in the
 domain. Zero disables all callbacks, non-zero enables all
 callbacks.
 \param subscriber - Handle to callback subscription
 \param domain The domain of the callback

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_NOT_INITIALIZED if unable to initialized CUPTI
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p subscriber or \p domain is invalid*/
    pub fn cuptiEnableDomain(
        enable: u32,
        subscriber: CUpti_SubscriberHandle,
        domain: CUpti_CallbackDomain,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Enable or disable all callbacks in all domains.

 Enable or disable all callbacks in all domains.

 \note \b Thread-safety: a subscriber must serialize access to
 cuptiGetCallbackState, cuptiEnableCallback, cuptiEnableDomain, and
 cuptiEnableAllDomains. For example, if cuptiGetCallbackState(sub,
 d, *) and cuptiEnableAllDomains(sub) are called concurrently, the
 results are undefined.

 \param enable New enable state for all callbacks in all
 domain. Zero disables all callbacks, non-zero enables all
 callbacks.
 \param subscriber - Handle to callback subscription

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_NOT_INITIALIZED if unable to initialized CUPTI
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p subscriber is invalid*/
    pub fn cuptiEnableAllDomains(
        enable: u32,
        subscriber: CUpti_SubscriberHandle,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the name of a callback for a specific domain and callback ID.

 Returns a pointer to the name c_string in \p **name.

 \note \b Names are available only for the DRIVER and RUNTIME domains.

 \param domain The domain of the callback
 \param cbid The ID of the callback
 \param name Returns pointer to the name string on success, NULL otherwise

 \retval CUPTI_SUCCESS on success
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p name is NULL, or if
 \p domain or \p cbid is invalid.*/
    pub fn cuptiGetCallbackName(
        domain: CUpti_CallbackDomain,
        cbid: u32,
        name: *mut *const ::std::os::raw::c_char,
    ) -> CUptiResult;
}
/** \brief ID for an event.

 An event represents a countable activity, action, or occurrence on
 the device.*/
pub type CUpti_EventID = u32;
/** \brief ID for an event domain.

 ID for an event domain. An event domain represents a group of
 related events. A device may have multiple instances of a domain,
 indicating that the device can simultaneously record multiple
 instances of each event within that domain.*/
pub type CUpti_EventDomainID = u32;
/** \brief A group of events.

 An event group is a collection of events that are managed
 together. All events in an event group must belong to the same
 domain.*/
pub type CUpti_EventGroup = *mut ::std::os::raw::c_void;
pub const CUPTI_DEVICE_ATTR_DEVICE_CLASS_TESLA: CUpti_DeviceAttributeDeviceClass = 0;
pub const CUPTI_DEVICE_ATTR_DEVICE_CLASS_QUADRO: CUpti_DeviceAttributeDeviceClass = 1;
pub const CUPTI_DEVICE_ATTR_DEVICE_CLASS_GEFORCE: CUpti_DeviceAttributeDeviceClass = 2;
pub const CUPTI_DEVICE_ATTR_DEVICE_CLASS_TEGRA: CUpti_DeviceAttributeDeviceClass = 3;
/** \brief Device class.

 Enumeration of device classes for device attribute
 CUPTI_DEVICE_ATTR_DEVICE_CLASS.*/
pub type CUpti_DeviceAttributeDeviceClass = ::std::os::raw::c_uint;
/// Number of event IDs for a device. Value is a uint32_t.
pub const CUPTI_DEVICE_ATTR_MAX_EVENT_ID: CUpti_DeviceAttribute = 1;
/// Number of event domain IDs for a device. Value is a uint32_t.
pub const CUPTI_DEVICE_ATTR_MAX_EVENT_DOMAIN_ID: CUpti_DeviceAttribute = 2;
/// Get global memory bandwidth in Kbytes/sec. Value is a uint64_t.
pub const CUPTI_DEVICE_ATTR_GLOBAL_MEMORY_BANDWIDTH: CUpti_DeviceAttribute = 3;
/** Get theoretical maximum number of instructions per cycle. Value
 is a uint32_t.*/
pub const CUPTI_DEVICE_ATTR_INSTRUCTION_PER_CYCLE: CUpti_DeviceAttribute = 4;
/** Get theoretical maximum number of single precision instructions
 that can be executed per second. Value is a uint64_t.*/
pub const CUPTI_DEVICE_ATTR_INSTRUCTION_THROUGHPUT_SINGLE_PRECISION: CUpti_DeviceAttribute = 5;
/// Get number of frame buffers for device.  Value is a uint64_t.
pub const CUPTI_DEVICE_ATTR_MAX_FRAME_BUFFERS: CUpti_DeviceAttribute = 6;
/** Get PCIE link rate in Mega bits/sec for device. Return 0 if bus-type
 is non-PCIE. Value is a uint64_t.*/
pub const CUPTI_DEVICE_ATTR_PCIE_LINK_RATE: CUpti_DeviceAttribute = 7;
/** Get PCIE link width for device. Return 0 if bus-type
 is non-PCIE. Value is a uint64_t.*/
pub const CUPTI_DEVICE_ATTR_PCIE_LINK_WIDTH: CUpti_DeviceAttribute = 8;
/** Get PCIE generation for device. Return 0 if bus-type
 is non-PCIE. Value is a uint64_t.*/
pub const CUPTI_DEVICE_ATTR_PCIE_GEN: CUpti_DeviceAttribute = 9;
/** Get the class for the device. Value is a
 CUpti_DeviceAttributeDeviceClass.*/
pub const CUPTI_DEVICE_ATTR_DEVICE_CLASS: CUpti_DeviceAttribute = 10;
/// Get the peak single precision flop per cycle. Value is a uint64_t.
pub const CUPTI_DEVICE_ATTR_FLOP_SP_PER_CYCLE: CUpti_DeviceAttribute = 11;
/// Get the peak double precision flop per cycle. Value is a uint64_t.
pub const CUPTI_DEVICE_ATTR_FLOP_DP_PER_CYCLE: CUpti_DeviceAttribute = 12;
/// Get number of L2 units. Value is a uint64_t.
pub const CUPTI_DEVICE_ATTR_MAX_L2_UNITS: CUpti_DeviceAttribute = 13;
/** Get the maximum shared memory for the CU_FUNC_CACHE_PREFER_SHARED
 preference. Value is a uint64_t.*/
pub const CUPTI_DEVICE_ATTR_MAX_SHARED_MEMORY_CACHE_CONFIG_PREFER_SHARED: CUpti_DeviceAttribute = 14;
/** Get the maximum shared memory for the CU_FUNC_CACHE_PREFER_L1
 preference. Value is a uint64_t.*/
pub const CUPTI_DEVICE_ATTR_MAX_SHARED_MEMORY_CACHE_CONFIG_PREFER_L1: CUpti_DeviceAttribute = 15;
/** Get the maximum shared memory for the CU_FUNC_CACHE_PREFER_EQUAL
 preference. Value is a uint64_t.*/
pub const CUPTI_DEVICE_ATTR_MAX_SHARED_MEMORY_CACHE_CONFIG_PREFER_EQUAL: CUpti_DeviceAttribute = 16;
/// Get the peak half precision flop per cycle. Value is a uint64_t.
pub const CUPTI_DEVICE_ATTR_FLOP_HP_PER_CYCLE: CUpti_DeviceAttribute = 17;
/** Check if Nvlink is connected to device. Returns 1, if at least one
 Nvlink is connected to the device, returns 0 otherwise.
 Value is a uint32_t.*/
pub const CUPTI_DEVICE_ATTR_NVLINK_PRESENT: CUpti_DeviceAttribute = 18;
/** Check if Nvlink is present between GPU and CPU. Returns Bandwidth,
 in Bytes/sec, if Nvlink is present, returns 0 otherwise.
 Value is a uint64_t.*/
pub const CUPTI_DEVICE_ATTR_GPU_CPU_NVLINK_BW: CUpti_DeviceAttribute = 19;
/** Check if NVSwitch is present in the underlying topology.
 Returns 1, if present, returns 0 otherwise.
 Value is a uint32_t.*/
pub const CUPTI_DEVICE_ATTR_NVSWITCH_PRESENT: CUpti_DeviceAttribute = 20;
/** Check if NVSwitch is present in the underlying topology.
 Returns 1, if present, returns 0 otherwise.
 Value is a uint32_t.*/
pub const CUPTI_DEVICE_ATTR_FORCE_INT: CUpti_DeviceAttribute = 2147483647;
/** \brief Device attributes.

 CUPTI device attributes. These attributes can be read using \ref
 cuptiDeviceGetAttribute.*/
pub type CUpti_DeviceAttribute = ::std::os::raw::c_uint;
/// Event domain name. Value is a null terminated const c-string.
pub const CUPTI_EVENT_DOMAIN_ATTR_NAME: CUpti_EventDomainAttribute = 0;
/** Number of instances of the domain for which event counts will be
 collected.  The domain may have additional instances that cannot
 be profiled (see CUPTI_EVENT_DOMAIN_ATTR_TOTAL_INSTANCE_COUNT).
 Can be read only with \ref
 cuptiDeviceGetEventDomainAttribute. Value is a uint32_t.*/
pub const CUPTI_EVENT_DOMAIN_ATTR_INSTANCE_COUNT: CUpti_EventDomainAttribute = 1;
/** Total number of instances of the domain, including instances that
 cannot be profiled.  Use CUPTI_EVENT_DOMAIN_ATTR_INSTANCE_COUNT
 to get the number of instances that can be profiled. Can be read
 only with \ref cuptiDeviceGetEventDomainAttribute. Value is a
 uint32_t.*/
pub const CUPTI_EVENT_DOMAIN_ATTR_TOTAL_INSTANCE_COUNT: CUpti_EventDomainAttribute = 3;
/** Collection method used for events contained in the event domain.
 Value is a \ref CUpti_EventCollectionMethod.*/
pub const CUPTI_EVENT_DOMAIN_ATTR_COLLECTION_METHOD: CUpti_EventDomainAttribute = 4;
/** Collection method used for events contained in the event domain.
 Value is a \ref CUpti_EventCollectionMethod.*/
pub const CUPTI_EVENT_DOMAIN_ATTR_FORCE_INT: CUpti_EventDomainAttribute = 2147483647;
/** \brief Event domain attributes.

 Event domain attributes. Except where noted, all the attributes can
 be read using either \ref cuptiDeviceGetEventDomainAttribute or
 \ref cuptiEventDomainGetAttribute.*/
pub type CUpti_EventDomainAttribute = ::std::os::raw::c_uint;
/// Event is collected using a hardware global performance monitor.
pub const CUPTI_EVENT_COLLECTION_METHOD_PM: CUpti_EventCollectionMethod = 0;
/// Event is collected using a hardware SM performance monitor.
pub const CUPTI_EVENT_COLLECTION_METHOD_SM: CUpti_EventCollectionMethod = 1;
/// Event is collected using software instrumentation.
pub const CUPTI_EVENT_COLLECTION_METHOD_INSTRUMENTED: CUpti_EventCollectionMethod = 2;
/// Event is collected using NvLink throughput counter method.
pub const CUPTI_EVENT_COLLECTION_METHOD_NVLINK_TC: CUpti_EventCollectionMethod = 3;
/// Event is collected using NvLink throughput counter method.
pub const CUPTI_EVENT_COLLECTION_METHOD_FORCE_INT: CUpti_EventCollectionMethod = 2147483647;
/** \brief The collection method used for an event.

 The collection method indicates how an event is collected.*/
pub type CUpti_EventCollectionMethod = ::std::os::raw::c_uint;
/** The domain to which the event group is bound. This attribute is
 set when the first event is added to the group.  Value is a
 CUpti_EventDomainID.*/
pub const CUPTI_EVENT_GROUP_ATTR_EVENT_DOMAIN_ID: CUpti_EventGroupAttribute = 0;
/** [rw] Profile all the instances of the domain for this
 eventgroup. This feature can be used to get load balancing
 across all instances of a domain. Value is an integer.*/
pub const CUPTI_EVENT_GROUP_ATTR_PROFILE_ALL_DOMAIN_INSTANCES: CUpti_EventGroupAttribute = 1;
/// [rw] Reserved for user data.
pub const CUPTI_EVENT_GROUP_ATTR_USER_DATA: CUpti_EventGroupAttribute = 2;
/// Number of events in the group. Value is a uint32_t.
pub const CUPTI_EVENT_GROUP_ATTR_NUM_EVENTS: CUpti_EventGroupAttribute = 3;
/** Enumerates events in the group. Value is a pointer to buffer of
 size sizeof(CUpti_EventID) * num_of_events in the eventgroup.
 num_of_events can be queried using
 CUPTI_EVENT_GROUP_ATTR_NUM_EVENTS.*/
pub const CUPTI_EVENT_GROUP_ATTR_EVENTS: CUpti_EventGroupAttribute = 4;
/** Number of instances of the domain bound to this event group that
 will be counted.  Value is a uint32_t.*/
pub const CUPTI_EVENT_GROUP_ATTR_INSTANCE_COUNT: CUpti_EventGroupAttribute = 5;
/** Event group scope can be set to CUPTI_EVENT_PROFILING_SCOPE_DEVICE or
 CUPTI_EVENT_PROFILING_SCOPE_CONTEXT for an eventGroup, before
 adding any event.
 Sets the scope of eventgroup as CUPTI_EVENT_PROFILING_SCOPE_DEVICE or
 CUPTI_EVENT_PROFILING_SCOPE_CONTEXT when the scope of the events
 that will be added is CUPTI_EVENT_PROFILING_SCOPE_BOTH.
 If profiling scope of event is either
 CUPTI_EVENT_PROFILING_SCOPE_DEVICE or CUPTI_EVENT_PROFILING_SCOPE_CONTEXT
 then setting this attribute will not affect the default scope.
 It is not allowed to add events of different scope to same eventgroup.
 Value is a uint32_t.*/
pub const CUPTI_EVENT_GROUP_ATTR_PROFILING_SCOPE: CUpti_EventGroupAttribute = 6;
/** Event group scope can be set to CUPTI_EVENT_PROFILING_SCOPE_DEVICE or
 CUPTI_EVENT_PROFILING_SCOPE_CONTEXT for an eventGroup, before
 adding any event.
 Sets the scope of eventgroup as CUPTI_EVENT_PROFILING_SCOPE_DEVICE or
 CUPTI_EVENT_PROFILING_SCOPE_CONTEXT when the scope of the events
 that will be added is CUPTI_EVENT_PROFILING_SCOPE_BOTH.
 If profiling scope of event is either
 CUPTI_EVENT_PROFILING_SCOPE_DEVICE or CUPTI_EVENT_PROFILING_SCOPE_CONTEXT
 then setting this attribute will not affect the default scope.
 It is not allowed to add events of different scope to same eventgroup.
 Value is a uint32_t.*/
pub const CUPTI_EVENT_GROUP_ATTR_FORCE_INT: CUpti_EventGroupAttribute = 2147483647;
/** \brief Event group attributes.

 Event group attributes. These attributes can be read using \ref
 cuptiEventGroupGetAttribute. Attributes marked [rw] can also be
 written using \ref cuptiEventGroupSetAttribute.*/
pub type CUpti_EventGroupAttribute = ::std::os::raw::c_uint;
/// Event is collected at context scope.
pub const CUPTI_EVENT_PROFILING_SCOPE_CONTEXT: CUpti_EventProfilingScope = 0;
/// Event is collected at device scope.
pub const CUPTI_EVENT_PROFILING_SCOPE_DEVICE: CUpti_EventProfilingScope = 1;
/** Event can be collected at device or context scope.
 The scope can be set using \ref cuptiEventGroupSetAttribute API.*/
pub const CUPTI_EVENT_PROFILING_SCOPE_BOTH: CUpti_EventProfilingScope = 2;
/** Event can be collected at device or context scope.
 The scope can be set using \ref cuptiEventGroupSetAttribute API.*/
pub const CUPTI_EVENT_PROFILING_SCOPE_FORCE_INT: CUpti_EventProfilingScope = 2147483647;
/** \brief Profiling scope for event.

 Profiling scope of event indicates if the event can be collected at context
 scope or device scope or both i.e. it can be collected at any of context or
 device scope.*/
pub type CUpti_EventProfilingScope = ::std::os::raw::c_uint;
/// Event name. Value is a null terminated const c-string.
pub const CUPTI_EVENT_ATTR_NAME: CUpti_EventAttribute = 0;
/** Short description of event. Value is a null terminated const
 c-string.*/
pub const CUPTI_EVENT_ATTR_SHORT_DESCRIPTION: CUpti_EventAttribute = 1;
/** Long description of event. Value is a null terminated const
 c-string.*/
pub const CUPTI_EVENT_ATTR_LONG_DESCRIPTION: CUpti_EventAttribute = 2;
/// Category of event. Value is CUpti_EventCategory.
pub const CUPTI_EVENT_ATTR_CATEGORY: CUpti_EventAttribute = 3;
/** Profiling scope of the events. It can be either device or context or both.
 Value is a \ref CUpti_EventProfilingScope.*/
pub const CUPTI_EVENT_ATTR_PROFILING_SCOPE: CUpti_EventAttribute = 5;
/** Profiling scope of the events. It can be either device or context or both.
 Value is a \ref CUpti_EventProfilingScope.*/
pub const CUPTI_EVENT_ATTR_FORCE_INT: CUpti_EventAttribute = 2147483647;
/** \brief Event attributes.

 Event attributes. These attributes can be read using \ref
 cuptiEventGetAttribute.*/
pub type CUpti_EventAttribute = ::std::os::raw::c_uint;
/** Events are collected for the entire duration between the
 cuptiEventGroupEnable and cuptiEventGroupDisable calls.
 Event values are reset when the events are read.
 For CUDA toolkit v6.0 and older this was the default mode.*/
pub const CUPTI_EVENT_COLLECTION_MODE_CONTINUOUS: CUpti_EventCollectionMode = 0;
/** Events are collected only for the durations of kernel executions
 that occur between the cuptiEventGroupEnable and
 cuptiEventGroupDisable calls. Event collection begins when a
 kernel execution begins, and stops when kernel execution
 completes. Event values are reset to zero when each kernel
 execution begins. If multiple kernel executions occur between the
 cuptiEventGroupEnable and cuptiEventGroupDisable calls then the
 event values must be read after each kernel launch if those
 events need to be associated with the specific kernel launch.
 Note that collection in this mode may significantly change the
 overall performance characteristics of the application because
 kernel executions that occur between the cuptiEventGroupEnable and
 cuptiEventGroupDisable calls are serialized on the GPU.
 This is the default mode from CUDA toolkit v6.5*/
pub const CUPTI_EVENT_COLLECTION_MODE_KERNEL: CUpti_EventCollectionMode = 1;
/** Events are collected only for the durations of kernel executions
 that occur between the cuptiEventGroupEnable and
 cuptiEventGroupDisable calls. Event collection begins when a
 kernel execution begins, and stops when kernel execution
 completes. Event values are reset to zero when each kernel
 execution begins. If multiple kernel executions occur between the
 cuptiEventGroupEnable and cuptiEventGroupDisable calls then the
 event values must be read after each kernel launch if those
 events need to be associated with the specific kernel launch.
 Note that collection in this mode may significantly change the
 overall performance characteristics of the application because
 kernel executions that occur between the cuptiEventGroupEnable and
 cuptiEventGroupDisable calls are serialized on the GPU.
 This is the default mode from CUDA toolkit v6.5*/
pub const CUPTI_EVENT_COLLECTION_MODE_FORCE_INT: CUpti_EventCollectionMode = 2147483647;
/** \brief Event collection modes.

 The event collection mode determines the period over which the
 events within the enabled event groups will be collected.*/
pub type CUpti_EventCollectionMode = ::std::os::raw::c_uint;
/// An instruction related event.
pub const CUPTI_EVENT_CATEGORY_INSTRUCTION: CUpti_EventCategory = 0;
/// A memory related event.
pub const CUPTI_EVENT_CATEGORY_MEMORY: CUpti_EventCategory = 1;
/// A cache related event.
pub const CUPTI_EVENT_CATEGORY_CACHE: CUpti_EventCategory = 2;
/// A profile-trigger event.
pub const CUPTI_EVENT_CATEGORY_PROFILE_TRIGGER: CUpti_EventCategory = 3;
/// A system event.
pub const CUPTI_EVENT_CATEGORY_SYSTEM: CUpti_EventCategory = 4;
/// A system event.
pub const CUPTI_EVENT_CATEGORY_FORCE_INT: CUpti_EventCategory = 2147483647;
/** \brief An event category.

 Each event is assigned to a category that represents the general
 type of the event. A event's category is accessed using \ref
 cuptiEventGetAttribute and the CUPTI_EVENT_ATTR_CATEGORY attribute.*/
pub type CUpti_EventCategory = ::std::os::raw::c_uint;
/// No flags.
pub const CUPTI_EVENT_READ_FLAG_NONE: CUpti_ReadEventFlags = 0;
/// No flags.
pub const CUPTI_EVENT_READ_FLAG_FORCE_INT: CUpti_ReadEventFlags = 2147483647;
/** \brief Flags for cuptiEventGroupReadEvent an
 cuptiEventGroupReadAllEvents.

 Flags for \ref cuptiEventGroupReadEvent an \ref
 cuptiEventGroupReadAllEvents.*/
pub type CUpti_ReadEventFlags = ::std::os::raw::c_uint;
/** \brief A set of event groups.

 A set of event groups. When returned by \ref
 cuptiEventGroupSetsCreate and \ref cuptiMetricCreateEventGroupSets
 a set indicates that event groups that can be enabled at the same
 time (i.e. all the events in the set can be collected
 simultaneously).*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_EventGroupSet {
    /// The number of event groups in the set.
    pub numEventGroups: u32,
    /// An array of \p numEventGroups event groups.
    pub eventGroups: *mut CUpti_EventGroup,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_EventGroupSet",
    ][::std::mem::size_of::<CUpti_EventGroupSet>() - 16usize];
    [
        "Alignment of CUpti_EventGroupSet",
    ][::std::mem::align_of::<CUpti_EventGroupSet>() - 8usize];
    [
        "Offset of field: CUpti_EventGroupSet::numEventGroups",
    ][::std::mem::offset_of!(CUpti_EventGroupSet, numEventGroups) - 0usize];
    [
        "Offset of field: CUpti_EventGroupSet::eventGroups",
    ][::std::mem::offset_of!(CUpti_EventGroupSet, eventGroups) - 8usize];
};
impl Default for CUpti_EventGroupSet {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief A set of event group sets.

 A set of event group sets. When returned by \ref
 cuptiEventGroupSetsCreate and \ref cuptiMetricCreateEventGroupSets
 a CUpti_EventGroupSets indicates the number of passes required to
 collect all the events, and the event groups that should be
 collected during each pass.*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_EventGroupSets {
    /// Number of event group sets.
    pub numSets: u32,
    /// An array of \p numSets event group sets.
    pub sets: *mut CUpti_EventGroupSet,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_EventGroupSets",
    ][::std::mem::size_of::<CUpti_EventGroupSets>() - 16usize];
    [
        "Alignment of CUpti_EventGroupSets",
    ][::std::mem::align_of::<CUpti_EventGroupSets>() - 8usize];
    [
        "Offset of field: CUpti_EventGroupSets::numSets",
    ][::std::mem::offset_of!(CUpti_EventGroupSets, numSets) - 0usize];
    [
        "Offset of field: CUpti_EventGroupSets::sets",
    ][::std::mem::offset_of!(CUpti_EventGroupSets, sets) - 8usize];
};
impl Default for CUpti_EventGroupSets {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    /** \brief Set the event collection mode.

 Set the event collection mode for a \p context.  The \p mode
 controls the event collection behavior of all events in event
 groups created in the \p context. This API is invalid in kernel
 replay mode.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param context The context
 \param mode The event collection mode

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_CONTEXT
 \retval CUPTI_ERROR_INVALID_OPERATION if called when replay mode is enabled
 \retval CUPTI_ERROR_NOT_SUPPORTED if mode is not supported on the device*/
    pub fn cuptiSetEventCollectionMode(
        context: CUcontext,
        mode: CUpti_EventCollectionMode,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Read a device attribute.

 Read a device attribute and return it in \p *value.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device CUDA device
 \param attrib The attribute to read
 \param valueSize Size of buffer pointed by the value, and
 returns the number of bytes written to \p value
 \param value Returns the value of the attribute

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_DEVICE
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p valueSize or \p value
 is NULL, or if \p attrib is not a device attribute
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT For non-c-string
 attribute values, indicates that the \p value buffer is too small
 to hold the attribute value.*/
    pub fn cuptiDeviceGetAttribute(
        device: CUdevice,
        attrib: CUpti_DeviceAttribute,
        valueSize: *mut usize,
        value: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the number of domains for a device.

 Returns the number of domains in \p numDomains for a device.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device CUDA device
 \param numDomains Returns the number of domains

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_DEVICE
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p numDomains is NULL*/
    pub fn cuptiDeviceGetNumEventDomains(
        device: CUdevice,
        numDomains: *mut u32,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the event domains for a device.

 Returns the event domains IDs in \p domainArray for a device.  The
 size of the \p domainArray buffer is given by \p
 *arraySizeBytes. The size of the \p domainArray buffer must be at
 least \p numdomains * sizeof(CUpti_EventDomainID) or else all
 domains will not be returned. The value returned in \p
 *arraySizeBytes contains the number of bytes returned in \p
 domainArray.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device CUDA device
 \param arraySizeBytes The size of \p domainArray in bytes, and
 returns the number of bytes written to \p domainArray
 \param domainArray Returns the IDs of the event domains for the device

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_DEVICE
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p arraySizeBytes or
 \p domainArray are NULL*/
    pub fn cuptiDeviceEnumEventDomains(
        device: CUdevice,
        arraySizeBytes: *mut usize,
        domainArray: *mut CUpti_EventDomainID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Read an event domain attribute.

 Returns an event domain attribute in \p *value. The size of the \p
 value buffer is given by \p *valueSize. The value returned in \p
 *valueSize contains the number of bytes returned in \p value.

 If the attribute value is a c-string that is longer than \p
 *valueSize, then only the first \p *valueSize characters will be
 returned and there will be no terminating null byte.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device CUDA device
 \param eventDomain ID of the event domain
 \param attrib The event domain attribute to read
 \param valueSize The size of the \p value buffer in bytes, and
 returns the number of bytes written to \p value
 \param value Returns the attribute's value

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_DEVICE
 \retval CUPTI_ERROR_INVALID_EVENT_DOMAIN_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p valueSize or \p value
 is NULL, or if \p attrib is not an event domain attribute
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT For non-c-string
 attribute values, indicates that the \p value buffer is too small
 to hold the attribute value.*/
    pub fn cuptiDeviceGetEventDomainAttribute(
        device: CUdevice,
        eventDomain: CUpti_EventDomainID,
        attrib: CUpti_EventDomainAttribute,
        valueSize: *mut usize,
        value: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the number of event domains available on any device.

 Returns the total number of event domains available on any
 CUDA-capable device.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param numDomains Returns the number of domains

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p numDomains is NULL*/
    pub fn cuptiGetNumEventDomains(numDomains: *mut u32) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the event domains available on any device.

 Returns all the event domains available on any CUDA-capable device.
 Event domain IDs are returned in \p domainArray. The size of the \p
 domainArray buffer is given by \p *arraySizeBytes. The size of the
 \p domainArray buffer must be at least \p numDomains *
 sizeof(CUpti_EventDomainID) or all domains will not be
 returned. The value returned in \p *arraySizeBytes contains the
 number of bytes returned in \p domainArray.
 \note \b Thread-safety: this function is thread safe.

 \param arraySizeBytes The size of \p domainArray in bytes, and
 returns the number of bytes written to \p domainArray
 \param domainArray Returns all the event domains

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p arraySizeBytes or
 \p domainArray are NULL*/
    pub fn cuptiEnumEventDomains(
        arraySizeBytes: *mut usize,
        domainArray: *mut CUpti_EventDomainID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Read an event domain attribute.

 Returns an event domain attribute in \p *value. The size of the \p
 value buffer is given by \p *valueSize. The value returned in \p
 *valueSize contains the number of bytes returned in \p value.

 If the attribute value is a c-string that is longer than \p
 *valueSize, then only the first \p *valueSize characters will be
 returned and there will be no terminating null byte.
 \note \b Thread-safety: this function is thread safe.

 \param eventDomain ID of the event domain
 \param attrib The event domain attribute to read
 \param valueSize The size of the \p value buffer in bytes, and
 returns the number of bytes written to \p value
 \param value Returns the attribute's value

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_EVENT_DOMAIN_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p valueSize or \p value
 is NULL, or if \p attrib is not an event domain attribute
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT For non-c-string
 attribute values, indicates that the \p value buffer is too small
 to hold the attribute value.*/
    pub fn cuptiEventDomainGetAttribute(
        eventDomain: CUpti_EventDomainID,
        attrib: CUpti_EventDomainAttribute,
        valueSize: *mut usize,
        value: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get number of events in a domain.

 Returns the number of events in \p numEvents for a domain.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventDomain ID of the event domain
 \param numEvents Returns the number of events in the domain

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_EVENT_DOMAIN_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p numEvents is NULL*/
    pub fn cuptiEventDomainGetNumEvents(
        eventDomain: CUpti_EventDomainID,
        numEvents: *mut u32,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the events in a domain.

 Returns the event IDs in \p eventArray for a domain.  The size of
 the \p eventArray buffer is given by \p *arraySizeBytes. The size
 of the \p eventArray buffer must be at least \p numdomainevents *
 sizeof(CUpti_EventID) or else all events will not be returned. The
 value returned in \p *arraySizeBytes contains the number of bytes
 returned in \p eventArray.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventDomain ID of the event domain
 \param arraySizeBytes The size of \p eventArray in bytes, and
 returns the number of bytes written to \p eventArray
 \param eventArray Returns the IDs of the events in the domain

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_EVENT_DOMAIN_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p arraySizeBytes or \p
 eventArray are NULL*/
    pub fn cuptiEventDomainEnumEvents(
        eventDomain: CUpti_EventDomainID,
        arraySizeBytes: *mut usize,
        eventArray: *mut CUpti_EventID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get an event attribute.

 Returns an event attribute in \p *value. The size of the \p
 value buffer is given by \p *valueSize. The value returned in \p
 *valueSize contains the number of bytes returned in \p value.

 If the attribute value is a c-string that is longer than \p
 *valueSize, then only the first \p *valueSize characters will be
 returned and there will be no terminating null byte.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param event ID of the event
 \param attrib The event attribute to read
 \param valueSize The size of the \p value buffer in bytes, and
 returns the number of bytes written to \p value
 \param value Returns the attribute's value

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_EVENT_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p valueSize or \p value
 is NULL, or if \p attrib is not an event attribute
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT For non-c-string
 attribute values, indicates that the \p value buffer is too small
 to hold the attribute value.*/
    pub fn cuptiEventGetAttribute(
        event: CUpti_EventID,
        attrib: CUpti_EventAttribute,
        valueSize: *mut usize,
        value: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Find an event by name.

 Find an event by name and return the event ID in \p *event.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device CUDA device
 \param eventName The name of the event to find
 \param event Returns the ID of the found event or undefined if
 unable to find the event

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_DEVICE
 \retval CUPTI_ERROR_INVALID_EVENT_NAME if unable to find an event
 with name \p eventName. In this case \p *event is undefined
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventName or \p event are NULL*/
    pub fn cuptiEventGetIdFromName(
        device: CUdevice,
        eventName: *const ::std::os::raw::c_char,
        event: *mut CUpti_EventID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Create a new event group for a context.

 Creates a new event group for \p context and returns the new group
 in \p *eventGroup.
 \note \p flags are reserved for future use and should be set to zero.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param context The context for the event group
 \param eventGroup Returns the new event group
 \param flags Reserved - must be zero

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_CONTEXT
 \retval CUPTI_ERROR_OUT_OF_MEMORY
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup is NULL*/
    pub fn cuptiEventGroupCreate(
        context: CUcontext,
        eventGroup: *mut CUpti_EventGroup,
        flags: u32,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Destroy an event group.

 Destroy an \p eventGroup and free its resources. An event group
 cannot be destroyed if it is enabled.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group to destroy

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_OPERATION if the event group is enabled
 \retval CUPTI_ERROR_INVALID_PARAMETER if eventGroup is NULL*/
    pub fn cuptiEventGroupDestroy(eventGroup: CUpti_EventGroup) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Read an event group attribute.

 Read an event group attribute and return it in \p *value.
 \note \b Thread-safety: this function is thread safe but client
 must guard against simultaneous destruction or modification of \p
 eventGroup (for example, client must guard against simultaneous
 calls to \ref cuptiEventGroupDestroy, \ref cuptiEventGroupAddEvent,
 etc.), and must guard against simultaneous destruction of the
 context in which \p eventGroup was created (for example, client
 must guard against simultaneous calls to cudaDeviceReset,
 cuCtxDestroy, etc.).

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group
 \param attrib The attribute to read
 \param valueSize Size of buffer pointed by the value, and
 returns the number of bytes written to \p value
 \param value Returns the value of the attribute

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p valueSize or \p value
 is NULL, or if \p attrib is not an eventgroup attribute
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT For non-c-string
 attribute values, indicates that the \p value buffer is too small
 to hold the attribute value.*/
    pub fn cuptiEventGroupGetAttribute(
        eventGroup: CUpti_EventGroup,
        attrib: CUpti_EventGroupAttribute,
        valueSize: *mut usize,
        value: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Write an event group attribute.

 Write an event group attribute.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group
 \param attrib The attribute to write
 \param valueSize The size, in bytes, of the value
 \param value The attribute value to write

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p valueSize or \p value
 is NULL, or if \p attrib is not an event group attribute, or if
 \p attrib is not a writable attribute
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT Indicates that
 the \p value buffer is too small to hold the attribute value.*/
    pub fn cuptiEventGroupSetAttribute(
        eventGroup: CUpti_EventGroup,
        attrib: CUpti_EventGroupAttribute,
        valueSize: usize,
        value: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Add an event to an event group.

 Add an event to an event group. The event add can fail for a number of reasons:
 \li The event group is enabled
 \li The event does not belong to the same event domain as the
 events that are already in the event group
 \li Device limitations on the events that can belong to the same group
 \li The event group is full

 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group
 \param event The event to add to the group

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_EVENT_ID
 \retval CUPTI_ERROR_OUT_OF_MEMORY
 \retval CUPTI_ERROR_INVALID_OPERATION if \p eventGroup is enabled
 \retval CUPTI_ERROR_NOT_COMPATIBLE if \p event belongs to a
 different event domain than the events already in \p eventGroup, or
 if a device limitation prevents \p event from being collected at
 the same time as the events already in \p eventGroup
 \retval CUPTI_ERROR_MAX_LIMIT_REACHED if \p eventGroup is full
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup is NULL*/
    pub fn cuptiEventGroupAddEvent(
        eventGroup: CUpti_EventGroup,
        event: CUpti_EventID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Remove an event from an event group.

 Remove \p event from the an event group. The event cannot be
 removed if the event group is enabled.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group
 \param event The event to remove from the group

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_EVENT_ID
 \retval CUPTI_ERROR_INVALID_OPERATION if \p eventGroup is enabled
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup is NULL*/
    pub fn cuptiEventGroupRemoveEvent(
        eventGroup: CUpti_EventGroup,
        event: CUpti_EventID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Remove all events from an event group.

 Remove all events from an event group. Events cannot be removed if
 the event group is enabled.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_OPERATION if \p eventGroup is enabled
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup is NULL*/
    pub fn cuptiEventGroupRemoveAllEvents(eventGroup: CUpti_EventGroup) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Zero all the event counts in an event group.

 Zero all the event counts in an event group.
 \note \b Thread-safety: this function is thread safe but client
 must guard against simultaneous destruction or modification of \p
 eventGroup (for example, client must guard against simultaneous
 calls to \ref cuptiEventGroupDestroy, \ref cuptiEventGroupAddEvent,
 etc.), and must guard against simultaneous destruction of the
 context in which \p eventGroup was created (for example, client
 must guard against simultaneous calls to cudaDeviceReset,
 cuCtxDestroy, etc.).

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_HARDWARE
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup is NULL*/
    pub fn cuptiEventGroupResetAllEvents(eventGroup: CUpti_EventGroup) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Enable an event group.

 Enable an event group. Enabling an event group zeros the value of
 all the events in the group and then starts collection of those
 events.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_HARDWARE
 \retval CUPTI_ERROR_NOT_READY if \p eventGroup does not contain any events
 \retval CUPTI_ERROR_NOT_COMPATIBLE if \p eventGroup cannot be
 enabled due to other already enabled event groups
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup is NULL
 \retval CUPTI_ERROR_HARDWARE_BUSY if another client is profiling
 and hardware is busy*/
    pub fn cuptiEventGroupEnable(eventGroup: CUpti_EventGroup) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Disable an event group.

 Disable an event group. Disabling an event group stops collection
 of events contained in the group.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_HARDWARE
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup is NULL*/
    pub fn cuptiEventGroupDisable(eventGroup: CUpti_EventGroup) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Read the value for an event in an event group.

 Read the value for an event in an event group. The event value is
 returned in the \p eventValueBuffer buffer. \p
 eventValueBufferSizeBytes indicates the size of the \p
 eventValueBuffer buffer. The buffer must be at least sizeof(uint64)
 if ::CUPTI_EVENT_GROUP_ATTR_PROFILE_ALL_DOMAIN_INSTANCES is not set
 on the group containing the event.  The buffer must be at least
 (sizeof(uint64) * number of domain instances) if
 ::CUPTI_EVENT_GROUP_ATTR_PROFILE_ALL_DOMAIN_INSTANCES is set on the
 group.

 If any instance of an event counter overflows, the value returned
 for that event instance will be ::CUPTI_EVENT_OVERFLOW.

 The only allowed value for \p flags is ::CUPTI_EVENT_READ_FLAG_NONE.

 Reading an event from a disabled event group is not allowed. After
 being read, an event's value is reset to zero.
 \note \b Thread-safety: this function is thread safe but client
 must guard against simultaneous destruction or modification of \p
 eventGroup (for example, client must guard against simultaneous
 calls to \ref cuptiEventGroupDestroy, \ref cuptiEventGroupAddEvent,
 etc.), and must guard against simultaneous destruction of the
 context in which \p eventGroup was created (for example, client
 must guard against simultaneous calls to cudaDeviceReset,
 cuCtxDestroy, etc.). If \ref cuptiEventGroupResetAllEvents is
 called simultaneously with this function, then returned event
 values are undefined.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group
 \param flags Flags controlling the reading mode
 \param event The event to read
 \param eventValueBufferSizeBytes The size of \p eventValueBuffer
 in bytes, and returns the number of bytes written to \p
 eventValueBuffer
 \param eventValueBuffer Returns the event value(s)

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_EVENT_ID
 \retval CUPTI_ERROR_HARDWARE
 \retval CUPTI_ERROR_INVALID_OPERATION if \p eventGroup is disabled
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup, \p
 eventValueBufferSizeBytes or \p eventValueBuffer is NULL
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT if size of \p eventValueBuffer
 is not sufficient*/
    pub fn cuptiEventGroupReadEvent(
        eventGroup: CUpti_EventGroup,
        flags: CUpti_ReadEventFlags,
        event: CUpti_EventID,
        eventValueBufferSizeBytes: *mut usize,
        eventValueBuffer: *mut u64,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Read the values for all the events in an event group.

 Read the values for all the events in an event group. The event
 values are returned in the \p eventValueBuffer buffer. \p
 eventValueBufferSizeBytes indicates the size of \p
 eventValueBuffer.  The buffer must be at least (sizeof(uint64) *
 number of events in group) if
 ::CUPTI_EVENT_GROUP_ATTR_PROFILE_ALL_DOMAIN_INSTANCES is not set on
 the group containing the events.  The buffer must be at least
 (sizeof(uint64) * number of domain instances * number of events in
 group) if ::CUPTI_EVENT_GROUP_ATTR_PROFILE_ALL_DOMAIN_INSTANCES is
 set on the group.

 The data format returned in \p eventValueBuffer is:
    - domain instance 0: event0 event1 ... eventN
    - domain instance 1: event0 event1 ... eventN
    - ...
    - domain instance M: event0 event1 ... eventN

 The event order in \p eventValueBuffer is returned in \p
 eventIdArray. The size of \p eventIdArray is specified in \p
 eventIdArraySizeBytes. The size should be at least
 (sizeof(CUpti_EventID) * number of events in group).

 If any instance of any event counter overflows, the value returned
 for that event instance will be ::CUPTI_EVENT_OVERFLOW.

 The only allowed value for \p flags is ::CUPTI_EVENT_READ_FLAG_NONE.

 Reading events from a disabled event group is not allowed. After
 being read, an event's value is reset to zero.
 \note \b Thread-safety: this function is thread safe but client
 must guard against simultaneous destruction or modification of \p
 eventGroup (for example, client must guard against simultaneous
 calls to \ref cuptiEventGroupDestroy, \ref cuptiEventGroupAddEvent,
 etc.), and must guard against simultaneous destruction of the
 context in which \p eventGroup was created (for example, client
 must guard against simultaneous calls to cudaDeviceReset,
 cuCtxDestroy, etc.). If \ref cuptiEventGroupResetAllEvents is
 called simultaneously with this function, then returned event
 values are undefined.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroup The event group
 \param flags Flags controlling the reading mode
 \param eventValueBufferSizeBytes The size of \p eventValueBuffer in
 bytes, and returns the number of bytes written to \p
 eventValueBuffer
 \param eventValueBuffer Returns the event values
 \param eventIdArraySizeBytes The size of \p eventIdArray in bytes,
 and returns the number of bytes written to \p eventIdArray
 \param eventIdArray Returns the IDs of the events in the same order
 as the values return in eventValueBuffer.
 \param numEventIdsRead Returns the number of event IDs returned
 in \p eventIdArray

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_HARDWARE
 \retval CUPTI_ERROR_INVALID_OPERATION if \p eventGroup is disabled
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroup, \p
 eventValueBufferSizeBytes, \p eventValueBuffer, \p
 eventIdArraySizeBytes, \p eventIdArray or \p numEventIdsRead is
 NULL
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT if size of \p eventValueBuffer
 or \p eventIdArray is not sufficient*/
    pub fn cuptiEventGroupReadAllEvents(
        eventGroup: CUpti_EventGroup,
        flags: CUpti_ReadEventFlags,
        eventValueBufferSizeBytes: *mut usize,
        eventValueBuffer: *mut u64,
        eventIdArraySizeBytes: *mut usize,
        eventIdArray: *mut CUpti_EventID,
        numEventIdsRead: *mut usize,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief For a set of events, get the grouping that indicates the
 number of passes and the event groups necessary to collect the
 events.

 The number of events that can be collected simultaneously varies by
 device and by the type of the events. When events can be collected
 simultaneously, they may need to be grouped into multiple event
 groups because they are from different event domains. This function
 takes a set of events and determines how many passes are required
 to collect all those events, and which events can be collected
 simultaneously in each pass.

 The CUpti_EventGroupSets returned in \p eventGroupPasses indicates
 how many passes are required to collect the events with the \p
 numSets field. Within each event group set, the \p sets array
 indicates the event groups that should be collected on each pass.
 \note \b Thread-safety: this function is thread safe, but client
 must guard against another thread simultaneously destroying \p
 context.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param context The context for event collection
 \param eventIdArraySizeBytes Size of \p eventIdArray in bytes
 \param eventIdArray Array of event IDs that need to be grouped
 \param eventGroupPasses Returns a CUpti_EventGroupSets object that
 indicates the number of passes required to collect the events and
 the events to collect on each pass

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_CONTEXT
 \retval CUPTI_ERROR_INVALID_EVENT_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventIdArray or
 \p eventGroupPasses is NULL*/
    pub fn cuptiEventGroupSetsCreate(
        context: CUcontext,
        eventIdArraySizeBytes: usize,
        eventIdArray: *mut CUpti_EventID,
        eventGroupPasses: *mut *mut CUpti_EventGroupSets,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Destroy a event group sets object.

 Destroy a CUpti_EventGroupSets object.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroupSets The object to destroy

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_OPERATION if any of the event groups
 contained in the sets is enabled
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroupSets is NULL*/
    pub fn cuptiEventGroupSetsDestroy(
        eventGroupSets: *mut CUpti_EventGroupSets,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Enable an event group set.

 Enable a set of event groups. Enabling a set of event groups zeros the value of
 all the events in all the groups and then starts collection of those events.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroupSet The pointer to the event group set

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_HARDWARE
 \retval CUPTI_ERROR_NOT_READY if \p eventGroup does not contain any events
 \retval CUPTI_ERROR_NOT_COMPATIBLE if \p eventGroup cannot be
 enabled due to other already enabled event groups
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroupSet is NULL
 \retval CUPTI_ERROR_HARDWARE_BUSY if other client is profiling and hardware is
 busy*/
    pub fn cuptiEventGroupSetEnable(
        eventGroupSet: *mut CUpti_EventGroupSet,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Disable an event group set.

 Disable a set of event groups. Disabling a set of event groups
 stops collection of events contained in the groups.
 \note \b Thread-safety: this function is thread safe.
 \note \b If this call fails, some of the event groups in the set may be disabled
 and other event groups may remain enabled.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param eventGroupSet The pointer to the event group set
 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_HARDWARE
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventGroupSet is NULL*/
    pub fn cuptiEventGroupSetDisable(
        eventGroupSet: *mut CUpti_EventGroupSet,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Enable kernel replay mode.

 Set profiling mode for the context to replay mode. In this mode,
 any number of events can be collected in one run of the kernel. The
 event collection mode will automatically switch to
 CUPTI_EVENT_COLLECTION_MODE_KERNEL.  In this mode, \ref
 cuptiSetEventCollectionMode will return
 CUPTI_ERROR_INVALID_OPERATION.
 \note \b Kernels might take longer to run if many events are enabled.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param context The context
 \retval CUPTI_SUCCESS*/
    pub fn cuptiEnableKernelReplayMode(context: CUcontext) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Disable kernel replay mode.

 Set profiling mode for the context to non-replay (default)
 mode. Event collection mode will be set to
 CUPTI_EVENT_COLLECTION_MODE_KERNEL.  All previously enabled
 event groups and event group sets will be disabled.
 \note \b Thread-safety: this function is thread safe.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param context The context
 \retval CUPTI_SUCCESS*/
    pub fn cuptiDisableKernelReplayMode(context: CUcontext) -> CUptiResult;
}
/** \brief Function type for getting updates on kernel replay.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param kernelName The mangled kernel name
 \param numReplaysDone Number of replays done so far
 \param customData Pointer of any custom data passed in when subscribing*/
pub type CUpti_KernelReplayUpdateFunc = ::std::option::Option<
    unsafe extern "C" fn(
        kernelName: *const ::std::os::raw::c_char,
        numReplaysDone: ::std::os::raw::c_int,
        customData: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    /** \brief Subscribe to kernel replay updates.

 When subscribed, the function pointer passed in will be called each time a
 kernel run is finished during kernel replay. Previously subscribed function
 pointer will be replaced. Pass in NULL as the function pointer unsubscribes
 the update.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param updateFunc The update function pointer
 \param customData Pointer to any custom data
 \retval CUPTI_SUCCESS*/
    pub fn cuptiKernelReplaySubscribeUpdate(
        updateFunc: CUpti_KernelReplayUpdateFunc,
        customData: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
/** \brief ID for a metric.

 A metric provides a measure of some aspect of the device.*/
pub type CUpti_MetricID = u32;
/// A memory related metric.
pub const CUPTI_METRIC_CATEGORY_MEMORY: CUpti_MetricCategory = 0;
/// An instruction related metric.
pub const CUPTI_METRIC_CATEGORY_INSTRUCTION: CUpti_MetricCategory = 1;
/// A multiprocessor related metric.
pub const CUPTI_METRIC_CATEGORY_MULTIPROCESSOR: CUpti_MetricCategory = 2;
/// A cache related metric.
pub const CUPTI_METRIC_CATEGORY_CACHE: CUpti_MetricCategory = 3;
/// A texture related metric.
pub const CUPTI_METRIC_CATEGORY_TEXTURE: CUpti_MetricCategory = 4;
///A Nvlink related metric.
pub const CUPTI_METRIC_CATEGORY_NVLINK: CUpti_MetricCategory = 5;
///A PCIe related metric.
pub const CUPTI_METRIC_CATEGORY_PCIE: CUpti_MetricCategory = 6;
///A PCIe related metric.
pub const CUPTI_METRIC_CATEGORY_FORCE_INT: CUpti_MetricCategory = 2147483647;
/** \brief A metric category.

 Each metric is assigned to a category that represents the general
 type of the metric. A metric's category is accessed using \ref
 cuptiMetricGetAttribute and the CUPTI_METRIC_ATTR_CATEGORY
 attribute.*/
pub type CUpti_MetricCategory = ::std::os::raw::c_uint;
/** If this bit is set, the metric can be profiled for each instance of the
 domain. The event values passed to \ref cuptiMetricGetValue can contain
 values for one instance of the domain. And \ref cuptiMetricGetValue can
 be called for each instance.*/
pub const CUPTI_METRIC_EVALUATION_MODE_PER_INSTANCE: CUpti_MetricEvaluationMode = 1;
/** If this bit is set, the metric can be profiled over all instances. The
 event values passed to \ref cuptiMetricGetValue can be aggregated values
 of events for all instances of the domain.*/
pub const CUPTI_METRIC_EVALUATION_MODE_AGGREGATE: CUpti_MetricEvaluationMode = 2;
/** If this bit is set, the metric can be profiled over all instances. The
 event values passed to \ref cuptiMetricGetValue can be aggregated values
 of events for all instances of the domain.*/
pub const CUPTI_METRIC_EVALUATION_MODE_FORCE_INT: CUpti_MetricEvaluationMode = 2147483647;
/** \brief A metric evaluation mode.

 A metric can be evaluated per hardware instance to know the load balancing
 across instances of a domain or the metric can be evaluated in aggregate mode
 when the events involved in metric evaluation are from different event
 domains. It might be possible to evaluate some metrics in both
 modes for convenience. A metric's evaluation mode is accessed using \ref
 CUpti_MetricEvaluationMode and the CUPTI_METRIC_ATTR_EVALUATION_MODE
 attribute.*/
pub type CUpti_MetricEvaluationMode = ::std::os::raw::c_uint;
/// The metric value is a 64-bit double.
pub const CUPTI_METRIC_VALUE_KIND_DOUBLE: CUpti_MetricValueKind = 0;
/// The metric value is a 64-bit unsigned integer.
pub const CUPTI_METRIC_VALUE_KIND_UINT64: CUpti_MetricValueKind = 1;
/** The metric value is a percentage represented by a 64-bit
 double. For example, 57.5% is represented by the value 57.5.*/
pub const CUPTI_METRIC_VALUE_KIND_PERCENT: CUpti_MetricValueKind = 2;
/** The metric value is a throughput represented by a 64-bit
 integer. The unit for throughput values is bytes/second.*/
pub const CUPTI_METRIC_VALUE_KIND_THROUGHPUT: CUpti_MetricValueKind = 3;
/// The metric value is a 64-bit signed integer.
pub const CUPTI_METRIC_VALUE_KIND_INT64: CUpti_MetricValueKind = 4;
/** The metric value is a utilization level, as represented by
 CUpti_MetricValueUtilizationLevel.*/
pub const CUPTI_METRIC_VALUE_KIND_UTILIZATION_LEVEL: CUpti_MetricValueKind = 5;
/** The metric value is a pointer to a NVTX extended payload.
 nvtxPayloadData_t is the structure that contains the payload data.*/
pub const CUPTI_METRIC_VALUE_KIND_NVTX_EXTENDED_PAYLOAD: CUpti_MetricValueKind = 6;
/** The metric value is a pointer to a NVTX extended payload.
 nvtxPayloadData_t is the structure that contains the payload data.*/
pub const CUPTI_METRIC_VALUE_KIND_FORCE_INT: CUpti_MetricValueKind = 2147483647;
/** \brief Kinds of metric values.

 Metric values can be one of several different kinds. Corresponding
 to each kind is a member of the CUpti_MetricValue union. The metric
 value returned by \ref cuptiMetricGetValue should be accessed using
 the appropriate member of that union based on its value kind.*/
pub type CUpti_MetricValueKind = ::std::os::raw::c_uint;
pub const CUPTI_METRIC_VALUE_UTILIZATION_IDLE: CUpti_MetricValueUtilizationLevel = 0;
pub const CUPTI_METRIC_VALUE_UTILIZATION_LOW: CUpti_MetricValueUtilizationLevel = 2;
pub const CUPTI_METRIC_VALUE_UTILIZATION_MID: CUpti_MetricValueUtilizationLevel = 5;
pub const CUPTI_METRIC_VALUE_UTILIZATION_HIGH: CUpti_MetricValueUtilizationLevel = 8;
pub const CUPTI_METRIC_VALUE_UTILIZATION_MAX: CUpti_MetricValueUtilizationLevel = 10;
pub const CUPTI_METRIC_VALUE_UTILIZATION_FORCE_INT: CUpti_MetricValueUtilizationLevel = 2147483647;
/** \brief Enumeration of utilization levels for metrics values of kind
 CUPTI_METRIC_VALUE_KIND_UTILIZATION_LEVEL. Utilization values can
 vary from IDLE (0) to MAX (10) but the enumeration only provides
 specific names for a few values.*/
pub type CUpti_MetricValueUtilizationLevel = ::std::os::raw::c_uint;
/// Metric name. Value is a null terminated const c-string.
pub const CUPTI_METRIC_ATTR_NAME: CUpti_MetricAttribute = 0;
/// Short description of metric. Value is a null terminated const c-string.
pub const CUPTI_METRIC_ATTR_SHORT_DESCRIPTION: CUpti_MetricAttribute = 1;
/// Long description of metric. Value is a null terminated const c-string.
pub const CUPTI_METRIC_ATTR_LONG_DESCRIPTION: CUpti_MetricAttribute = 2;
/// Category of the metric. Value is of type CUpti_MetricCategory.
pub const CUPTI_METRIC_ATTR_CATEGORY: CUpti_MetricAttribute = 3;
/// Value type of the metric. Value is of type CUpti_MetricValueKind.
pub const CUPTI_METRIC_ATTR_VALUE_KIND: CUpti_MetricAttribute = 4;
/// Metric evaluation mode. Value is of type CUpti_MetricEvaluationMode.
pub const CUPTI_METRIC_ATTR_EVALUATION_MODE: CUpti_MetricAttribute = 5;
/// Metric evaluation mode. Value is of type CUpti_MetricEvaluationMode.
pub const CUPTI_METRIC_ATTR_FORCE_INT: CUpti_MetricAttribute = 2147483647;
/** \brief Metric attributes.

 Metric attributes describe properties of a metric. These attributes
 can be read using \ref cuptiMetricGetAttribute.*/
pub type CUpti_MetricAttribute = ::std::os::raw::c_uint;
/** \brief A metric value.

 Metric values can be one of several different kinds. Corresponding
 to each kind is a member of the CUpti_MetricValue union. The metric
 value returned by \ref cuptiMetricGetValue should be accessed using
 the appropriate member of that union based on its value kind.*/
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUpti_MetricValue {
    pub metricValueDouble: f64,
    pub metricValueUint64: u64,
    pub metricValueInt64: i64,
    pub metricValuePercent: f64,
    pub metricValueThroughput: u64,
    pub metricValueUtilizationLevel: CUpti_MetricValueUtilizationLevel,
    /// Value for CUPTI_METRIC_VALUE_KIND_NVTX_EXTENDED_PAYLOAD.
    pub metricValueNvtxExtendedPayload: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUpti_MetricValue"][::std::mem::size_of::<CUpti_MetricValue>() - 8usize];
    [
        "Alignment of CUpti_MetricValue",
    ][::std::mem::align_of::<CUpti_MetricValue>() - 8usize];
    [
        "Offset of field: CUpti_MetricValue::metricValueDouble",
    ][::std::mem::offset_of!(CUpti_MetricValue, metricValueDouble) - 0usize];
    [
        "Offset of field: CUpti_MetricValue::metricValueUint64",
    ][::std::mem::offset_of!(CUpti_MetricValue, metricValueUint64) - 0usize];
    [
        "Offset of field: CUpti_MetricValue::metricValueInt64",
    ][::std::mem::offset_of!(CUpti_MetricValue, metricValueInt64) - 0usize];
    [
        "Offset of field: CUpti_MetricValue::metricValuePercent",
    ][::std::mem::offset_of!(CUpti_MetricValue, metricValuePercent) - 0usize];
    [
        "Offset of field: CUpti_MetricValue::metricValueThroughput",
    ][::std::mem::offset_of!(CUpti_MetricValue, metricValueThroughput) - 0usize];
    [
        "Offset of field: CUpti_MetricValue::metricValueUtilizationLevel",
    ][::std::mem::offset_of!(CUpti_MetricValue, metricValueUtilizationLevel) - 0usize];
    [
        "Offset of field: CUpti_MetricValue::metricValueNvtxExtendedPayload",
    ][::std::mem::offset_of!(CUpti_MetricValue, metricValueNvtxExtendedPayload)
        - 0usize];
};
impl Default for CUpti_MetricValue {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for CUpti_MetricValue {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "CUpti_MetricValue {{ union }}")
    }
}
pub const CUPTI_METRIC_PROPERTY_DEVICE_CLASS_TESLA: CUpti_MetricPropertyDeviceClass = 0;
pub const CUPTI_METRIC_PROPERTY_DEVICE_CLASS_QUADRO: CUpti_MetricPropertyDeviceClass = 1;
pub const CUPTI_METRIC_PROPERTY_DEVICE_CLASS_GEFORCE: CUpti_MetricPropertyDeviceClass = 2;
pub const CUPTI_METRIC_PROPERTY_DEVICE_CLASS_TEGRA: CUpti_MetricPropertyDeviceClass = 3;
/** \brief Device class.

 Enumeration of device classes for metric property
 CUPTI_METRIC_PROPERTY_DEVICE_CLASS.*/
pub type CUpti_MetricPropertyDeviceClass = ::std::os::raw::c_uint;
pub const CUPTI_METRIC_PROPERTY_MULTIPROCESSOR_COUNT: CUpti_MetricPropertyID = 0;
pub const CUPTI_METRIC_PROPERTY_WARPS_PER_MULTIPROCESSOR: CUpti_MetricPropertyID = 1;
pub const CUPTI_METRIC_PROPERTY_KERNEL_GPU_TIME: CUpti_MetricPropertyID = 2;
pub const CUPTI_METRIC_PROPERTY_CLOCK_RATE: CUpti_MetricPropertyID = 3;
pub const CUPTI_METRIC_PROPERTY_FRAME_BUFFER_COUNT: CUpti_MetricPropertyID = 4;
pub const CUPTI_METRIC_PROPERTY_GLOBAL_MEMORY_BANDWIDTH: CUpti_MetricPropertyID = 5;
pub const CUPTI_METRIC_PROPERTY_PCIE_LINK_RATE: CUpti_MetricPropertyID = 6;
pub const CUPTI_METRIC_PROPERTY_PCIE_LINK_WIDTH: CUpti_MetricPropertyID = 7;
pub const CUPTI_METRIC_PROPERTY_PCIE_GEN: CUpti_MetricPropertyID = 8;
pub const CUPTI_METRIC_PROPERTY_DEVICE_CLASS: CUpti_MetricPropertyID = 9;
pub const CUPTI_METRIC_PROPERTY_FLOP_SP_PER_CYCLE: CUpti_MetricPropertyID = 10;
pub const CUPTI_METRIC_PROPERTY_FLOP_DP_PER_CYCLE: CUpti_MetricPropertyID = 11;
pub const CUPTI_METRIC_PROPERTY_L2_UNITS: CUpti_MetricPropertyID = 12;
pub const CUPTI_METRIC_PROPERTY_ECC_ENABLED: CUpti_MetricPropertyID = 13;
pub const CUPTI_METRIC_PROPERTY_FLOP_HP_PER_CYCLE: CUpti_MetricPropertyID = 14;
pub const CUPTI_METRIC_PROPERTY_GPU_CPU_NVLINK_BANDWIDTH: CUpti_MetricPropertyID = 15;
/** \brief Metric device properties.

 Metric device properties describe device properties which are needed for a metric.
 Some of these properties can be collected using cuDeviceGetAttribute.*/
pub type CUpti_MetricPropertyID = ::std::os::raw::c_uint;
unsafe extern "C" {
    /** \brief Get the total number of metrics available on any device.

 Returns the total number of metrics available on any CUDA-capable
 devices.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param numMetrics Returns the number of metrics

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p numMetrics is NULL*/
    pub fn cuptiGetNumMetrics(numMetrics: *mut u32) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get all the metrics available on any device.

 Returns the metric IDs in \p metricArray for all CUDA-capable
 devices.  The size of the \p metricArray buffer is given by \p
 *arraySizeBytes. The size of the \p metricArray buffer must be at
 least \p numMetrics * sizeof(CUpti_MetricID) or all metric IDs will
 not be returned. The value returned in \p *arraySizeBytes contains
 the number of bytes returned in \p metricArray.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param arraySizeBytes The size of \p metricArray in bytes, and
 returns the number of bytes written to \p metricArray
 \param metricArray Returns the IDs of the metrics

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p arraySizeBytes or
 \p metricArray are NULL*/
    pub fn cuptiEnumMetrics(
        arraySizeBytes: *mut usize,
        metricArray: *mut CUpti_MetricID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the number of metrics for a device.

 Returns the number of metrics available for a device.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device The CUDA device
 \param numMetrics Returns the number of metrics available for the
 device

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_DEVICE
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p numMetrics is NULL*/
    pub fn cuptiDeviceGetNumMetrics(
        device: CUdevice,
        numMetrics: *mut u32,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the metrics for a device.

 Returns the metric IDs in \p metricArray for a device.  The size of
 the \p metricArray buffer is given by \p *arraySizeBytes. The size
 of the \p metricArray buffer must be at least \p numMetrics *
 sizeof(CUpti_MetricID) or else all metric IDs will not be
 returned. The value returned in \p *arraySizeBytes contains the
 number of bytes returned in \p metricArray.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device The CUDA device
 \param arraySizeBytes The size of \p metricArray in bytes, and
 returns the number of bytes written to \p metricArray
 \param metricArray Returns the IDs of the metrics for the device

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_DEVICE
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p arraySizeBytes or
 \p metricArray are NULL*/
    pub fn cuptiDeviceEnumMetrics(
        device: CUdevice,
        arraySizeBytes: *mut usize,
        metricArray: *mut CUpti_MetricID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get a metric attribute.

 Returns a metric attribute in \p *value. The size of the \p
 value buffer is given by \p *valueSize. The value returned in \p
 *valueSize contains the number of bytes returned in \p value.

 If the attribute value is a c-string that is longer than \p
 *valueSize, then only the first \p *valueSize characters will be
 returned and there will be no terminating null byte.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param metric ID of the metric
 \param attrib The metric attribute to read
 \param valueSize The size of the \p value buffer in bytes, and
 returns the number of bytes written to \p value
 \param value Returns the attribute's value

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_METRIC_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p valueSize or \p value
 is NULL, or if \p attrib is not a metric attribute
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT For non-c-string
 attribute values, indicates that the \p value buffer is too small
 to hold the attribute value.*/
    pub fn cuptiMetricGetAttribute(
        metric: CUpti_MetricID,
        attrib: CUpti_MetricAttribute,
        valueSize: *mut usize,
        value: *mut ::std::os::raw::c_void,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Find an metric by name.

 Find a metric by name and return the metric ID in \p *metric.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device The CUDA device
 \param metricName The name of metric to find
 \param metric Returns the ID of the found metric or undefined if
 unable to find the metric

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_DEVICE
 \retval CUPTI_ERROR_INVALID_METRIC_NAME if unable to find a metric
 with name \p metricName. In this case \p *metric is undefined
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p metricName or \p
 metric are NULL.*/
    pub fn cuptiMetricGetIdFromName(
        device: CUdevice,
        metricName: *const ::std::os::raw::c_char,
        metric: *mut CUpti_MetricID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get number of events required to calculate a metric.

 Returns the number of events in \p numEvents that are required to
 calculate a metric.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param metric ID of the metric
 \param numEvents Returns the number of events required for the metric

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_METRIC_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p numEvents is NULL*/
    pub fn cuptiMetricGetNumEvents(
        metric: CUpti_MetricID,
        numEvents: *mut u32,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the events required to calculating a metric.

 Gets the event IDs in \p eventIdArray required to calculate a \p
 metric. The size of the \p eventIdArray buffer is given by \p
 *eventIdArraySizeBytes and must be at least \p numEvents *
 sizeof(CUpti_EventID) or all events will not be returned. The value
 returned in \p *eventIdArraySizeBytes contains the number of bytes
 returned in \p eventIdArray.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param metric ID of the metric
 \param eventIdArraySizeBytes The size of \p eventIdArray in bytes,
 and returns the number of bytes written to \p eventIdArray
 \param eventIdArray Returns the IDs of the events required to
 calculate \p metric

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_METRIC_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p eventIdArraySizeBytes or \p
 eventIdArray are NULL.*/
    pub fn cuptiMetricEnumEvents(
        metric: CUpti_MetricID,
        eventIdArraySizeBytes: *mut usize,
        eventIdArray: *mut CUpti_EventID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get number of properties required to calculate a metric.

 Returns the number of properties in \p numProp that are required to
 calculate a metric.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param metric ID of the metric
 \param numProp Returns the number of properties required for the
 metric

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_METRIC_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p numProp is NULL*/
    pub fn cuptiMetricGetNumProperties(
        metric: CUpti_MetricID,
        numProp: *mut u32,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Get the properties required to calculating a metric.

 Gets the property IDs in \p propIdArray required to calculate a \p
 metric. The size of the \p propIdArray buffer is given by \p
 *propIdArraySizeBytes and must be at least \p numProp *
 sizeof(CUpti_DeviceAttribute) or all properties will not be
 returned. The value returned in \p *propIdArraySizeBytes contains
 the number of bytes returned in \p propIdArray.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param metric ID of the metric
 \param propIdArraySizeBytes The size of \p propIdArray in bytes,
 and returns the number of bytes written to \p propIdArray
 \param propIdArray Returns the IDs of the properties required to
 calculate \p metric

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_METRIC_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p propIdArraySizeBytes or \p
 propIdArray are NULL.*/
    pub fn cuptiMetricEnumProperties(
        metric: CUpti_MetricID,
        propIdArraySizeBytes: *mut usize,
        propIdArray: *mut CUpti_MetricPropertyID,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief For a metric get the groups of events that must be collected
 in the same pass.

 For a metric get the groups of events that must be collected in the
 same pass to ensure that the metric is calculated correctly. If the
 events are not collected as specified then the metric value may be
 inaccurate.

 The function returns NULL if a metric does not have any required
 event group. In this case the events needed for the metric can be
 grouped in any manner for collection.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param context The context for event collection
 \param metric The metric ID
 \param eventGroupSets Returns a CUpti_EventGroupSets object that
 indicates the events that must be collected in the same pass to
 ensure the metric is calculated correctly.  Returns NULL if no
 grouping is required for metric
 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_METRIC_ID*/
    pub fn cuptiMetricGetRequiredEventGroupSets(
        context: CUcontext,
        metric: CUpti_MetricID,
        eventGroupSets: *mut *mut CUpti_EventGroupSets,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief For a set of metrics, get the grouping that indicates the
 number of passes and the event groups necessary to collect the
 events required for those metrics.

 For a set of metrics, get the grouping that indicates the number of
 passes and the event groups necessary to collect the events
 required for those metrics.

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \see cuptiEventGroupSetsCreate for details on event group set
 creation.

 \param context The context for event collection
 \param metricIdArraySizeBytes Size of the metricIdArray in bytes
 \param metricIdArray Array of metric IDs
 \param eventGroupPasses Returns a CUpti_EventGroupSets object that
 indicates the number of passes required to collect the events and
 the events to collect on each pass

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_CONTEXT
 \retval CUPTI_ERROR_INVALID_METRIC_ID
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p metricIdArray or
 \p eventGroupPasses is NULL*/
    pub fn cuptiMetricCreateEventGroupSets(
        context: CUcontext,
        metricIdArraySizeBytes: usize,
        metricIdArray: *mut CUpti_MetricID,
        eventGroupPasses: *mut *mut CUpti_EventGroupSets,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Calculate the value for a metric.

 Use the events collected for a metric to calculate the metric
 value. Metric value evaluation depends on the evaluation mode
 \ref CUpti_MetricEvaluationMode that the metric supports.
 If a metric has evaluation mode as CUPTI_METRIC_EVALUATION_MODE_PER_INSTANCE,
 then it assumes that the input event value is for one domain instance.
 If a metric has evaluation mode as CUPTI_METRIC_EVALUATION_MODE_AGGREGATE,
 it assumes that input event values are
 normalized to represent all domain instances on a device. For the
 most accurate metric collection, the events required for the metric
 should be collected for all profiled domain instances. For example,
 to collect all instances of an event, set the
 CUPTI_EVENT_GROUP_ATTR_PROFILE_ALL_DOMAIN_INSTANCES attribute on
 the group containing the event to 1. The normalized value for the
 event is then: (\p sum_event_values * \p totalInstanceCount) / \p
 instanceCount, where \p sum_event_values is the summation of the
 event values across all profiled domain instances, \p
 totalInstanceCount is obtained from querying
 CUPTI_EVENT_DOMAIN_ATTR_TOTAL_INSTANCE_COUNT and \p instanceCount
 is obtained from querying CUPTI_EVENT_GROUP_ATTR_INSTANCE_COUNT (or
 CUPTI_EVENT_DOMAIN_ATTR_INSTANCE_COUNT).

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param device The CUDA device that the metric is being calculated for
 \param metric The metric ID
 \param eventIdArraySizeBytes The size of \p eventIdArray in bytes
 \param eventIdArray The event IDs required to calculate \p metric
 \param eventValueArraySizeBytes The size of \p eventValueArray in bytes
 \param eventValueArray The normalized event values required to
 calculate \p metric. The values must be order to match the order of
 events in \p eventIdArray
 \param timeDuration The duration over which the events were
 collected, in ns
 \param metricValue Returns the value for the metric

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_METRIC_ID
 \retval CUPTI_ERROR_INVALID_OPERATION
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT if the
 eventIdArray does not contain all the events needed for metric
 \retval CUPTI_ERROR_INVALID_EVENT_VALUE if any of the
 event values required for the metric is CUPTI_EVENT_OVERFLOW
 \retval CUPTI_ERROR_INVALID_METRIC_VALUE if the computed metric value
 cannot be represented in the metric's value type. For example,
 if the metric value type is unsigned and the computed metric value is negative
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p metricValue,
 \p eventIdArray or \p eventValueArray is NULL*/
    pub fn cuptiMetricGetValue(
        device: CUdevice,
        metric: CUpti_MetricID,
        eventIdArraySizeBytes: usize,
        eventIdArray: *mut CUpti_EventID,
        eventValueArraySizeBytes: usize,
        eventValueArray: *mut u64,
        timeDuration: u64,
        metricValue: *mut CUpti_MetricValue,
    ) -> CUptiResult;
}
unsafe extern "C" {
    /** \brief Calculate the value for a metric.

 Use the events and properties collected for a metric to calculate
 the metric value. Metric value evaluation depends on the evaluation
 mode \ref CUpti_MetricEvaluationMode that the metric supports.  If
 a metric has evaluation mode as
 CUPTI_METRIC_EVALUATION_MODE_PER_INSTANCE, then it assumes that the
 input event value is for one domain instance.  If a metric has
 evaluation mode as CUPTI_METRIC_EVALUATION_MODE_AGGREGATE, it
 assumes that input event values are normalized to represent all
 domain instances on a device. For the most accurate metric
 collection, the events required for the metric should be collected
 for all profiled domain instances. For example, to collect all
 instances of an event, set the
 CUPTI_EVENT_GROUP_ATTR_PROFILE_ALL_DOMAIN_INSTANCES attribute on
 the group containing the event to 1. The normalized value for the
 event is then: (\p sum_event_values * \p totalInstanceCount) / \p
 instanceCount, where \p sum_event_values is the summation of the
 event values across all profiled domain instances, \p
 totalInstanceCount is obtained from querying
 CUPTI_EVENT_DOMAIN_ATTR_TOTAL_INSTANCE_COUNT and \p instanceCount
 is obtained from querying CUPTI_EVENT_GROUP_ATTR_INSTANCE_COUNT (or
 CUPTI_EVENT_DOMAIN_ATTR_INSTANCE_COUNT).

 Starting with CUDA 13.0, this function is unsupported and should not be used. It always returns the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.

 \param metric The metric ID
 \param eventIdArraySizeBytes The size of \p eventIdArray in bytes
 \param eventIdArray The event IDs required to calculate \p metric
 \param eventValueArraySizeBytes The size of \p eventValueArray in bytes
 \param eventValueArray The normalized event values required to
 calculate \p metric. The values must be order to match the order of
 events in \p eventIdArray
 \param propIdArraySizeBytes The size of \p propIdArray in bytes
 \param propIdArray The metric property IDs required to calculate \p metric
 \param propValueArraySizeBytes The size of \p propValueArray in bytes
 \param propValueArray The metric property values required to
 calculate \p metric. The values must be order to match the order of
 metric properties in \p propIdArray
 \param metricValue Returns the value for the metric

 \retval CUPTI_SUCCESS
 \retval CUPTI_ERROR_NOT_INITIALIZED
 \retval CUPTI_ERROR_INVALID_METRIC_ID
 \retval CUPTI_ERROR_INVALID_OPERATION
 \retval CUPTI_ERROR_PARAMETER_SIZE_NOT_SUFFICIENT if the
 eventIdArray does not contain all the events needed for metric
 \retval CUPTI_ERROR_INVALID_EVENT_VALUE if any of the
 event values required for the metric is CUPTI_EVENT_OVERFLOW
 \retval CUPTI_ERROR_NOT_COMPATIBLE if the computed metric value
 cannot be represented in the metric's value type. For example,
 if the metric value type is unsigned and the computed metric value is negative
 \retval CUPTI_ERROR_INVALID_PARAMETER if \p metricValue,
 \p eventIdArray or \p eventValueArray is NULL*/
    pub fn cuptiMetricGetValue2(
        metric: CUpti_MetricID,
        eventIdArraySizeBytes: usize,
        eventIdArray: *mut CUpti_EventID,
        eventValueArraySizeBytes: usize,
        eventValueArray: *mut u64,
        propIdArraySizeBytes: usize,
        propIdArray: *mut CUpti_MetricPropertyID,
        propValueArraySizeBytes: usize,
        propValueArray: *mut u64,
        metricValue: *mut CUpti_MetricValue,
    ) -> CUptiResult;
}
/// The activity record is invalid.
pub const CUPTI_ACTIVITY_KIND_INVALID: CUpti_ActivityKind = 0;
/** A host<->host, host<->device, or device<->device memory copy.
 For peer to peer memory copy, use the kind CUPTI_ACTIVITY_KIND_MEMCPY2.
 The corresponding activity record structure is \ref
 CUpti_ActivityMemcpy6.*/
pub const CUPTI_ACTIVITY_KIND_MEMCPY: CUpti_ActivityKind = 1;
/** A memory set executing on the GPU. The corresponding activity
 record structure is \ref CUpti_ActivityMemset4.*/
pub const CUPTI_ACTIVITY_KIND_MEMSET: CUpti_ActivityKind = 2;
/** A kernel executing on the GPU. This activity kind may significantly change
 the overall performance characteristics of the application because all
 kernel executions are serialized on the GPU. Other activity kind for kernel
 CUPTI_ACTIVITY_KIND_CONCURRENT_KERNEL doesn't break kernel concurrency.
 The corresponding activity record structure is \ref CUpti_ActivityKernel10.*/
pub const CUPTI_ACTIVITY_KIND_KERNEL: CUpti_ActivityKind = 3;
/** A CUDA driver API function execution. The corresponding activity
 record structure is \ref CUpti_ActivityAPI.*/
pub const CUPTI_ACTIVITY_KIND_DRIVER: CUpti_ActivityKind = 4;
/** A CUDA runtime API function execution. The corresponding activity
 record structure is \ref CUpti_ActivityAPI.*/
pub const CUPTI_ACTIVITY_KIND_RUNTIME: CUpti_ActivityKind = 5;
/** A performance counter (aka event) value. The corresponding activity record
 structure is \ref CUpti_ActivityEvent. This activity cannot be directly
 enabled or disabled. Information collected using the Event API.
 can be stored in the corresponding activity record.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.*/
pub const CUPTI_ACTIVITY_KIND_EVENT: CUpti_ActivityKind = 6;
/** A performance metric value. The corresponding activity record structure is
 \ref CUpti_ActivityMetric. This activity cannot be directly
 enabled or disabled. Information collected using the Metric API.
 can be stored in the corresponding activity record.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.*/
pub const CUPTI_ACTIVITY_KIND_METRIC: CUpti_ActivityKind = 7;
/** Information about a CUDA device. The corresponding activity record
 structure is \ref CUpti_ActivityDevice5.*/
pub const CUPTI_ACTIVITY_KIND_DEVICE: CUpti_ActivityKind = 8;
/** Information about a CUDA context. The corresponding activity record
 structure is \ref CUpti_ActivityContext3.*/
pub const CUPTI_ACTIVITY_KIND_CONTEXT: CUpti_ActivityKind = 9;
/** A kernel executing on the GPU. This activity kind doesn't break
 kernel concurrency. The corresponding activity record structure
 is \ref CUpti_ActivityKernel10.*/
pub const CUPTI_ACTIVITY_KIND_CONCURRENT_KERNEL: CUpti_ActivityKind = 10;
/** Resource naming done via NVTX APIs for thread, device, context, etc.
 The corresponding activity record structure is \ref CUpti_ActivityName.*/
pub const CUPTI_ACTIVITY_KIND_NAME: CUpti_ActivityKind = 11;
/** Instantaneous, start, or end NVTX marker. The corresponding activity
 record structure is \ref CUpti_ActivityMarker2.*/
pub const CUPTI_ACTIVITY_KIND_MARKER: CUpti_ActivityKind = 12;
/** Extended, optional, data about a NVTX marker. User must enable
 CUPTI_ACTIVITY_KIND_MARKER as well to get records for marker data.
 The corresponding activity record structure is \ref CUpti_ActivityMarkerData2.*/
pub const CUPTI_ACTIVITY_KIND_MARKER_DATA: CUpti_ActivityKind = 13;
/** Source information about source level result. The corresponding
 activity record structure is \ref CUpti_ActivitySourceLocator.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.
 Enabling it will return the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.
 Instead, use the SASS Metric APIs from the cupti_sass_metrics.h header.*/
pub const CUPTI_ACTIVITY_KIND_SOURCE_LOCATOR: CUpti_ActivityKind = 14;
/** Results for source-level global access. The
 corresponding activity record structure is \ref
 CUpti_ActivityGlobalAccess3.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.
 Enabling it will return the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.
 Instead, use the SASS Metric APIs from the cupti_sass_metrics.h header.*/
pub const CUPTI_ACTIVITY_KIND_GLOBAL_ACCESS: CUpti_ActivityKind = 15;
/** Results for source-level branch. The corresponding
 activity record structure is \ref CUpti_ActivityBranch2.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.
 Enabling it will return the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.
 Instead, use the SASS Metric APIs from the cupti_sass_metrics.h header.*/
pub const CUPTI_ACTIVITY_KIND_BRANCH: CUpti_ActivityKind = 16;
/** Overhead added by CUPTI, Compiler, CUDA driver etc. The
 corresponding activity record structure is
 \ref CUpti_ActivityOverhead3.*/
pub const CUPTI_ACTIVITY_KIND_OVERHEAD: CUpti_ActivityKind = 17;
/** A CDP (CUDA Dynamic Parallel) kernel executing on the GPU. The
 corresponding activity record structure is \ref
 CUpti_ActivityCdpKernel. This activity cannot be directly
 enabled or disabled. It is enabled and disabled through
 concurrent kernel activity i.e. _CONCURRENT_KERNEL.*/
pub const CUPTI_ACTIVITY_KIND_CDP_KERNEL: CUpti_ActivityKind = 18;
/** Preemption activity record indicating a preemption of a CDP (CUDA
 Dynamic Parallel) kernel executing on the GPU. The corresponding
 activity record structure is \ref CUpti_ActivityPreemption.*/
pub const CUPTI_ACTIVITY_KIND_PREEMPTION: CUpti_ActivityKind = 19;
/** Environment activity records indicating power, clock, thermal,
 etc. levels of the GPU. The corresponding activity record
 structure is \ref CUpti_ActivityEnvironment.*/
pub const CUPTI_ACTIVITY_KIND_ENVIRONMENT: CUpti_ActivityKind = 20;
/** An performance counter value associated with a specific event domain
 instance. The corresponding activity record structure is \ref
 CUpti_ActivityEventInstance. This activity cannot be directly
 enabled or disabled. Information collected using the Event API.
 can be stored in the corresponding activity record.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.*/
pub const CUPTI_ACTIVITY_KIND_EVENT_INSTANCE: CUpti_ActivityKind = 21;
/** A peer to peer memory copy. The corresponding activity record
 structure is \ref CUpti_ActivityMemcpyPtoP4.*/
pub const CUPTI_ACTIVITY_KIND_MEMCPY2: CUpti_ActivityKind = 22;
/** A performance metric value associated with a specific metric domain
 instance. The corresponding activity record structure is \ref
 CUpti_ActivityMetricInstance. This activity cannot be directly
 enabled or disabled. Information collected using the Metric API.
 can be stored in the corresponding activity record.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.*/
pub const CUPTI_ACTIVITY_KIND_METRIC_INSTANCE: CUpti_ActivityKind = 23;
/** Results for source-level instruction execution.
 The corresponding activity record structure is \ref
 CUpti_ActivityInstructionExecution.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.
 Enabling it will return the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.
 Instead, use the SASS Metric APIs from the cupti_sass_metrics.h header.*/
pub const CUPTI_ACTIVITY_KIND_INSTRUCTION_EXECUTION: CUpti_ActivityKind = 24;
/** Unified Memory counter record. The corresponding activity
 record structure is \ref CUpti_ActivityUnifiedMemoryCounter3.*/
pub const CUPTI_ACTIVITY_KIND_UNIFIED_MEMORY_COUNTER: CUpti_ActivityKind = 25;
/** Device global/function record. The corresponding activity
 record structure is \ref CUpti_ActivityFunction.*/
pub const CUPTI_ACTIVITY_KIND_FUNCTION: CUpti_ActivityKind = 26;
/** CUDA Module record. The corresponding activity
 record structure is \ref CUpti_ActivityModule.
 This activity cannot be directly enabled or disabled.
 Information collected using the module callback can be
 be stored in the corresponding activity record.*/
pub const CUPTI_ACTIVITY_KIND_MODULE: CUpti_ActivityKind = 27;
/** A device attribute value. The corresponding activity record
 structure is \ref CUpti_ActivityDeviceAttribute.
 This activity cannot be directly enabled or disabled.
 Information collected using attributes CUpti_DeviceAttribute
 or CUdevice_attribute can be stored in the corresponding activity record.*/
pub const CUPTI_ACTIVITY_KIND_DEVICE_ATTRIBUTE: CUpti_ActivityKind = 28;
/** Results for source-level shared access. The
 corresponding activity record structure is \ref
 CUpti_ActivitySharedAccess.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.
 Enabling it will return the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.
 Instead, use the SASS Metric APIs from the cupti_sass_metrics.h header.*/
pub const CUPTI_ACTIVITY_KIND_SHARED_ACCESS: CUpti_ActivityKind = 29;
/** PC sampling information for kernels. This will serialize
 kernels. The corresponding activity record structure
 is \ref CUpti_ActivityPCSampling3.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.
 Enabling it will return the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.
 Instead, use the PC Sampling API from the cupti_pcsampling.h header, which
 allows concurrent kernel execution.*/
pub const CUPTI_ACTIVITY_KIND_PC_SAMPLING: CUpti_ActivityKind = 30;
/** Summary information about PC sampling records. The
 corresponding activity record structure is \ref
 CUpti_ActivityPCSamplingRecordInfo.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.
 Enabling it will return the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.
 Instead, use the PC Sampling API from the cupti_pcsampling.h header.*/
pub const CUPTI_ACTIVITY_KIND_PC_SAMPLING_RECORD_INFO: CUpti_ActivityKind = 31;
/** SASS/Source line-by-line correlation record.
 This will generate sass/source correlation for functions that have source
 level analysis or pc sampling results. The records will be generated only
 when either of source level analysis or pc sampling activity is enabled.
 The corresponding activity record structure is \ref
 CUpti_ActivityInstructionCorrelation.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.
 Enabling it will return the error code CUPTI_ERROR_LEGACY_PROFILER_NOT_SUPPORTED.
 Instead, use the SASS Metric APIs from the cupti_sass_metrics.h header.*/
pub const CUPTI_ACTIVITY_KIND_INSTRUCTION_CORRELATION: CUpti_ActivityKind = 32;
/** OpenACC data events.
 The corresponding activity record structure is \ref
 CUpti_ActivityOpenAccData.*/
pub const CUPTI_ACTIVITY_KIND_OPENACC_DATA: CUpti_ActivityKind = 33;
/** OpenACC launch events.
 The corresponding activity record structure is \ref
 CUpti_ActivityOpenAccLaunch.*/
pub const CUPTI_ACTIVITY_KIND_OPENACC_LAUNCH: CUpti_ActivityKind = 34;
/** OpenACC other events.
 The corresponding activity record structure is \ref
 CUpti_ActivityOpenAccOther.*/
pub const CUPTI_ACTIVITY_KIND_OPENACC_OTHER: CUpti_ActivityKind = 35;
/** Information about a CUDA event (cudaEvent).
 The corresponding activity record structure is \ref
 CUpti_ActivityCudaEvent2.*/
pub const CUPTI_ACTIVITY_KIND_CUDA_EVENT: CUpti_ActivityKind = 36;
/** Information about a CUDA stream. The
 corresponding activity record structure is \ref
 CUpti_ActivityStream.*/
pub const CUPTI_ACTIVITY_KIND_STREAM: CUpti_ActivityKind = 37;
/** Records for CUDA synchronization primitives. The
 corresponding activity record structure is \ref
 CUpti_ActivitySynchronization2.*/
pub const CUPTI_ACTIVITY_KIND_SYNCHRONIZATION: CUpti_ActivityKind = 38;
/** Records for correlation of different programming APIs. The
 corresponding activity record structure is \ref
 CUpti_ActivityExternalCorrelation.*/
pub const CUPTI_ACTIVITY_KIND_EXTERNAL_CORRELATION: CUpti_ActivityKind = 39;
/** NVLink topology information.
 The corresponding activity record structure is \ref
 CUpti_ActivityNvLink4.*/
pub const CUPTI_ACTIVITY_KIND_NVLINK: CUpti_ActivityKind = 40;
/** Instantaneous Event information.
 The corresponding activity record structure is \ref
 CUpti_ActivityInstantaneousEvent.
 This activity can not be directly enabled or disabled.
 Information collected using the Event API can be stored
 in the corresponding activity record.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.*/
pub const CUPTI_ACTIVITY_KIND_INSTANTANEOUS_EVENT: CUpti_ActivityKind = 41;
/** Instantaneous Event information for a specific event
 domain instance.
 The corresponding activity record structure is \ref
 CUpti_ActivityInstantaneousEventInstance.
 This activity can not be directly enabled or disabled.
 Information collected using the Event API can be stored
 in the corresponding activity record.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.*/
pub const CUPTI_ACTIVITY_KIND_INSTANTANEOUS_EVENT_INSTANCE: CUpti_ActivityKind = 42;
/** Instantaneous Metric information
 The corresponding activity record structure is \ref
 CUpti_ActivityInstantaneousMetric.
 This activity cannot be directly enabled or disabled.
 Information collected using the Metric API can be stored
 in the corresponding activity record.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.*/
pub const CUPTI_ACTIVITY_KIND_INSTANTANEOUS_METRIC: CUpti_ActivityKind = 43;
/** Instantaneous Metric information for a specific metric
 domain instance.
 The corresponding activity record structure is \ref
 CUpti_ActivityInstantaneousMetricInstance.
 This activity cannot be directly enabled or disabled.
 Information collected using the Metric API can be stored
 in the corresponding activity record.
 Starting with the CUDA 13.0 release, this enum is unsupported and should no longer be used.*/
pub const CUPTI_ACTIVITY_KIND_INSTANTANEOUS_METRIC_INSTANCE: CUpti_ActivityKind = 44;
/** Memory activity tracking allocation and freeing of the memory
 The corresponding activity record structure is \ref
 CUpti_ActivityMemory.*/
pub const CUPTI_ACTIVITY_KIND_MEMORY: CUpti_ActivityKind = 45;
/** PCI devices information used for PCI topology.
 The corresponding activity record structure is \ref
 CUpti_ActivityPcie.*/
pub const CUPTI_ACTIVITY_KIND_PCIE: CUpti_ActivityKind = 46;
/** OpenMP parallel events.
 The corresponding activity record structure is \ref
 CUpti_ActivityOpenMp.*/
pub const CUPTI_ACTIVITY_KIND_OPENMP: CUpti_ActivityKind = 47;
/** A CUDA driver kernel launch occurring outside of any
 public API function execution. Tools can handle these
 like records for driver API launch functions, although
 the cbid field is not used here.
 The corresponding activity record structure is \ref
 CUpti_ActivityAPI.*/
pub const CUPTI_ACTIVITY_KIND_INTERNAL_LAUNCH_API: CUpti_ActivityKind = 48;
/** Memory activity tracking allocation and freeing of the memory
 The corresponding activity record structure is \ref
 CUpti_ActivityMemory4.*/
pub const CUPTI_ACTIVITY_KIND_MEMORY2: CUpti_ActivityKind = 49;
/** Memory pool activity tracking creation, destruction and
 trimming of the memory pool.
 The corresponding activity record structure is \ref
 CUpti_ActivityMemoryPool3.*/
pub const CUPTI_ACTIVITY_KIND_MEMORY_POOL: CUpti_ActivityKind = 50;
/** Activity record for graph-level information.
 The corresponding activity record structure is
 \ref CUpti_ActivityGraphTrace2.*/
pub const CUPTI_ACTIVITY_KIND_GRAPH_TRACE: CUpti_ActivityKind = 51;
/** JIT (Just-in-time) operation tracking.
 The corresponding activity record structure is \ref
 CUpti_ActivityJit.*/
pub const CUPTI_ACTIVITY_KIND_JIT: CUpti_ActivityKind = 52;
/** This activity can not be directly enabled or disabled.
 It is enabled when CUPTI_ACTIVITY_KIND_GRAPH_TRACE is enabled
 and device graph trace is enabled through API cuptiActivityEnableDeviceGraph().
 The corresponding activity record structure is
 \ref CUpti_ActivityDeviceGraphTrace.*/
pub const CUPTI_ACTIVITY_KIND_DEVICE_GRAPH_TRACE: CUpti_ActivityKind = 53;
/** Tracing batches of copies that are to be decompressed.
 The corresponding activity record structure is \ref
 CUpti_ActivityMemDecompress.*/
pub const CUPTI_ACTIVITY_KIND_MEM_DECOMPRESS: CUpti_ActivityKind = 54;
/** Tracing new overheads introduced on some hardware due when
 confidential computing is enabled.
 The corresponding activity record structure is \ref
 CUpti_ActivityConfidentialComputeRotation.*/
pub const CUPTI_ACTIVITY_KIND_CONFIDENTIAL_COMPUTE_ROTATION: CUpti_ActivityKind = 55;
/// Count of supported activity kinds.
pub const CUPTI_ACTIVITY_KIND_COUNT: CUpti_ActivityKind = 56;
/// Count of supported activity kinds.
pub const CUPTI_ACTIVITY_KIND_FORCE_INT: CUpti_ActivityKind = 2147483647;
/** \brief The kinds of activity records.

 Each activity record kind represents information about a GPU or an
 activity occurring on a CPU or GPU. Each kind is associated with a
 activity record structure that holds the information associated
 with the kind.
 \see CUpti_Activity
 \see CUpti_ActivityAPI
 \see CUpti_ActivityContext
 \see CUpti_ActivityContext2
 \see CUpti_ActivityContext3
 \see CUpti_ActivityDevice
 \see CUpti_ActivityDevice2
 \see CUpti_ActivityDevice3
 \see CUpti_ActivityDevice4
 \see CUpti_ActivityDevice5
 \see CUpti_ActivityDeviceAttribute
 \see CUpti_ActivityEvent
 \see CUpti_ActivityEventInstance
 \see CUpti_ActivityKernel
 \see CUpti_ActivityKernel2
 \see CUpti_ActivityKernel3
 \see CUpti_ActivityKernel4
 \see CUpti_ActivityKernel5
 \see CUpti_ActivityKernel6
 \see CUpti_ActivityKernel7
 \see CUpti_ActivityKernel8
 \see CUpti_ActivityKernel9
 \see CUpti_ActivityKernel10
 \see CUpti_ActivityCdpKernel
 \see CUpti_ActivityPreemption
 \see CUpti_ActivityMemcpy
 \see CUpti_ActivityMemcpy3
 \see CUpti_ActivityMemcpy4
 \see CUpti_ActivityMemcpy5
 \see CUpti_ActivityMemcpy6
 \see CUpti_ActivityMemcpyPtoP
 \see CUpti_ActivityMemcpyPtoP2
 \see CUpti_ActivityMemcpyPtoP3
 \see CUpti_ActivityMemcpyPtoP4
 \see CUpti_ActivityMemset
 \see CUpti_ActivityMemset2
 \see CUpti_ActivityMemset3
 \see CUpti_ActivityMemset4
 \see CUpti_ActivityMemory
 \see CUpti_ActivityMemory2
 \see CUpti_ActivityMemory3
 \see CUpti_ActivityMemory4
 \see CUpti_ActivityMemoryPool
 \see CUpti_ActivityMemoryPool2
 \see CUpti_ActivityMemoryPool3
 \see CUpti_ActivityMetric
 \see CUpti_ActivityMetricInstance
 \see CUpti_ActivityName
 \see CUpti_ActivityMarker
 \see CUpti_ActivityMarker2
 \see CUpti_ActivityMarkerData
 \see CUpti_ActivitySourceLocator
 \see CUpti_ActivityGlobalAccess
 \see CUpti_ActivityGlobalAccess2
 \see CUpti_ActivityGlobalAccess3
 \see CUpti_ActivityBranch
 \see CUpti_ActivityBranch2
 \see CUpti_ActivityOverhead3
 \see CUpti_ActivityEnvironment
 \see CUpti_ActivityInstructionExecution
 \see CUpti_ActivityUnifiedMemoryCounter
 \see CUpti_ActivityFunction
 \see CUpti_ActivityModule
 \see CUpti_ActivitySharedAccess
 \see CUpti_ActivityPCSampling
 \see CUpti_ActivityPCSampling2
 \see CUpti_ActivityPCSampling3
 \see CUpti_ActivityPCSamplingRecordInfo
 \see CUpti_ActivityCudaEvent2
 \see CUpti_ActivityStream
 \see CUpti_ActivitySynchronization2
 \see CUpti_ActivityInstructionCorrelation
 \see CUpti_ActivityExternalCorrelation
 \see CUpti_ActivityUnifiedMemoryCounter3
 \see CUpti_ActivityOpenAccData
 \see CUpti_ActivityOpenAccLaunch
 \see CUpti_ActivityOpenAccOther
 \see CUpti_ActivityOpenMp
 \see CUpti_ActivityNvLink
 \see CUpti_ActivityNvLink2
 \see CUpti_ActivityNvLink3
 \see CUpti_ActivityNvLink4
 \see CUpti_ActivityPcie
 \see CUpti_ActivityConfidentialComputeRotation*/
pub type CUpti_ActivityKind = ::std::os::raw::c_uint;
/// The object kind is not known.
pub const CUPTI_ACTIVITY_OBJECT_UNKNOWN: CUpti_ActivityObjectKind = 0;
/// A process.
pub const CUPTI_ACTIVITY_OBJECT_PROCESS: CUpti_ActivityObjectKind = 1;
/// A thread.
pub const CUPTI_ACTIVITY_OBJECT_THREAD: CUpti_ActivityObjectKind = 2;
/// A device.
pub const CUPTI_ACTIVITY_OBJECT_DEVICE: CUpti_ActivityObjectKind = 3;
/// A context.
pub const CUPTI_ACTIVITY_OBJECT_CONTEXT: CUpti_ActivityObjectKind = 4;
/// A stream.
pub const CUPTI_ACTIVITY_OBJECT_STREAM: CUpti_ActivityObjectKind = 5;
/// A stream.
pub const CUPTI_ACTIVITY_OBJECT_FORCE_INT: CUpti_ActivityObjectKind = 2147483647;
/** \brief The kinds of activity objects.
 \see CUpti_ActivityObjectKindId*/
pub type CUpti_ActivityObjectKind = ::std::os::raw::c_uint;
/** \brief Identifiers for object kinds as specified by
 CUpti_ActivityObjectKind.
 \see CUpti_ActivityObjectKind*/
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUpti_ActivityObjectKindId {
    pub pt: CUpti_ActivityObjectKindId__bindgen_ty_1,
    pub dcs: CUpti_ActivityObjectKindId__bindgen_ty_2,
}
/** A process object requires that we identify the process ID. A
 thread object requires that we identify both the process and
 thread ID.*/
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CUpti_ActivityObjectKindId__bindgen_ty_1 {
    pub processId: u32,
    pub threadId: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityObjectKindId__bindgen_ty_1",
    ][::std::mem::size_of::<CUpti_ActivityObjectKindId__bindgen_ty_1>() - 8usize];
    [
        "Alignment of CUpti_ActivityObjectKindId__bindgen_ty_1",
    ][::std::mem::align_of::<CUpti_ActivityObjectKindId__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: CUpti_ActivityObjectKindId__bindgen_ty_1::processId",
    ][::std::mem::offset_of!(CUpti_ActivityObjectKindId__bindgen_ty_1, processId)
        - 0usize];
    [
        "Offset of field: CUpti_ActivityObjectKindId__bindgen_ty_1::threadId",
    ][::std::mem::offset_of!(CUpti_ActivityObjectKindId__bindgen_ty_1, threadId)
        - 4usize];
};
/** A device object requires that we identify the device ID. A
 context object requires that we identify both the device and
 context ID. A stream object requires that we identify device,
 context, and stream ID.*/
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CUpti_ActivityObjectKindId__bindgen_ty_2 {
    pub deviceId: u32,
    pub contextId: u32,
    pub streamId: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityObjectKindId__bindgen_ty_2",
    ][::std::mem::size_of::<CUpti_ActivityObjectKindId__bindgen_ty_2>() - 12usize];
    [
        "Alignment of CUpti_ActivityObjectKindId__bindgen_ty_2",
    ][::std::mem::align_of::<CUpti_ActivityObjectKindId__bindgen_ty_2>() - 4usize];
    [
        "Offset of field: CUpti_ActivityObjectKindId__bindgen_ty_2::deviceId",
    ][::std::mem::offset_of!(CUpti_ActivityObjectKindId__bindgen_ty_2, deviceId)
        - 0usize];
    [
        "Offset of field: CUpti_ActivityObjectKindId__bindgen_ty_2::contextId",
    ][::std::mem::offset_of!(CUpti_ActivityObjectKindId__bindgen_ty_2, contextId)
        - 4usize];
    [
        "Offset of field: CUpti_ActivityObjectKindId__bindgen_ty_2::streamId",
    ][::std::mem::offset_of!(CUpti_ActivityObjectKindId__bindgen_ty_2, streamId)
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityObjectKindId",
    ][::std::mem::size_of::<CUpti_ActivityObjectKindId>() - 12usize];
    [
        "Alignment of CUpti_ActivityObjectKindId",
    ][::std::mem::align_of::<CUpti_ActivityObjectKindId>() - 4usize];
    [
        "Offset of field: CUpti_ActivityObjectKindId::pt",
    ][::std::mem::offset_of!(CUpti_ActivityObjectKindId, pt) - 0usize];
    [
        "Offset of field: CUpti_ActivityObjectKindId::dcs",
    ][::std::mem::offset_of!(CUpti_ActivityObjectKindId, dcs) - 0usize];
};
impl Default for CUpti_ActivityObjectKindId {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for CUpti_ActivityObjectKindId {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "CUpti_ActivityObjectKindId {{ union }}")
    }
}
/// \brief The structure to provide additional data for CUPTI_ACTIVITY_OVERHEAD_COMMAND_BUFFER_FULL.
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CUpti_ActivityOverheadCommandBufferFullData {
    /** The remaining space in the command buffer. This field will always be zero
 when the command buffer is full, making it not useful in such cases.
*/
    pub commandBufferLength: u32,
    /** The channel ID of the command buffer.
*/
    pub channelID: u32,
    /** The channel type of the command buffer.
*/
    pub channelType: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityOverheadCommandBufferFullData",
    ][::std::mem::size_of::<CUpti_ActivityOverheadCommandBufferFullData>() - 12usize];
    [
        "Alignment of CUpti_ActivityOverheadCommandBufferFullData",
    ][::std::mem::align_of::<CUpti_ActivityOverheadCommandBufferFullData>() - 4usize];
    [
        "Offset of field: CUpti_ActivityOverheadCommandBufferFullData::commandBufferLength",
    ][::std::mem::offset_of!(
        CUpti_ActivityOverheadCommandBufferFullData, commandBufferLength
    ) - 0usize];
    [
        "Offset of field: CUpti_ActivityOverheadCommandBufferFullData::channelID",
    ][::std::mem::offset_of!(CUpti_ActivityOverheadCommandBufferFullData, channelID)
        - 4usize];
    [
        "Offset of field: CUpti_ActivityOverheadCommandBufferFullData::channelType",
    ][::std::mem::offset_of!(CUpti_ActivityOverheadCommandBufferFullData, channelType)
        - 8usize];
};
/// The overhead kind is not known.
pub const CUPTI_ACTIVITY_OVERHEAD_UNKNOWN: CUpti_ActivityOverheadKind = 0;
/// Compiler overhead.
pub const CUPTI_ACTIVITY_OVERHEAD_DRIVER_COMPILER: CUpti_ActivityOverheadKind = 1;
/// Activity buffer flush overhead.
pub const CUPTI_ACTIVITY_OVERHEAD_CUPTI_BUFFER_FLUSH: CUpti_ActivityOverheadKind = 65536;
/// CUPTI instrumentation overhead.
pub const CUPTI_ACTIVITY_OVERHEAD_CUPTI_INSTRUMENTATION: CUpti_ActivityOverheadKind = 131072;
/// CUPTI resource creation and destruction overhead.
pub const CUPTI_ACTIVITY_OVERHEAD_CUPTI_RESOURCE: CUpti_ActivityOverheadKind = 196608;
/// CUDA Runtime triggered module loading overhead.
pub const CUPTI_ACTIVITY_OVERHEAD_RUNTIME_TRIGGERED_MODULE_LOADING: CUpti_ActivityOverheadKind = 262144;
/// Lazy function loading overhead.
pub const CUPTI_ACTIVITY_OVERHEAD_LAZY_FUNCTION_LOADING: CUpti_ActivityOverheadKind = 327680;
/** Overhead due to lack of command buffer space.
 Refer CUpti_ActivityOverheadCommandBufferFullData for more details.*/
pub const CUPTI_ACTIVITY_OVERHEAD_COMMAND_BUFFER_FULL: CUpti_ActivityOverheadKind = 393216;
/// Overhead due to activity buffer request.
pub const CUPTI_ACTIVITY_OVERHEAD_ACTIVITY_BUFFER_REQUEST: CUpti_ActivityOverheadKind = 458752;
/// Overhead due to UVM activity initialization.
pub const CUPTI_ACTIVITY_OVERHEAD_UVM_ACTIVITY_INIT: CUpti_ActivityOverheadKind = 524288;
/// Overhead due to UVM activity initialization.
pub const CUPTI_ACTIVITY_OVERHEAD_FORCE_INT: CUpti_ActivityOverheadKind = 2147483647;
/// \brief The kinds of activity overhead.
pub type CUpti_ActivityOverheadKind = ::std::os::raw::c_uint;
/// The compute API is not known.
pub const CUPTI_ACTIVITY_COMPUTE_API_UNKNOWN: CUpti_ActivityComputeApiKind = 0;
/// The compute APIs are for CUDA.
pub const CUPTI_ACTIVITY_COMPUTE_API_CUDA: CUpti_ActivityComputeApiKind = 1;
/** The compute APIs are for CUDA running
 in MPS (Multi-Process Service) environment.*/
pub const CUPTI_ACTIVITY_COMPUTE_API_CUDA_MPS: CUpti_ActivityComputeApiKind = 2;
/** The compute APIs are for CUDA running
 in MPS (Multi-Process Service) environment.*/
pub const CUPTI_ACTIVITY_COMPUTE_API_FORCE_INT: CUpti_ActivityComputeApiKind = 2147483647;
/// \brief The kind of a compute API.
pub type CUpti_ActivityComputeApiKind = ::std::os::raw::c_uint;
/// Indicates the activity record has no flags.
pub const CUPTI_ACTIVITY_FLAG_NONE: CUpti_ActivityFlag = 0;
/** Indicates the activity represents a device that supports
 concurrent kernel execution. Valid for
 CUPTI_ACTIVITY_KIND_DEVICE.*/
pub const CUPTI_ACTIVITY_FLAG_DEVICE_CONCURRENT_KERNELS: CUpti_ActivityFlag = 1;
/** Indicates if the activity represents a CUdevice_attribute value
 or a CUpti_DeviceAttribute value. Valid for
 CUPTI_ACTIVITY_KIND_DEVICE_ATTRIBUTE.*/
pub const CUPTI_ACTIVITY_FLAG_DEVICE_ATTRIBUTE_CUDEVICE: CUpti_ActivityFlag = 1;
/** Indicates the activity represents an asynchronous memcpy
 operation. Valid for CUPTI_ACTIVITY_KIND_MEMCPY.*/
pub const CUPTI_ACTIVITY_FLAG_MEMCPY_ASYNC: CUpti_ActivityFlag = 1;
/** Indicates the activity represents an instantaneous marker. Valid
 for CUPTI_ACTIVITY_KIND_MARKER.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_INSTANTANEOUS: CUpti_ActivityFlag = 1;
/** Indicates the activity represents a region start marker. Valid
 for CUPTI_ACTIVITY_KIND_MARKER.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_START: CUpti_ActivityFlag = 2;
/** Indicates the activity represents a region end marker. Valid for
 CUPTI_ACTIVITY_KIND_MARKER.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_END: CUpti_ActivityFlag = 4;
/** Indicates the activity represents an attempt to acquire a user
 defined synchronization object.
 Valid for CUPTI_ACTIVITY_KIND_MARKER.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_SYNC_ACQUIRE: CUpti_ActivityFlag = 8;
/** Indicates the activity represents success in acquiring the
 user defined synchronization object.
 Valid for CUPTI_ACTIVITY_KIND_MARKER.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_SYNC_ACQUIRE_SUCCESS: CUpti_ActivityFlag = 16;
/** Indicates the activity represents failure in acquiring the
 user defined synchronization object.
 Valid for CUPTI_ACTIVITY_KIND_MARKER.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_SYNC_ACQUIRE_FAILED: CUpti_ActivityFlag = 32;
/** Indicates the activity represents releasing a reservation on
 user defined synchronization object.
 Valid for CUPTI_ACTIVITY_KIND_MARKER.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_SYNC_RELEASE: CUpti_ActivityFlag = 64;
/** Indicates the activity represents a marker that does not specify
 a color. Valid for CUPTI_ACTIVITY_KIND_MARKER_DATA.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_COLOR_NONE: CUpti_ActivityFlag = 1;
/** Indicates the activity represents a marker that specifies a color
 in alpha-red-green-blue format. Valid for
 CUPTI_ACTIVITY_KIND_MARKER_DATA.*/
pub const CUPTI_ACTIVITY_FLAG_MARKER_COLOR_ARGB: CUpti_ActivityFlag = 2;
/** The number of bytes requested by each thread
 Valid for CUpti_ActivityGlobalAccess3.*/
pub const CUPTI_ACTIVITY_FLAG_GLOBAL_ACCESS_KIND_SIZE_MASK: CUpti_ActivityFlag = 255;
/** If bit in this flag is set, the access was load, else it is a
 store access. Valid for CUpti_ActivityGlobalAccess3.*/
pub const CUPTI_ACTIVITY_FLAG_GLOBAL_ACCESS_KIND_LOAD: CUpti_ActivityFlag = 256;
/** If this bit in flag is set, the load access was cached else it is
 uncached. Valid for CUpti_ActivityGlobalAccess3.*/
pub const CUPTI_ACTIVITY_FLAG_GLOBAL_ACCESS_KIND_CACHED: CUpti_ActivityFlag = 512;
/** If this bit in flag is set, the metric value overflowed. Valid
 for CUpti_ActivityMetric and CUpti_ActivityMetricInstance.*/
pub const CUPTI_ACTIVITY_FLAG_METRIC_OVERFLOWED: CUpti_ActivityFlag = 1;
/** If this bit in flag is set, the metric value couldn't be
 calculated. This occurs when a value(s) required to calculate the
 metric is missing.  Valid for CUpti_ActivityMetric and
 CUpti_ActivityMetricInstance.*/
pub const CUPTI_ACTIVITY_FLAG_METRIC_VALUE_INVALID: CUpti_ActivityFlag = 2;
/** If this bit in flag is set, the source level metric value couldn't be
 calculated. This occurs when a value(s) required to calculate the
 source level metric cannot be evaluated.
 Valid for CUpti_ActivityInstructionExecution.*/
pub const CUPTI_ACTIVITY_FLAG_INSTRUCTION_VALUE_INVALID: CUpti_ActivityFlag = 1;
/** The mask for the instruction class, \ref CUpti_ActivityInstructionClass
 Valid for CUpti_ActivityInstructionExecution and
 CUpti_ActivityInstructionCorrelation*/
pub const CUPTI_ACTIVITY_FLAG_INSTRUCTION_CLASS_MASK: CUpti_ActivityFlag = 510;
/** When calling cuptiActivityFlushAll, this flag
 can be set to force CUPTI to flush all records in the buffer, whether
 finished or not*/
pub const CUPTI_ACTIVITY_FLAG_FLUSH_FORCED: CUpti_ActivityFlag = 1;
/** The number of bytes requested by each thread
 Valid for CUpti_ActivitySharedAccess.*/
pub const CUPTI_ACTIVITY_FLAG_SHARED_ACCESS_KIND_SIZE_MASK: CUpti_ActivityFlag = 255;
/** If bit in this flag is set, the access was load, else it is a
 store access.  Valid for CUpti_ActivitySharedAccess.*/
pub const CUPTI_ACTIVITY_FLAG_SHARED_ACCESS_KIND_LOAD: CUpti_ActivityFlag = 256;
/** Indicates the activity represents an asynchronous memset
 operation. Valid for CUPTI_ACTIVITY_KIND_MEMSET.*/
pub const CUPTI_ACTIVITY_FLAG_MEMSET_ASYNC: CUpti_ActivityFlag = 1;
/** Indicates the activity represents thrashing in CPU.
 Valid for counter of kind CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_THRASHING in
 CUPTI_ACTIVITY_KIND_UNIFIED_MEMORY_COUNTER*/
pub const CUPTI_ACTIVITY_FLAG_THRASHING_IN_CPU: CUpti_ActivityFlag = 1;
/** Indicates the activity represents page throttling in CPU.
 Valid for counter of kind CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_THROTTLING in
 CUPTI_ACTIVITY_KIND_UNIFIED_MEMORY_COUNTER*/
pub const CUPTI_ACTIVITY_FLAG_THROTTLING_IN_CPU: CUpti_ActivityFlag = 1;
/** Indicates the activity represents page throttling in CPU.
 Valid for counter of kind CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_THROTTLING in
 CUPTI_ACTIVITY_KIND_UNIFIED_MEMORY_COUNTER*/
pub const CUPTI_ACTIVITY_FLAG_FORCE_INT: CUpti_ActivityFlag = 2147483647;
/** \brief Flags associated with activity records.

 Activity record flags. Flags can be combined by bitwise OR to
 associated multiple flags with an activity record. Each flag is
 specific to a certain activity kind, as noted below.*/
pub type CUpti_ActivityFlag = ::std::os::raw::c_uint;
/// Invalid reason
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_INVALID: CUpti_ActivityPCSamplingStallReason = 0;
/// No stall, instruction is selected for issue
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_NONE: CUpti_ActivityPCSamplingStallReason = 1;
/** Warp is blocked because next instruction is not yet available,
 because of instruction cache miss, or because of branching effects*/
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_INST_FETCH: CUpti_ActivityPCSamplingStallReason = 2;
/// Instruction is waiting on an arithmetic dependency
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_EXEC_DEPENDENCY: CUpti_ActivityPCSamplingStallReason = 3;
/// Warp is blocked because it is waiting for a memory access to complete.
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_MEMORY_DEPENDENCY: CUpti_ActivityPCSamplingStallReason = 4;
/// Texture sub-system is fully utilized or has too many outstanding requests.
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_TEXTURE: CUpti_ActivityPCSamplingStallReason = 5;
/// Warp is blocked as it is waiting at __syncthreads() or at memory barrier.
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_SYNC: CUpti_ActivityPCSamplingStallReason = 6;
/// Warp is blocked waiting for __constant__ memory and immediate memory access to complete.
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_CONSTANT_MEMORY_DEPENDENCY: CUpti_ActivityPCSamplingStallReason = 7;
/** Compute operation cannot be performed due to the required resources not
 being available.*/
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_PIPE_BUSY: CUpti_ActivityPCSamplingStallReason = 8;
/// Warp is blocked because there are too many pending memory operations.
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_MEMORY_THROTTLE: CUpti_ActivityPCSamplingStallReason = 9;
/// Warp was ready to issue, but some other warp issued instead.
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_NOT_SELECTED: CUpti_ActivityPCSamplingStallReason = 10;
/// Miscellaneous reasons
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_OTHER: CUpti_ActivityPCSamplingStallReason = 11;
/// Sleeping.
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_SLEEPING: CUpti_ActivityPCSamplingStallReason = 12;
/// Sleeping.
pub const CUPTI_ACTIVITY_PC_SAMPLING_STALL_FORCE_INT: CUpti_ActivityPCSamplingStallReason = 2147483647;
/// \brief The stall reason for PC sampling activity.
pub type CUpti_ActivityPCSamplingStallReason = ::std::os::raw::c_uint;
/// The PC sampling period is not set.
pub const CUPTI_ACTIVITY_PC_SAMPLING_PERIOD_INVALID: CUpti_ActivityPCSamplingPeriod = 0;
/// Minimum sampling period available on the device.
pub const CUPTI_ACTIVITY_PC_SAMPLING_PERIOD_MIN: CUpti_ActivityPCSamplingPeriod = 1;
/// Sampling period in lower range.
pub const CUPTI_ACTIVITY_PC_SAMPLING_PERIOD_LOW: CUpti_ActivityPCSamplingPeriod = 2;
/// Medium sampling period.
pub const CUPTI_ACTIVITY_PC_SAMPLING_PERIOD_MID: CUpti_ActivityPCSamplingPeriod = 3;
/// Sampling period in higher range.
pub const CUPTI_ACTIVITY_PC_SAMPLING_PERIOD_HIGH: CUpti_ActivityPCSamplingPeriod = 4;
/// Maximum sampling period available on the device.
pub const CUPTI_ACTIVITY_PC_SAMPLING_PERIOD_MAX: CUpti_ActivityPCSamplingPeriod = 5;
/// Maximum sampling period available on the device.
pub const CUPTI_ACTIVITY_PC_SAMPLING_PERIOD_FORCE_INT: CUpti_ActivityPCSamplingPeriod = 2147483647;
/** \brief Sampling period for PC sampling method

 Sampling period can be set using \ref cuptiActivityConfigurePCSampling*/
pub type CUpti_ActivityPCSamplingPeriod = ::std::os::raw::c_uint;
/// The memory copy kind is not known.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_UNKNOWN: CUpti_ActivityMemcpyKind = 0;
/// A host to device memory copy.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_HTOD: CUpti_ActivityMemcpyKind = 1;
/// A device to host memory copy.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_DTOH: CUpti_ActivityMemcpyKind = 2;
/// A host to device array memory copy.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_HTOA: CUpti_ActivityMemcpyKind = 3;
/// A device array to host memory copy.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_ATOH: CUpti_ActivityMemcpyKind = 4;
/// A device array to device array memory copy.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_ATOA: CUpti_ActivityMemcpyKind = 5;
/// A device array to device memory copy.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_ATOD: CUpti_ActivityMemcpyKind = 6;
/// A device to device array memory copy.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_DTOA: CUpti_ActivityMemcpyKind = 7;
/// A device to device memory copy on the same device.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_DTOD: CUpti_ActivityMemcpyKind = 8;
/// A host to host memory copy.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_HTOH: CUpti_ActivityMemcpyKind = 9;
/// A peer to peer memory copy across different devices.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_PTOP: CUpti_ActivityMemcpyKind = 10;
/// A peer to peer memory copy across different devices.
pub const CUPTI_ACTIVITY_MEMCPY_KIND_FORCE_INT: CUpti_ActivityMemcpyKind = 2147483647;
/** \brief The kind of a memory copy, indicating the source and
 destination targets of the copy.

 Each kind represents the source and destination targets of a memory
 copy. Targets are host, device, and array.*/
pub type CUpti_ActivityMemcpyKind = ::std::os::raw::c_uint;
/// The memory kind is unknown.
pub const CUPTI_ACTIVITY_MEMORY_KIND_UNKNOWN: CUpti_ActivityMemoryKind = 0;
/// The memory is pageable.
pub const CUPTI_ACTIVITY_MEMORY_KIND_PAGEABLE: CUpti_ActivityMemoryKind = 1;
/// The memory is pinned.
pub const CUPTI_ACTIVITY_MEMORY_KIND_PINNED: CUpti_ActivityMemoryKind = 2;
/// The memory is on the device.
pub const CUPTI_ACTIVITY_MEMORY_KIND_DEVICE: CUpti_ActivityMemoryKind = 3;
/// The memory is an array.
pub const CUPTI_ACTIVITY_MEMORY_KIND_ARRAY: CUpti_ActivityMemoryKind = 4;
/// The memory is managed
pub const CUPTI_ACTIVITY_MEMORY_KIND_MANAGED: CUpti_ActivityMemoryKind = 5;
/// The memory is device static
pub const CUPTI_ACTIVITY_MEMORY_KIND_DEVICE_STATIC: CUpti_ActivityMemoryKind = 6;
/// The memory is managed static
pub const CUPTI_ACTIVITY_MEMORY_KIND_MANAGED_STATIC: CUpti_ActivityMemoryKind = 7;
/// The memory is managed static
pub const CUPTI_ACTIVITY_MEMORY_KIND_FORCE_INT: CUpti_ActivityMemoryKind = 2147483647;
/** \brief The kinds of memory accessed by a memory operation/copy.

 Each kind represents the type of the memory
 accessed by a memory operation/copy.*/
pub type CUpti_ActivityMemoryKind = ::std::os::raw::c_uint;
/// The preemption kind is not known.
pub const CUPTI_ACTIVITY_PREEMPTION_KIND_UNKNOWN: CUpti_ActivityPreemptionKind = 0;
/// Preemption to save CDP block.
pub const CUPTI_ACTIVITY_PREEMPTION_KIND_SAVE: CUpti_ActivityPreemptionKind = 1;
/// Preemption to restore CDP block.
pub const CUPTI_ACTIVITY_PREEMPTION_KIND_RESTORE: CUpti_ActivityPreemptionKind = 2;
/// Preemption to restore CDP block.
pub const CUPTI_ACTIVITY_PREEMPTION_KIND_FORCE_INT: CUpti_ActivityPreemptionKind = 2147483647;
/// \brief The kind of a preemption activity.
pub type CUpti_ActivityPreemptionKind = ::std::os::raw::c_uint;
/// Unknown data.
pub const CUPTI_ACTIVITY_ENVIRONMENT_UNKNOWN: CUpti_ActivityEnvironmentKind = 0;
/// The environment data is related to speed.
pub const CUPTI_ACTIVITY_ENVIRONMENT_SPEED: CUpti_ActivityEnvironmentKind = 1;
/// The environment data is related to temperature.
pub const CUPTI_ACTIVITY_ENVIRONMENT_TEMPERATURE: CUpti_ActivityEnvironmentKind = 2;
/// The environment data is related to power.
pub const CUPTI_ACTIVITY_ENVIRONMENT_POWER: CUpti_ActivityEnvironmentKind = 3;
/// The environment data is related to cooling.
pub const CUPTI_ACTIVITY_ENVIRONMENT_COOLING: CUpti_ActivityEnvironmentKind = 4;
/// The environment data is related to cooling.
pub const CUPTI_ACTIVITY_ENVIRONMENT_COUNT: CUpti_ActivityEnvironmentKind = 5;
/// The environment data is related to cooling.
pub const CUPTI_ACTIVITY_ENVIRONMENT_KIND_FORCE_INT: CUpti_ActivityEnvironmentKind = 2147483647;
/** \brief The kind of environment data. Used to indicate what type of
 data is being reported by an environment activity record.*/
pub type CUpti_ActivityEnvironmentKind = ::std::os::raw::c_uint;
/** Nothing is running on the GPU and the clocks are dropping to idle
 state.*/
pub const CUPTI_CLOCKS_THROTTLE_REASON_GPU_IDLE: CUpti_EnvironmentClocksThrottleReason = 1;
/// The GPU clocks are limited by a user specified limit.
pub const CUPTI_CLOCKS_THROTTLE_REASON_USER_DEFINED_CLOCKS: CUpti_EnvironmentClocksThrottleReason = 2;
/** A software power scaling algorithm is reducing the clocks below
 requested clocks.*/
pub const CUPTI_CLOCKS_THROTTLE_REASON_SW_POWER_CAP: CUpti_EnvironmentClocksThrottleReason = 4;
/** Hardware slowdown to reduce the clock by a factor of two or more
 is engaged.  This is an indicator of one of the following: 1)
 Temperature is too high, 2) External power brake assertion is
 being triggered (e.g. by the system power supply), 3) Change in
 power state.*/
pub const CUPTI_CLOCKS_THROTTLE_REASON_HW_SLOWDOWN: CUpti_EnvironmentClocksThrottleReason = 8;
/// Some unspecified factor is reducing the clocks.
pub const CUPTI_CLOCKS_THROTTLE_REASON_UNKNOWN: CUpti_EnvironmentClocksThrottleReason = 2147483648;
/// Throttle reason is not supported for this GPU.
pub const CUPTI_CLOCKS_THROTTLE_REASON_UNSUPPORTED: CUpti_EnvironmentClocksThrottleReason = 1073741824;
/// No clock throttling.
pub const CUPTI_CLOCKS_THROTTLE_REASON_NONE: CUpti_EnvironmentClocksThrottleReason = 0;
/// No clock throttling.
pub const CUPTI_CLOCKS_THROTTLE_REASON_FORCE_INT: CUpti_EnvironmentClocksThrottleReason = 2147483647;
/** \brief Reasons for clock throttling.

 The possible reasons that a clock can be throttled. There can be
 more than one reason that a clock is being throttled so these types
 can be combined by bitwise OR.  These are used in the
 clocksThrottleReason field in the Environment Activity Record.*/
pub type CUpti_EnvironmentClocksThrottleReason = ::std::os::raw::c_uint;
/// The unified memory counter scope is not known.
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_SCOPE_UNKNOWN: CUpti_ActivityUnifiedMemoryCounterScope = 0;
/// Collect unified memory counter for single process on one device
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_SCOPE_PROCESS_SINGLE_DEVICE: CUpti_ActivityUnifiedMemoryCounterScope = 1;
/// Collect unified memory counter for single process across all devices
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_SCOPE_PROCESS_ALL_DEVICES: CUpti_ActivityUnifiedMemoryCounterScope = 2;
/// Collect unified memory counter for single process across all devices
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_SCOPE_COUNT: CUpti_ActivityUnifiedMemoryCounterScope = 3;
/// Collect unified memory counter for single process across all devices
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_SCOPE_FORCE_INT: CUpti_ActivityUnifiedMemoryCounterScope = 2147483647;
/// \brief Scope of the unified memory counter (deprecated in CUDA 7.0)
pub type CUpti_ActivityUnifiedMemoryCounterScope = ::std::os::raw::c_uint;
/// The unified memory counter kind is not known.
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_UNKNOWN: CUpti_ActivityUnifiedMemoryCounterKind = 0;
/// Number of bytes transferred from host to device
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_BYTES_TRANSFER_HTOD: CUpti_ActivityUnifiedMemoryCounterKind = 1;
/// Number of bytes transferred from device to host
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_BYTES_TRANSFER_DTOH: CUpti_ActivityUnifiedMemoryCounterKind = 2;
/** Number of CPU page faults, this is only supported on 64 bit
 Linux and Mac platforms*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_CPU_PAGE_FAULT_COUNT: CUpti_ActivityUnifiedMemoryCounterKind = 3;
/** Number of GPU page faults, this is only supported on devices with
 compute capability 6.0 and higher and 64 bit Linux platforms*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_GPU_PAGE_FAULT: CUpti_ActivityUnifiedMemoryCounterKind = 4;
/** Thrashing occurs when data is frequently accessed by
 multiple processors and has to be constantly migrated around
 to achieve data locality. In this case the overhead of migration
 may exceed the benefits of locality.
 This is only supported on 64 bit Linux platforms.*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_THRASHING: CUpti_ActivityUnifiedMemoryCounterKind = 5;
/** Throttling is a prevention technique used by the driver to avoid
 further thrashing. Here, the driver doesn't service the fault for
 one of the contending processors for a specific period of time,
 so that the other processor can run at full-speed.
 This is only supported on 64 bit Linux platforms.*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_THROTTLING: CUpti_ActivityUnifiedMemoryCounterKind = 6;
/** In case throttling does not help, the driver tries to pin the memory
 to a processor for a specific period of time. One of the contending
 processors will have slow  access to the memory, while the other will
 have fast access.
 This is only supported on 64 bit Linux platforms.*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_REMOTE_MAP: CUpti_ActivityUnifiedMemoryCounterKind = 7;
/** Number of bytes transferred from one device to another device.
 This is only supported on 64 bit Linux platforms.*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_BYTES_TRANSFER_DTOD: CUpti_ActivityUnifiedMemoryCounterKind = 8;
/** Number of bytes transferred from one device to another device.
 This is only supported on 64 bit Linux platforms.*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_COUNT: CUpti_ActivityUnifiedMemoryCounterKind = 9;
/** Number of bytes transferred from one device to another device.
 This is only supported on 64 bit Linux platforms.*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_FORCE_INT: CUpti_ActivityUnifiedMemoryCounterKind = 2147483647;
/** \brief Kind of the Unified Memory counter

 Many activities are associated with Unified Memory mechanism; among them
 are transfers from host to device, device to host, page fault at
 host side.*/
pub type CUpti_ActivityUnifiedMemoryCounterKind = ::std::os::raw::c_uint;
/// The unified memory access type is not known
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_ACCESS_TYPE_UNKNOWN: CUpti_ActivityUnifiedMemoryAccessType = 0;
/// The page fault was triggered by read memory instruction
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_ACCESS_TYPE_READ: CUpti_ActivityUnifiedMemoryAccessType = 1;
/// The page fault was triggered by write memory instruction
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_ACCESS_TYPE_WRITE: CUpti_ActivityUnifiedMemoryAccessType = 2;
/// The page fault was triggered by atomic memory instruction
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_ACCESS_TYPE_ATOMIC: CUpti_ActivityUnifiedMemoryAccessType = 3;
/// The page fault was triggered by memory prefetch operation
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_ACCESS_TYPE_PREFETCH: CUpti_ActivityUnifiedMemoryAccessType = 4;
/** \brief Memory access type for unified memory page faults

 This is valid for \ref CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_GPU_PAGE_FAULT
 and \ref CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_CPU_PAGE_FAULT_COUNT*/
pub type CUpti_ActivityUnifiedMemoryAccessType = ::std::os::raw::c_uint;
/// The unified memory migration cause is not known
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_MIGRATION_CAUSE_UNKNOWN: CUpti_ActivityUnifiedMemoryMigrationCause = 0;
/** The unified memory migrated due to an explicit call from
 the user e.g. cudaMemPrefetchAsync*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_MIGRATION_CAUSE_USER: CUpti_ActivityUnifiedMemoryMigrationCause = 1;
/** The unified memory migrated to guarantee data coherence
 e.g. CPU/GPU faults on Pascal+ and kernel launch on pre-Pascal GPUs*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_MIGRATION_CAUSE_COHERENCE: CUpti_ActivityUnifiedMemoryMigrationCause = 2;
/** The unified memory was speculatively migrated by the UVM driver
 before being accessed by the destination processor to improve
 performance*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_MIGRATION_CAUSE_PREFETCH: CUpti_ActivityUnifiedMemoryMigrationCause = 3;
/** The unified memory migrated to the CPU because it was evicted to make
 room for another block of memory on the GPU*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_MIGRATION_CAUSE_EVICTION: CUpti_ActivityUnifiedMemoryMigrationCause = 4;
/** The unified memory migrated to another processor because of access counter
 notifications. Only frequently accessed pages are migrated between CPU and GPU, or
 between peer GPUs.*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_MIGRATION_CAUSE_ACCESS_COUNTERS: CUpti_ActivityUnifiedMemoryMigrationCause = 5;
/** \brief Migration cause of the Unified Memory counter

 This is valid for \ref CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_BYTES_TRANSFER_HTOD and
 \ref CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_BYTES_TRANSFER_DTOH*/
pub type CUpti_ActivityUnifiedMemoryMigrationCause = ::std::os::raw::c_uint;
/// The cause of mapping to remote memory was unknown
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_REMOTE_MAP_CAUSE_UNKNOWN: CUpti_ActivityUnifiedMemoryRemoteMapCause = 0;
/// Mapping to remote memory was added to maintain data coherence.
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_REMOTE_MAP_CAUSE_COHERENCE: CUpti_ActivityUnifiedMemoryRemoteMapCause = 1;
/// Mapping to remote memory was added to prevent further thrashing
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_REMOTE_MAP_CAUSE_THRASHING: CUpti_ActivityUnifiedMemoryRemoteMapCause = 2;
/** Mapping to remote memory was added to enforce the hints
 specified by the programmer or by performance heuristics of the
 UVM driver*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_REMOTE_MAP_CAUSE_POLICY: CUpti_ActivityUnifiedMemoryRemoteMapCause = 3;
/** Mapping to remote memory was added because there is no more
 memory available on the processor and eviction was not
 possible*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_REMOTE_MAP_CAUSE_OUT_OF_MEMORY: CUpti_ActivityUnifiedMemoryRemoteMapCause = 4;
/** Mapping to remote memory was added after the memory was
 evicted to make room for another block of memory on the GPU*/
pub const CUPTI_ACTIVITY_UNIFIED_MEMORY_REMOTE_MAP_CAUSE_EVICTION: CUpti_ActivityUnifiedMemoryRemoteMapCause = 5;
/** \brief Remote memory map cause of the Unified Memory counter

 This is valid for \ref CUPTI_ACTIVITY_UNIFIED_MEMORY_COUNTER_KIND_REMOTE_MAP*/
pub type CUpti_ActivityUnifiedMemoryRemoteMapCause = ::std::os::raw::c_uint;
/// The instruction class is not known.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_UNKNOWN: CUpti_ActivityInstructionClass = 0;
/// Represents a 32 bit floating point operation.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_FP_32: CUpti_ActivityInstructionClass = 1;
/// Represents a 64 bit floating point operation.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_FP_64: CUpti_ActivityInstructionClass = 2;
/// Represents an integer operation.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_INTEGER: CUpti_ActivityInstructionClass = 3;
/// Represents a bit conversion operation.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_BIT_CONVERSION: CUpti_ActivityInstructionClass = 4;
/// Represents a control flow instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_CONTROL_FLOW: CUpti_ActivityInstructionClass = 5;
/// Represents a global load-store instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_GLOBAL: CUpti_ActivityInstructionClass = 6;
/// Represents a shared load-store instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_SHARED: CUpti_ActivityInstructionClass = 7;
/// Represents a local load-store instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_LOCAL: CUpti_ActivityInstructionClass = 8;
/// Represents a generic load-store instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_GENERIC: CUpti_ActivityInstructionClass = 9;
/// Represents a surface load-store instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_SURFACE: CUpti_ActivityInstructionClass = 10;
/// Represents a constant load instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_CONSTANT: CUpti_ActivityInstructionClass = 11;
/// Represents a texture load-store instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_TEXTURE: CUpti_ActivityInstructionClass = 12;
/// Represents a global atomic instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_GLOBAL_ATOMIC: CUpti_ActivityInstructionClass = 13;
/// Represents a shared atomic instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_SHARED_ATOMIC: CUpti_ActivityInstructionClass = 14;
/// Represents a surface atomic instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_SURFACE_ATOMIC: CUpti_ActivityInstructionClass = 15;
/// Represents a inter-thread communication instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_INTER_THREAD_COMMUNICATION: CUpti_ActivityInstructionClass = 16;
/// Represents a barrier instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_BARRIER: CUpti_ActivityInstructionClass = 17;
/// Represents some miscellaneous instructions which do not fit in the above classification.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_MISCELLANEOUS: CUpti_ActivityInstructionClass = 18;
/// Represents a 16 bit floating point operation.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_FP_16: CUpti_ActivityInstructionClass = 19;
/// Represents uniform instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_UNIFORM: CUpti_ActivityInstructionClass = 20;
/// Represents uniform instruction.
pub const CUPTI_ACTIVITY_INSTRUCTION_CLASS_KIND_FORCE_INT: CUpti_ActivityInstructionClass = 2147483647;
/** \brief SASS instruction classification.

 The sass instruction are broadly divided into different class. Each enum represents a classification.*/
pub type CUpti_ActivityInstructionClass = ::std::os::raw::c_uint;
/// Partitioned global cache config unknown.
pub const CUPTI_ACTIVITY_PARTITIONED_GLOBAL_CACHE_CONFIG_UNKNOWN: CUpti_ActivityPartitionedGlobalCacheConfig = 0;
/// Partitioned global cache not supported.
pub const CUPTI_ACTIVITY_PARTITIONED_GLOBAL_CACHE_CONFIG_NOT_SUPPORTED: CUpti_ActivityPartitionedGlobalCacheConfig = 1;
/// Partitioned global cache config off.
pub const CUPTI_ACTIVITY_PARTITIONED_GLOBAL_CACHE_CONFIG_OFF: CUpti_ActivityPartitionedGlobalCacheConfig = 2;
/// Partitioned global cache config on.
pub const CUPTI_ACTIVITY_PARTITIONED_GLOBAL_CACHE_CONFIG_ON: CUpti_ActivityPartitionedGlobalCacheConfig = 3;
/// Partitioned global cache config on.
pub const CUPTI_ACTIVITY_PARTITIONED_GLOBAL_CACHE_CONFIG_FORCE_INT: CUpti_ActivityPartitionedGlobalCacheConfig = 2147483647;
/// \brief Partitioned global caching option
pub type CUpti_ActivityPartitionedGlobalCacheConfig = ::std::os::raw::c_uint;
/// Unknown data.
pub const CUPTI_ACTIVITY_SYNCHRONIZATION_TYPE_UNKNOWN: CUpti_ActivitySynchronizationType = 0;
/// Event synchronize API.
pub const CUPTI_ACTIVITY_SYNCHRONIZATION_TYPE_EVENT_SYNCHRONIZE: CUpti_ActivitySynchronizationType = 1;
/// Stream wait event API.
pub const CUPTI_ACTIVITY_SYNCHRONIZATION_TYPE_STREAM_WAIT_EVENT: CUpti_ActivitySynchronizationType = 2;
/// Stream synchronize API.
pub const CUPTI_ACTIVITY_SYNCHRONIZATION_TYPE_STREAM_SYNCHRONIZE: CUpti_ActivitySynchronizationType = 3;
/// Context synchronize API.
pub const CUPTI_ACTIVITY_SYNCHRONIZATION_TYPE_CONTEXT_SYNCHRONIZE: CUpti_ActivitySynchronizationType = 4;
/// Context synchronize API.
pub const CUPTI_ACTIVITY_SYNCHRONIZATION_TYPE_FORCE_INT: CUpti_ActivitySynchronizationType = 2147483647;
/** \brief Synchronization type.

 The types of synchronization to be used with
 CUpti_ActivitySynchronization2.*/
pub type CUpti_ActivitySynchronizationType = ::std::os::raw::c_uint;
/// Unknown data.
pub const CUPTI_ACTIVITY_STREAM_CREATE_FLAG_UNKNOWN: CUpti_ActivityStreamFlag = 0;
/// Default stream.
pub const CUPTI_ACTIVITY_STREAM_CREATE_FLAG_DEFAULT: CUpti_ActivityStreamFlag = 1;
/// Non-blocking stream.
pub const CUPTI_ACTIVITY_STREAM_CREATE_FLAG_NON_BLOCKING: CUpti_ActivityStreamFlag = 2;
/// Null stream.
pub const CUPTI_ACTIVITY_STREAM_CREATE_FLAG_NULL: CUpti_ActivityStreamFlag = 3;
/// Stream create Mask
pub const CUPTI_ACTIVITY_STREAM_CREATE_MASK: CUpti_ActivityStreamFlag = 65535;
/// Stream create Mask
pub const CUPTI_ACTIVITY_STREAM_CREATE_FLAG_FORCE_INT: CUpti_ActivityStreamFlag = 2147483647;
/** \brief stream type.

 The types of stream to be used with CUpti_ActivityStream.*/
pub type CUpti_ActivityStreamFlag = ::std::os::raw::c_uint;
/// The flag is invalid.
pub const CUPTI_LINK_FLAG_INVALID: CUpti_LinkFlag = 0;
/// Is peer to peer access supported by this link.
pub const CUPTI_LINK_FLAG_PEER_ACCESS: CUpti_LinkFlag = 2;
/// Is system memory access supported by this link.
pub const CUPTI_LINK_FLAG_SYSMEM_ACCESS: CUpti_LinkFlag = 4;
/// Is peer atomic access supported by this link.
pub const CUPTI_LINK_FLAG_PEER_ATOMICS: CUpti_LinkFlag = 8;
/// Is system memory atomic access supported by this link.
pub const CUPTI_LINK_FLAG_SYSMEM_ATOMICS: CUpti_LinkFlag = 16;
/// Is system memory atomic access supported by this link.
pub const CUPTI_LINK_FLAG_FORCE_INT: CUpti_LinkFlag = 2147483647;
/** \brief Link flags.

 Describes link properties, to be used with CUpti_ActivityNvLink.*/
pub type CUpti_LinkFlag = ::std::os::raw::c_uint;
/// The operation is invalid.
pub const CUPTI_ACTIVITY_MEMORY_OPERATION_TYPE_INVALID: CUpti_ActivityMemoryOperationType = 0;
/// Memory is allocated.
pub const CUPTI_ACTIVITY_MEMORY_OPERATION_TYPE_ALLOCATION: CUpti_ActivityMemoryOperationType = 1;
/// Memory is released.
pub const CUPTI_ACTIVITY_MEMORY_OPERATION_TYPE_RELEASE: CUpti_ActivityMemoryOperationType = 2;
/// Memory is released.
pub const CUPTI_ACTIVITY_MEMORY_OPERATION_TYPE_FORCE_INT: CUpti_ActivityMemoryOperationType = 2147483647;
/** \brief Memory operation types.

 Describes the type of memory operation, to be used with CUpti_ActivityMemory4.*/
pub type CUpti_ActivityMemoryOperationType = ::std::os::raw::c_uint;
/// The operation is invalid.
pub const CUPTI_ACTIVITY_MEMORY_POOL_TYPE_INVALID: CUpti_ActivityMemoryPoolType = 0;
/// Memory pool is local to the process.
pub const CUPTI_ACTIVITY_MEMORY_POOL_TYPE_LOCAL: CUpti_ActivityMemoryPoolType = 1;
/// Memory pool is imported by the process.
pub const CUPTI_ACTIVITY_MEMORY_POOL_TYPE_IMPORTED: CUpti_ActivityMemoryPoolType = 2;
/// Memory pool is imported by the process.
pub const CUPTI_ACTIVITY_MEMORY_POOL_TYPE_FORCE_INT: CUpti_ActivityMemoryPoolType = 2147483647;
/** \brief Memory pool types.

 Describes the type of memory pool, to be used with CUpti_ActivityMemory4.*/
pub type CUpti_ActivityMemoryPoolType = ::std::os::raw::c_uint;
/// The operation is invalid.
pub const CUPTI_ACTIVITY_MEMORY_POOL_OPERATION_TYPE_INVALID: CUpti_ActivityMemoryPoolOperationType = 0;
/// Memory pool is created.
pub const CUPTI_ACTIVITY_MEMORY_POOL_OPERATION_TYPE_CREATED: CUpti_ActivityMemoryPoolOperationType = 1;
/// Memory pool is destroyed.
pub const CUPTI_ACTIVITY_MEMORY_POOL_OPERATION_TYPE_DESTROYED: CUpti_ActivityMemoryPoolOperationType = 2;
/// Memory pool is trimmed.
pub const CUPTI_ACTIVITY_MEMORY_POOL_OPERATION_TYPE_TRIMMED: CUpti_ActivityMemoryPoolOperationType = 3;
/// Memory pool is trimmed.
pub const CUPTI_ACTIVITY_MEMORY_POOL_OPERATION_TYPE_FORCE_INT: CUpti_ActivityMemoryPoolOperationType = 2147483647;
/** \brief Memory pool operation types.

 Describes the type of memory pool operation, to be used with CUpti_ActivityMemoryPool2.*/
pub type CUpti_ActivityMemoryPoolOperationType = ::std::os::raw::c_uint;
pub const CUPTI_CHANNEL_TYPE_INVALID: CUpti_ChannelType = 0;
/// Channel is used for standard work launch and tracking
pub const CUPTI_CHANNEL_TYPE_COMPUTE: CUpti_ChannelType = 1;
/** Channel is used by an asynchronous copy engine
 For confidential compute configurations, work launch and
 completion are done using the copy engines.*/
pub const CUPTI_CHANNEL_TYPE_ASYNC_MEMCPY: CUpti_ChannelType = 2;
/// Channel is used for memory decompression operations
pub const CUPTI_CHANNEL_TYPE_DECOMP: CUpti_ChannelType = 3;
/// Channel is used for memory decompression operations
pub const CUPTI_CHANNEL_TYPE_FORCE_INT: CUpti_ChannelType = 2147483647;
pub type CUpti_ChannelType = ::std::os::raw::c_uint;
/// Regular (non-CIG) mode
pub const CUPTI_CONTEXT_CIG_MODE_NONE: CUpti_ContextCigMode = 0;
/// CIG mode
pub const CUPTI_CONTEXT_CIG_MODE_CIG: CUpti_ContextCigMode = 1;
/// CIG fallback mode
pub const CUPTI_CONTEXT_CIG_MODE_CIG_FALLBACK: CUpti_ContextCigMode = 2;
/// CIG fallback mode
pub const CUPTI_CONTEXT_CIG_MODE_FORCE_INT: CUpti_ContextCigMode = 2147483647;
/** \brief CIG (CUDA in Graphics) Modes.

 Describes the CIG modes associated with the CUDA context.*/
pub type CUpti_ContextCigMode = ::std::os::raw::c_uint;
/// The payload type is not known.
pub const CUPTI_NVTX_EXT_PAYLOAD_TYPE_UNKNOWN: CUpti_NvtxExtPayloadType = 0;
/// The payload type is a schema.
pub const CUPTI_NVTX_EXT_PAYLOAD_TYPE_SCHEMA: CUpti_NvtxExtPayloadType = 1;
/// The payload type is an enum.
pub const CUPTI_NVTX_EXT_PAYLOAD_TYPE_ENUM: CUpti_NvtxExtPayloadType = 2;
/// The payload type is an enum.
pub const CUPTI_NVTX_EXT_PAYLOAD_TYPE_FORCE_INT: CUpti_NvtxExtPayloadType = 2147483647;
pub type CUpti_NvtxExtPayloadType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_NvtxExtPayloadAttr {
    /// Size of the struct in bytes.
    pub structSize: u32,
    /// The payload type. \ref CUpti_NvtxExtPayloadType
    pub type_: u32,
    /** The attributes of the payload.
 Depending on the type, typecast the pointer:
 CUPTI_NVTX_EXT_PAYLOAD_TYPE_SCHEMA: nvtxPayloadSchemaAttr_t
 CUPTI_NVTX_EXT_PAYLOAD_TYPE_ENUM: nvtxPayloadEnumAttr_t*/
    pub attributes: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_NvtxExtPayloadAttr",
    ][::std::mem::size_of::<CUpti_NvtxExtPayloadAttr>() - 16usize];
    [
        "Alignment of CUpti_NvtxExtPayloadAttr",
    ][::std::mem::align_of::<CUpti_NvtxExtPayloadAttr>() - 8usize];
    [
        "Offset of field: CUpti_NvtxExtPayloadAttr::structSize",
    ][::std::mem::offset_of!(CUpti_NvtxExtPayloadAttr, structSize) - 0usize];
    [
        "Offset of field: CUpti_NvtxExtPayloadAttr::type_",
    ][::std::mem::offset_of!(CUpti_NvtxExtPayloadAttr, type_) - 4usize];
    [
        "Offset of field: CUpti_NvtxExtPayloadAttr::attributes",
    ][::std::mem::offset_of!(CUpti_NvtxExtPayloadAttr, attributes) - 8usize];
};
impl Default for CUpti_NvtxExtPayloadAttr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief Unified Memory counters configuration structure

 This structure controls the enable/disable of the various
 Unified Memory counters consisting of scope, kind and other parameters.
 See function \ref cuptiActivityConfigureUnifiedMemoryCounter*/
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_ActivityUnifiedMemoryCounterConfig {
    /// Unified Memory counter Counter scope. (deprecated in CUDA 7.0)
    pub scope: CUpti_ActivityUnifiedMemoryCounterScope,
    /// Unified Memory counter Counter kind
    pub kind: CUpti_ActivityUnifiedMemoryCounterKind,
    /** Device id of the target device. This is relevant only
 for single device scopes. (deprecated in CUDA 7.0)*/
    pub deviceId: u32,
    /** Control to enable/disable the counter. To enable the counter
 set it to non-zero value while disable is indicated by zero.*/
    pub enable: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityUnifiedMemoryCounterConfig",
    ][::std::mem::size_of::<CUpti_ActivityUnifiedMemoryCounterConfig>() - 16usize];
    [
        "Alignment of CUpti_ActivityUnifiedMemoryCounterConfig",
    ][::std::mem::align_of::<CUpti_ActivityUnifiedMemoryCounterConfig>() - 8usize];
    [
        "Offset of field: CUpti_ActivityUnifiedMemoryCounterConfig::scope",
    ][::std::mem::offset_of!(CUpti_ActivityUnifiedMemoryCounterConfig, scope) - 0usize];
    [
        "Offset of field: CUpti_ActivityUnifiedMemoryCounterConfig::kind",
    ][::std::mem::offset_of!(CUpti_ActivityUnifiedMemoryCounterConfig, kind) - 4usize];
    [
        "Offset of field: CUpti_ActivityUnifiedMemoryCounterConfig::deviceId",
    ][::std::mem::offset_of!(CUpti_ActivityUnifiedMemoryCounterConfig, deviceId)
        - 8usize];
    [
        "Offset of field: CUpti_ActivityUnifiedMemoryCounterConfig::enable",
    ][::std::mem::offset_of!(CUpti_ActivityUnifiedMemoryCounterConfig, enable)
        - 12usize];
};
impl Default for CUpti_ActivityUnifiedMemoryCounterConfig {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief Device auto boost state structure

 This structure defines auto boost state for a device.
 See function \ref cuptiGetAutoBoostState*/
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Default, Copy, Clone)]
pub struct CUpti_ActivityAutoBoostState {
    /** Returned auto boost state. 1 is returned in case auto boost is enabled, 0
 otherwise*/
    pub enabled: u32,
    /** Id of process that has set the current boost state. The value will be
 CUPTI_AUTO_BOOST_INVALID_CLIENT_PID if the user does not have the
 permission to query process ids or there is an error in querying the
 process id.*/
    pub pid: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityAutoBoostState",
    ][::std::mem::size_of::<CUpti_ActivityAutoBoostState>() - 8usize];
    [
        "Alignment of CUpti_ActivityAutoBoostState",
    ][::std::mem::align_of::<CUpti_ActivityAutoBoostState>() - 8usize];
    [
        "Offset of field: CUpti_ActivityAutoBoostState::enabled",
    ][::std::mem::offset_of!(CUpti_ActivityAutoBoostState, enabled) - 0usize];
    [
        "Offset of field: CUpti_ActivityAutoBoostState::pid",
    ][::std::mem::offset_of!(CUpti_ActivityAutoBoostState, pid) - 4usize];
};
/** \brief PC sampling configuration structure

 This structure defines the pc sampling configuration.

 See function \ref cuptiActivityConfigurePCSampling*/
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_ActivityPCSamplingConfig {
    /** Size of configuration structure.
 CUPTI client should set the size of the structure. It will be used in CUPTI to check what fields are
 available in the structure. Used to preserve backward compatibility.*/
    pub size: u32,
    /** There are 5 level provided for sampling period. The level
 internally maps to a period in terms of cycles. Same level can
 map to different number of cycles on different gpus. No of
 cycles will be chosen to minimize information loss. The period
 chosen will be given by samplingPeriodInCycles in
 \ref CUpti_ActivityPCSamplingRecordInfo for each kernel instance.*/
    pub samplingPeriod: CUpti_ActivityPCSamplingPeriod,
    /** This will override the period set by samplingPeriod. Value 0 in samplingPeriod2 will be
 considered as samplingPeriod2 should not be used and samplingPeriod should be used.
 Valid values for samplingPeriod2 are between 5 to 31 both inclusive.
 This will set the sampling period to (2^samplingPeriod2) cycles.*/
    pub samplingPeriod2: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityPCSamplingConfig",
    ][::std::mem::size_of::<CUpti_ActivityPCSamplingConfig>() - 16usize];
    [
        "Alignment of CUpti_ActivityPCSamplingConfig",
    ][::std::mem::align_of::<CUpti_ActivityPCSamplingConfig>() - 8usize];
    [
        "Offset of field: CUpti_ActivityPCSamplingConfig::size",
    ][::std::mem::offset_of!(CUpti_ActivityPCSamplingConfig, size) - 0usize];
    [
        "Offset of field: CUpti_ActivityPCSamplingConfig::samplingPeriod",
    ][::std::mem::offset_of!(CUpti_ActivityPCSamplingConfig, samplingPeriod) - 4usize];
    [
        "Offset of field: CUpti_ActivityPCSamplingConfig::samplingPeriod2",
    ][::std::mem::offset_of!(CUpti_ActivityPCSamplingConfig, samplingPeriod2) - 8usize];
};
impl Default for CUpti_ActivityPCSamplingConfig {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief The base activity record.

 The activity API uses a CUpti_Activity as a generic representation
 for any activity. The 'kind' field is used to determine the
 specific activity kind, and from that the CUpti_Activity object can
 be cast to the specific activity record type appropriate for that kind.

 Note that all activity record types are padded and aligned to
 ensure that each member of the record is naturally aligned.

 \see CUpti_ActivityKind*/
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_Activity {
    /// The kind of this activity.
    pub kind: CUpti_ActivityKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUpti_Activity"][::std::mem::size_of::<CUpti_Activity>() - 8usize];
    ["Alignment of CUpti_Activity"][::std::mem::align_of::<CUpti_Activity>() - 8usize];
    [
        "Offset of field: CUpti_Activity::kind",
    ][::std::mem::offset_of!(CUpti_Activity, kind) - 0usize];
};
impl Default for CUpti_Activity {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief The activity record for memory copies.

 This activity record represents a memory copy
 (CUPTI_ACTIVITY_KIND_MEMCPY).*/
#[repr(C, packed(8))]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_ActivityMemcpy6 {
    /// The activity record kind, must be CUPTI_ACTIVITY_KIND_MEMCPY.
    pub kind: CUpti_ActivityKind,
    /** The kind of the memory copy, stored as a byte to reduce record
 size. \see CUpti_ActivityMemcpyKind*/
    pub copyKind: u8,
    /** The source memory kind read by the memory copy, stored as a byte
 to reduce record size. \see CUpti_ActivityMemoryKind*/
    pub srcKind: u8,
    /** The destination memory kind read by the memory copy, stored as a
 byte to reduce record size. \see CUpti_ActivityMemoryKind*/
    pub dstKind: u8,
    /// The flags associated with the memory copy. \see CUpti_ActivityFlag
    pub flags: u8,
    /// The number of bytes transferred by the memory copy.
    pub bytes: u64,
    /** The start timestamp for the memory copy, in ns. A value of 0 for
 both the start and end timestamps indicates that timestamp
 information could not be collected for the memory copy.*/
    pub start: u64,
    /** The end timestamp for the memory copy, in ns. A value of 0 for
 both the start and end timestamps indicates that timestamp
 information could not be collected for the memory copy.*/
    pub end: u64,
    /// The ID of the device where the memory copy is occurring.
    pub deviceId: u32,
    /// The ID of the context where the memory copy is occurring.
    pub contextId: u32,
    /// The ID of the stream where the memory copy is occurring.
    pub streamId: u32,
    /** The correlation ID of the memory copy. Each memory copy is
 assigned a unique correlation ID that is identical to the
 correlation ID in the driver API activity record that launched
 the memory copy.*/
    pub correlationId: u32,
    /** The runtime correlation ID of the memory copy. Each memory copy
 is assigned a unique runtime correlation ID that is identical to
 the correlation ID in the runtime API activity record that
 launched the memory copy.*/
    pub runtimeCorrelationId: u32,
    /// Undefined. Reserved for internal use.
    pub pad: u32,
    /// Undefined. Reserved for internal use.
    pub reserved0: *mut ::std::os::raw::c_void,
    /** The unique ID of the graph node that executed this memcpy through graph launch.
 This field will be 0 if the memcpy is not done through graph launch.*/
    pub graphNodeId: u64,
    /** The unique ID of the graph that executed this memcpy through graph launch.
 This field will be 0 if the memcpy is not done through graph launch.*/
    pub graphId: u32,
    /// The ID of the HW channel on which the memory copy is occurring.
    pub channelID: u32,
    /// The type of the channel
    pub channelType: CUpti_ChannelType,
    /// This field is used to indicate if the memcpy operation is part of a device graph launch.
    pub isDeviceLaunched: u8,
    ///  Reserved for internal use.
    pub pad2: [u8; 3usize],
    /** The total number of memcopy operations traced in this record.
 This field is valid for memcpy operations happening using
 MemcpyBatchAsync APIs in CUDA.
 In MemcpyBatchAsync APIs, multiple memcpy operations are batched
 together for optimization purposes based on certain heuristics.
 For other memcpy operations, this field will be 1.*/
    pub copyCount: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityMemcpy6",
    ][::std::mem::size_of::<CUpti_ActivityMemcpy6>() - 96usize];
    [
        "Alignment of CUpti_ActivityMemcpy6",
    ][::std::mem::align_of::<CUpti_ActivityMemcpy6>() - 8usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::kind",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, kind) - 0usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::copyKind",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, copyKind) - 4usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::srcKind",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, srcKind) - 5usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::dstKind",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, dstKind) - 6usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::flags",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, flags) - 7usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::bytes",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, bytes) - 8usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::start",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, start) - 16usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::end",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, end) - 24usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::deviceId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, deviceId) - 32usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::contextId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, contextId) - 36usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::streamId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, streamId) - 40usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::correlationId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, correlationId) - 44usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::runtimeCorrelationId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, runtimeCorrelationId) - 48usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::pad",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, pad) - 52usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::reserved0",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, reserved0) - 56usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::graphNodeId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, graphNodeId) - 64usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::graphId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, graphId) - 72usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::channelID",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, channelID) - 76usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::channelType",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, channelType) - 80usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::isDeviceLaunched",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, isDeviceLaunched) - 84usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::pad2",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, pad2) - 85usize];
    [
        "Offset of field: CUpti_ActivityMemcpy6::copyCount",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpy6, copyCount) - 88usize];
};
impl Default for CUpti_ActivityMemcpy6 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief The activity record for peer-to-peer memory copies.

 This activity record represents a peer-to-peer memory copy
 (CUPTI_ACTIVITY_KIND_MEMCPY2).*/
#[repr(C, packed(8))]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_ActivityMemcpyPtoP4 {
    /// The activity record kind, must be CUPTI_ACTIVITY_KIND_MEMCPY2.
    pub kind: CUpti_ActivityKind,
    /** The kind of the memory copy, stored as a byte to reduce record
 size.  \see CUpti_ActivityMemcpyKind*/
    pub copyKind: u8,
    /** The source memory kind read by the memory copy, stored as a byte
 to reduce record size.  \see CUpti_ActivityMemoryKind*/
    pub srcKind: u8,
    /** The destination memory kind read by the memory copy, stored as a
 byte to reduce record size.  \see CUpti_ActivityMemoryKind*/
    pub dstKind: u8,
    /** The flags associated with the memory copy. \see
 CUpti_ActivityFlag*/
    pub flags: u8,
    /// The number of bytes transferred by the memory copy.
    pub bytes: u64,
    /** The start timestamp for the memory copy, in ns. A value of 0 for
 both the start and end timestamps indicates that timestamp
 information could not be collected for the memory copy.*/
    pub start: u64,
    /** The end timestamp for the memory copy, in ns. A value of 0 for
 both the start and end timestamps indicates that timestamp
 information could not be collected for the memory copy.*/
    pub end: u64,
    /// The ID of the device where the memory copy is occurring.
    pub deviceId: u32,
    /// The ID of the context where the memory copy is occurring.
    pub contextId: u32,
    /// The ID of the stream where the memory copy is occurring.
    pub streamId: u32,
    /// The ID of the device where memory is being copied from.
    pub srcDeviceId: u32,
    /// The ID of the context owning the memory being copied from.
    pub srcContextId: u32,
    /// The ID of the device where memory is being copied to.
    pub dstDeviceId: u32,
    /// The ID of the context owning the memory being copied to.
    pub dstContextId: u32,
    /** The correlation ID of the memory copy. Each memory copy is
 assigned a unique correlation ID that is identical to the
 correlation ID in the driver and runtime API activity record that
 launched the memory copy.*/
    pub correlationId: u32,
    /// Undefined. Reserved for internal use.
    pub reserved0: *mut ::std::os::raw::c_void,
    /** The unique ID of the graph node that executed the memcpy through graph launch.
 This field will be 0 if memcpy is not done using graph launch.*/
    pub graphNodeId: u64,
    /** The unique ID of the graph that executed this memcpy through graph launch.
 This field will be 0 if the memcpy is not done through graph launch.*/
    pub graphId: u32,
    /// The ID of the HW channel on which the memory copy is occurring.
    pub channelID: u32,
    /// The type of the channel
    pub channelType: CUpti_ChannelType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityMemcpyPtoP4",
    ][::std::mem::size_of::<CUpti_ActivityMemcpyPtoP4>() - 96usize];
    [
        "Alignment of CUpti_ActivityMemcpyPtoP4",
    ][::std::mem::align_of::<CUpti_ActivityMemcpyPtoP4>() - 8usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::kind",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, kind) - 0usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::copyKind",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, copyKind) - 4usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::srcKind",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, srcKind) - 5usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::dstKind",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, dstKind) - 6usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::flags",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, flags) - 7usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::bytes",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, bytes) - 8usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::start",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, start) - 16usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::end",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, end) - 24usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::deviceId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, deviceId) - 32usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::contextId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, contextId) - 36usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::streamId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, streamId) - 40usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::srcDeviceId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, srcDeviceId) - 44usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::srcContextId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, srcContextId) - 48usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::dstDeviceId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, dstDeviceId) - 52usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::dstContextId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, dstContextId) - 56usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::correlationId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, correlationId) - 60usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::reserved0",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, reserved0) - 64usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::graphNodeId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, graphNodeId) - 72usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::graphId",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, graphId) - 80usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::channelID",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, channelID) - 84usize];
    [
        "Offset of field: CUpti_ActivityMemcpyPtoP4::channelType",
    ][::std::mem::offset_of!(CUpti_ActivityMemcpyPtoP4, channelType) - 88usize];
};
impl Default for CUpti_ActivityMemcpyPtoP4 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief The activity record for memset.

 This activity record represents a memory set operation
 (CUPTI_ACTIVITY_KIND_MEMSET).*/
#[repr(C, packed(8))]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_ActivityMemset4 {
    /// The activity record kind, must be CUPTI_ACTIVITY_KIND_MEMSET.
    pub kind: CUpti_ActivityKind,
    /// The value being assigned to memory by the memory set.
    pub value: u32,
    /// The number of bytes being set by the memory set.
    pub bytes: u64,
    /** The start timestamp for the memory set, in ns. A value of 0 for
 both the start and end timestamps indicates that timestamp
 information could not be collected for the memory set.*/
    pub start: u64,
    /** The end timestamp for the memory set, in ns. A value of 0 for
 both the start and end timestamps indicates that timestamp
 information could not be collected for the memory set.*/
    pub end: u64,
    /// The ID of the device where the memory set is occurring.
    pub deviceId: u32,
    /// The ID of the context where the memory set is occurring.
    pub contextId: u32,
    /// The ID of the stream where the memory set is occurring.
    pub streamId: u32,
    /** The correlation ID of the memory set. Each memory set is assigned
 a unique correlation ID that is identical to the correlation ID
 in the driver API activity record that launched the memory set.*/
    pub correlationId: u32,
    /// The flags associated with the memset. \see CUpti_ActivityFlag
    pub flags: u16,
    /// The memory kind of the memory set \see CUpti_ActivityMemoryKind
    pub memoryKind: u16,
    /// Undefined. Reserved for internal use.
    pub pad: u32,
    /// Undefined. Reserved for internal use.
    pub reserved0: *mut ::std::os::raw::c_void,
    /** The unique ID of the graph node that executed this memset through graph launch.
 This field will be 0 if the memset is not executed through graph launch.*/
    pub graphNodeId: u64,
    /** The unique ID of the graph that executed this memset through graph launch.
 This field will be 0 if the memset is not executed through graph launch.*/
    pub graphId: u32,
    /// The ID of the HW channel on which the memory set is occurring.
    pub channelID: u32,
    /// The type of the channel
    pub channelType: CUpti_ChannelType,
    /// This field is used to indicate if the memset operation is part of a device graph launch.
    pub isDeviceLaunched: u8,
    ///  Undefined. Reserved for internal use
    pub pad2: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityMemset4",
    ][::std::mem::size_of::<CUpti_ActivityMemset4>() - 88usize];
    [
        "Alignment of CUpti_ActivityMemset4",
    ][::std::mem::align_of::<CUpti_ActivityMemset4>() - 8usize];
    [
        "Offset of field: CUpti_ActivityMemset4::kind",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, kind) - 0usize];
    [
        "Offset of field: CUpti_ActivityMemset4::value",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, value) - 4usize];
    [
        "Offset of field: CUpti_ActivityMemset4::bytes",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, bytes) - 8usize];
    [
        "Offset of field: CUpti_ActivityMemset4::start",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, start) - 16usize];
    [
        "Offset of field: CUpti_ActivityMemset4::end",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, end) - 24usize];
    [
        "Offset of field: CUpti_ActivityMemset4::deviceId",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, deviceId) - 32usize];
    [
        "Offset of field: CUpti_ActivityMemset4::contextId",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, contextId) - 36usize];
    [
        "Offset of field: CUpti_ActivityMemset4::streamId",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, streamId) - 40usize];
    [
        "Offset of field: CUpti_ActivityMemset4::correlationId",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, correlationId) - 44usize];
    [
        "Offset of field: CUpti_ActivityMemset4::flags",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, flags) - 48usize];
    [
        "Offset of field: CUpti_ActivityMemset4::memoryKind",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, memoryKind) - 50usize];
    [
        "Offset of field: CUpti_ActivityMemset4::pad",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, pad) - 52usize];
    [
        "Offset of field: CUpti_ActivityMemset4::reserved0",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, reserved0) - 56usize];
    [
        "Offset of field: CUpti_ActivityMemset4::graphNodeId",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, graphNodeId) - 64usize];
    [
        "Offset of field: CUpti_ActivityMemset4::graphId",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, graphId) - 72usize];
    [
        "Offset of field: CUpti_ActivityMemset4::channelID",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, channelID) - 76usize];
    [
        "Offset of field: CUpti_ActivityMemset4::channelType",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, channelType) - 80usize];
    [
        "Offset of field: CUpti_ActivityMemset4::isDeviceLaunched",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, isDeviceLaunched) - 84usize];
    [
        "Offset of field: CUpti_ActivityMemset4::pad2",
    ][::std::mem::offset_of!(CUpti_ActivityMemset4, pad2) - 85usize];
};
impl Default for CUpti_ActivityMemset4 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief The activity record for memory.

 This activity record represents a memory allocation and free operation
 (CUPTI_ACTIVITY_KIND_MEMORY).
 This activity record provides a single record for the memory
 allocation and memory release operations.

 Note: It is recommended to move to the new activity record \ref CUpti_ActivityMemory4
 enabled using the kind \ref CUPTI_ACTIVITY_KIND_MEMORY2.
 \ref CUpti_ActivityMemory4 provides separate records for memory
 allocation and memory release operations. This allows to correlate the
 corresponding driver and runtime API activity record with the memory operation.*/
#[repr(C, packed(8))]
#[derive(Debug, Copy, Clone)]
pub struct CUpti_ActivityMemory {
    /// The activity record kind, must be CUPTI_ACTIVITY_KIND_MEMORY
    pub kind: CUpti_ActivityKind,
    /// The memory kind requested by the user
    pub memoryKind: CUpti_ActivityMemoryKind,
    /// The virtual address of the allocation
    pub address: u64,
    /// The number of bytes of memory allocated.
    pub bytes: u64,
    /** The start timestamp for the memory operation, i.e.
 the time when memory was allocated, in ns.*/
    pub start: u64,
    /** The end timestamp for the memory operation, i.e.
 the time when memory was freed, in ns.
 This will be 0 if memory is not freed in the application*/
    pub end: u64,
    /// The program counter of the allocation of memory
    pub allocPC: u64,
    /** The program counter of the freeing of memory. This will
 be 0 if memory is not freed in the application*/
    pub freePC: u64,
    /// The ID of the process to which this record belongs to.
    pub processId: u32,
    /// The ID of the device where the memory allocation is taking place.
    pub deviceId: u32,
    /// The ID of the context. If context is NULL, \p contextId is set to CUPTI_INVALID_CONTEXT_ID.
    pub contextId: u32,
    /// Undefined. Reserved for internal use.
    pub pad: u32,
    /** Variable name. This name is shared across all activity
 records representing the same symbol, and so should not be
 modified.*/
    pub name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of CUpti_ActivityMemory",
    ][::std::mem::size_of::<CUpti_ActivityMemory>() - 80usize];
    [
        "Alignment of CUpti_ActivityMemory",
    ][::std::mem::align_of::<CUpti_ActivityMemory>() - 8usize];
    [
        "Offset of field: CUpti_ActivityMemory::kind",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, kind) - 0usize];
    [
        "Offset of field: CUpti_ActivityMemory::memoryKind",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, memoryKind) - 4usize];
    [
        "Offset of field: CUpti_ActivityMemory::address",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, address) - 8usize];
    [
        "Offset of field: CUpti_ActivityMemory::bytes",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, bytes) - 16usize];
    [
        "Offset of field: CUpti_ActivityMemory::start",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, start) - 24usize];
    [
        "Offset of field: CUpti_ActivityMemory::end",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, end) - 32usize];
    [
        "Offset of field: CUpti_ActivityMemory::allocPC",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, allocPC) - 40usize];
    [
        "Offset of field: CUpti_ActivityMemory::freePC",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, freePC) - 48usize];
    [
        "Offset of field: CUpti_ActivityMemory::processId",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, processId) - 56usize];
    [
        "Offset of field: CUpti_ActivityMemory::deviceId",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, deviceId) - 60usize];
    [
        "Offset of field: CUpti_ActivityMemory::contextId",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, contextId) - 64usize];
    [
        "Offset of field: CUpti_ActivityMemory::pad",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, pad) - 68usize];
    [
        "Offset of field: CUpti_ActivityMemory::name",
    ][::std::mem::offset_of!(CUpti_ActivityMemory, name) - 72usize];
};
impl Default for CUpti_ActivityMemory {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
/** \brief The activity record for memory.

 This activity record represents a memory allocation and free operation
 (CUPTI_ACTIVITY_KIND_MEMORY2).
 This activity record provides separate records for memory allocation and
 memory release operations.
 This allows to correlate the corresponding driver and runtime API
 activity record with the memory operation.

 Note: This activity record is an upgrade over \ref CUpti_ActivityMemory
 enabled using the kind \ref CUPTI_ACTIVITY_KIND_MEMORY.
 \ref CUpti_ActivityMemory provides a single record for the memory
